{
    "rezepte": [ 
      {
        "name": "Spaghetti Bolognese",
        "ingredients": [
            "3 tbsp olive oil",
            "300g beef mince",
            "200g pork mince",
            "2 large shallots (finely chopped)",
            "2-3 garlic cloves (crushed)",
            "500g passata",
            "1 tbsp tomato purée",
            "100ml red wine",
            "1 tsp dried oregano",
            "400g spaghetti",
            "50g parmesan (finely grated)",
            "a few basil leaves"
        ],
        "preparation": "<br>Put 1 tbsp of the oil in a large saucepan over a medium-high heat, add the beef and fry until well browned. <br><br>Tip out into a dish and repeat with 1 tbsp oil and the pork. <br><br>Tip the pork into the dish with the beef and put the pan back on the heat with the remaining oil. <br><br>Turn the heat down and cook the shallots for 8-10 mins or until very soft, then add the garlic.<br><br> Tip the meat back into the pan and add the passata, purée, wine and oregano.<br><br> Stir everything together, cover and simmer over a low heat, stirring occasionally, for 45 mins. <br><br>Cook the spaghetti following pack instructions, then stir half the parmesan into the Bolognese. Put a spoonful of the pasta water into the sauce to loosen it if it looks too thick, then drain the spaghetti. <br><br>For a better flavour, tip the pasta onto the sauce, toss everything together to coat, and season well (or serve with the sauce on top). Add the remaining parmesan and a few basil leaves.",
        "image": "images/sossendoktor.jpg"
    },
    {
      "name": "Tomato Soup",
      "ingredients": [
          "3 tbsp olive oil",
          "1 Tomato Can"
        
      ],
      "preparation": "<br>Put the can in the pot and add some oil. <br><br>Maybe Salt and Pepper if you have. Enjoy ! ",
      "image": "images/sossendoktor.jpg"
  },

  {
    "name": "Cheese",
    "ingredients": [
        "Cheese"
        
      
    ],
    "preparation": "Enjoy the cheese."
},
    
  {
    "name": "Sweet potato & peanut curry",
    "ingredients": [
      "1 tbsp coconut oil",
      "1 onion (chopped)",
      "2 garlic cloves (grated)",
      "thumb-sized piece ginger (grated)",
      "3 tbsp Thai red curry paste (check the label to make sure it’s vegetarian/ vegan)",
      "1 tbsp smooth peanut butter",
      "500g sweet potato (peeled and cut into chunks)",
      "400ml can coconut milk",
      "200g bag spinach",
      "1 lime (juiced)",
      "cooked rice (to serve (optional))",
      "dry roasted peanuts (to serve (optional))"
    ],
    "preparation": "<br>Melt 1 tbsp coconut oil in a saucepan over a medium heat and soften 1 chopped onion for 5 mins.<br><br> Add 2 grated garlic cloves and a grated thumb-sized piece of ginger, and cook for 1 min until fragrant. <br><br>Stir in 3 tbsp Thai red curry paste, 1 tbsp smooth peanut butter and 500g sweet potato, peeled and cut into chunks, then add 400ml coconut milk and 200ml water.<br><br> Bring to the boil, turn down the heat and simmer, uncovered, for 25-30 mins or until the sweet potato is soft.<br><br> Stir through 200g spinach and the juice of 1 lime, and season well. <br><br>Serve with cooked rice, and if you want some crunch, sprinkle over a few dry roasted peanuts.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "Bean & halloumi stew",
    "ingredients": [
      "3 tbsp olive oil",
      "1 onion (thinly sliced)",
      "1 red pepper (thinly sliced)",
      "2 garlic cloves (crushed)",
      "3 tbsp red chilli pesto",
      "sundried tomato pesto or vegan alternative",
      "1 heaped tsp ground coriander",
      "400g can mixed beans (drained and rinsed)",
      "400g can chopped tomatoes",
      "½ x 250g block halloumi (sliced)",
      "½ small bunch of coriander (finely chopped)",
      "garlic bread (to serve (optional))"
    ],
    "preparation": "<br>Heat 2 tbsp of oil in a frying pan over a medium heat. <br><br>Add the onion and pepper, along with a pinch of salt and fry for 10 mins or until softened.<br><br> Add the garlic, pesto and ground coriander, and cook for 1 min.<br><br> Tip in the beans and tomatoes along with ½ can of water, then bring to a simmer and cook uncovered for 10 mins.<br><br> Add the remaining oil to a separate frying pan over a medium heat. <br><br>Fry the halloumi for 2 mins on each side or until golden brown.<br><br> Taste the beans for seasoning, then spoon into deep bowls. <br><br>Top with the halloumi and scatter over the chopped coriander. <br><br>Serve with garlic bread, if you like.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "Chilli con carne",
    "ingredients": [
      "2 tbsp olive oil",
      "2 large onions (halved and sliced)",
      "3 large garlic cloves (chopped)",
      "2 tbsp mild chilli powder",
      "2 tsp ground cumin",
      "2 tsp dried oregano",
      "1kg pack lean minced beef",
      "400g can chopped tomato",
      "2 beef stock cubes",
      "2 large red peppers (deseeded and cut into chunks)",
      "10 sundried tomatoes",
      "3 x 400g cans red kidney beans (drained)"
    ],
    "preparation": "<br>Heat oven to 150C/fan 130C/gas .<br><br>Heat the oil, preferably in a large flameproof casserole, and fry the onions for 8 mins. Add the garlic, spices and oregano and cook for 1 min, then gradually add the mince, stirring well until browned. <br><br>Stir in the tomatoes, add half a can of water, then crumble in the stock and season. Cover and cook in the oven for 30 mins. <br><br>Stir in the peppers and sundried tomatoes, then cook for 30 mins more until the peppers are tender. <br><br>Stir in the beans. To serve, reheat on the hob until bubbling.<br><br> Serve with avocado or a big salad with avocado in it, some basmati rice or tortilla chips and a bowl of soured cream. <br><br>If you want to use a slow cooker, fry your onions in a pan for 8 mins, then add your garlic, spices and oregano and cook for a minute. <br><br>Gradually add the mince until it's brown.<br><br> Tip into your slow cooker with the tomatoes, peppers, sundried tomatoes and beans, crumble in the stock cubes and season to taste. Cook on Low for 8-10 hours, then serve as above.",
    "image": "images/sossendoktor.jpg"
  },

{
    "name": "Kimchi Rice",
    "ingredients": [
     "rice",
    "kimchi",
    "oil",
    "garlic",
    "spring onion",
    "egg",
    "soy sauce",
    "oyster sauce"
    
    
    ],
    "preparation": "<br>Toast the pumpkin seeds with the cumin seeds in a large frying pan until they begin to pop and smell fragrant, then transfer to a large bowl. Add the cabbage, peppers and vinegar, and season well. Mix thoroughly and set aside.<br><br> Heat oven to low and put the bread in to warm through.<br><br> Using the pan you used to toast the seeds, fry the halloumi with the olive oil in batches for 3 mins each side until crispy and golden. <br><br>Transfer to the oven to keep warm. <br><br>Spread a layer of hummus on each flatbread and top with a handful of slaw, halloumi and rocket to serve.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "Microwave scrambled eggs",
    "ingredients": [
      "2 eggs",
      "2 tbsp whole milk",
      "toast (to serve)"
    ],
    "preparation": "<br>Use a fork to beat together the eggs, milk and a pinch of salt in a microwave-safe jug.<br><br> Cook in the microwave on High for 30 seconds, then beat again and return to the microwave for another 30 seconds. <br><br>Beat again, breaking up any lumps of egg. <br><br>Microwave for another 15 seconds, then beat again; the eggs will be loose at this stage so serve them straightaway if this is how you like them.<br><br> If you prefer your eggs a little firmer, microwave for a further 15 seconds, beat, then serve.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "egg fried rice",
    "ingredients": [
      "a mugful of American long grain rice",
      "a cupful of frozen peas",
      "2 tbsp sunflower oil",
      "2 back bacon rashers (roughly chopped)",
      "1 small red pepper (chopped)",
      "2 garlic cloves (thinly sliced)",
      "2 large eggs",
      "1 heaped tsp Chinese five-spice powder",
      "2 spring onions (shredded)"
    ],
    "preparation": "<br>Fill a roomy saucepan with water, bring to the boil and tip in a heaped teaspoon of salt - the water will bubble furiously. <br><br>Pour in the rice, stir once and return to the boil, then turn the heat down a little so that the water is boiling steadily, but not vigorously. <br><br>Boil uncovered, without stirring (this makes for sticky rice) for 10 minutes. <br><br>After 8 minutes, throw in the frozen peas, boil for 2 minutes and drain (don’t rinse). <br><br>Heat the sunflower oil in a wok and stir fry the bacon for 3-4 minutes until crisp. <br><br>Tip in the red pepper and the garlic cloves and stir fry for 2 minutes. Beat the eggs, pour into the pan and stir fry until the egg just sets.<br><br> Toss in the Chinese 5-spice and the rice and peas. <br><br>Top with the shredded spring onions.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "Smoky chickpeas on toast",
    "ingredients": [
      "1 tsp olive oil (or vegetable oil, plus a drizzle)",
      "1 small onion (or banana shallot, chopped)",
      "2 tsp chipotle paste",
      "250ml passata",
      "400g can chickpeas (drained)",
      "2 tsp honey",
      "2 tsp red wine vinegar",
      "2-4 slices good crusty bread",
      "2 eggs"
    ],
    "preparation": "<br>Heat ½ tsp of the oil in a pan. <br><br>Tip in the onion and cook until soft, about 5-8 mins, then add the chipotle paste, passata, chickpeas, honey and vinegar.<br><br> Season and bubble for 5 mins. <br><br>Toast the bread. <br><br>Heat the remaining oil in a frying pan and fry the eggs. <br><br>Drizzle the toast with a little oil, then top with the chickpeas and fried eggs.",
    "image": "images/sossendoktor.jpg"
  },

  {
    "name": "Vietnamese Grilled Pork (bun-thit-nuong)",
    "ingredients": [
      "1.5 pounds sliced Pork",
      "1 package thin Rice Vermicelli",
      "4-6 Egg Rolls",
      "3 tablespoons minced Challots",
      "1.5 tablespoons minced Garlic",
      "¼ cup Sugar",
      "1 tablespoon Fish Sauce",
      "½ tablespoon thick Soy sauce",
      "½ tablespoon Pepper",
      "3 tablespoons Olive Oil",
      "Sliced Cucumber",
      "Mint Leaves",
      "Crushed Peanuts"
    ],
    "preparation": "<br>Slice the uncooked pork thinly, about ⅛. It helps to slightly freeze it (optional).<br><br>Mince garlic and shallots.<br><br> Mix in a bowl with sugar, fish sauce, thick soy sauce, pepper, and oil until sugar dissolves.<br><br>Marinate the meat for 1 hour, or overnight for better results.<br><br>Bake the pork at 375°F for 10-15 minutes or until about 80% cooked. Finish cooking by broiling in the oven until a nice golden brown color develops, flipping the pieces midway.<br><br>Assemble your bowl with veggies, noodles, and garnish. Many like to mix the whole bowl up and pour the fish sauce on top, but I like to make individual bites and sauce it slowly.",
    "image": "https://www.themealdb.com/images/media/meals/qqwypw1504642429.jpg"
  },


  {
    "name": "pizza sauce à la doktor",
    "ingredients": [
      "1 can of tomatoes (whole or chopped)",
      "1 onion",
      "5 cloves of garlic",
      "3 cloves",
      "2 bay leaves",
      "1 dried chili pepper",
      "1 handful of oregano",
      "A splash of balsamic vinegar",
      "A pinch of nutmeg",
      "2 tablespoons of olive oil",
      "salt",
      "pepper"
    ],
    "preparation": "<br>First, finely chop the onion and sauté it in a bit of olive oil until caramelized but not burned. <br><br>Briefly add the garlic and pepper everything in the pan.<br><br>Next, add the balsamic vinegar and bring to a boil. <br><br>Now add the can of tomatoes and let it simmer for a short while.<br><br> Meanwhile, add oregano, nutmeg, chili, and cloves.<br><br>After about 5 minutes, blend the sauce until it becomes creamy, then return it to the pot to continue cooking. Now add bay leaves and let it cook for a while. The sauce can be used immediately, but it reaches its full flavor after an hour on low heat.<br><br>Then, pour the hot sauce into a canning jar and store it in the refrigerator.",
    "image": "images/sossendoktor.jpg"

  },


  {
    "name": "Eggplant rice ",
    "ingredients": [
      "2 Eggplants",
      "Spring onion",
      "Rice",
      "3 Tblsp Soy sauce",
      "1 Tblsp Chilly powder",
      "1 Sugar",
      "Garlics",
      "Seasame",
      "Seasame oil",
      "Eggs"
    ],
    "preparation": "<br>Chop Eggplants and Spring onions.<br><br> Put them in the pan with 1 tblsp Oil and 3 Tblsp Soy sauce.<br><br> Once the eggplants are getting soft, put them in the rice cooker.<br><br> Cook the rice with the eggplants in the normal rice setting.<br> <br>Make the sauce (Chopped Spring onions, 1 Chilly Powder, 1 Seasame, 1 Seasame oil, 2-3 Chopped Garlics, 1 Sugar, Pepper, and then pour the soy sauce until they are all soaked).<br><br>Put the egg on top of the eggplant rice and 2-3 spoons of sauce",
    "image": "images/eggplantrice.jpg"
  },



 
  {
    "name": "Easy pancakes",
    "ingredients": [
      "100g plain flour",
      "2 large eggs",
      "300ml milk",
      "1 tbsp sunflower or vegetable oil (plus a little extra for frying)",
      "lemon wedges (to serve (optional))",
      "caster sugar (to serve (optional))"
    ],
    "preparation": "<br>Put 100g plain flour, 2 large eggs, 300ml milk, 1 tbsp sunflower or vegetable oil and a pinch of salt into a bowl or large jug. <br><br> then whisk to a smooth batter. This should be similar in consistency to single cream. <br> Set aside for 30 mins to rest if you have time, or start cooking straight away. <br><br>Set a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper. <br><br>When hot, cook your pancakes for 1 min on each side until golden, using around half a ladleful of batter per pancake. <br><br>Keep them warm in a low oven as you make the rest. <br><br>Serve with lemon wedges and caster sugar, or your favourite filling.<br><br> Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to two months.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "Microwave mug cake",
    "ingredients": [
      "4 tbsp self-raising flour",
      "4 tbsp caster sugar",
      "2 tbsp cocoa powder",
      "1 medium egg",
      "3 tbsp milk",
      "3 tbsp vegetable oil (or sunflower oil)",
      "a few drops of vanilla essence (or other essence (orange or peppermint work well))",
      "2 tbsp chocolate chips (nuts, or raisins etc (optional))"
    ],
    "preparation": "<br>Add 4 tbsp self-raising flour, 4 tbsp caster sugar and 2 tbsp cocoa powder to the largest mug you have (to stop it overflowing in the microwave) and mix.<br><br> Add 1 medium egg and mix in as much as you can, but don't worry if there's still dry mix left. <br><br>Add the 3 tbsp milk, 3 tbsp vegetable or sunflower oil and a few drops of vanilla essence and mix until smooth, before adding 2 tbsp chocolate chips, nuts, or raisins, if using, and mix again. <br><br>Centre your mug in the middle of the microwave oven and cook on High for 1½ -2 mins, or until it has stopped rising and is firm to the touch.",
    "image": "images/sossendoktor.jpg"
  },
  
  {
    "name": "Halloumi flatbreads",
    "ingredients": [
      "50g pumpkin seeds",
      "2 tbsp cumin seeds",
      "1 small red cabbage (about 650g, core removed, shredded)",
      "2 mixed peppers (cut into strips)",
      "2 tbsp white wine vinegar",
      "2 tbsp extra virgin olive oil",
      "6-8 flatbreads (or wraps)",
      "100g hummus",
      "80g bag rocket",
      "2 x 250g blocks halloumi, each cut into 12 strips"
    ],
    "preparation": "<br>Toast the pumpkin seeds with the cumin seeds in a large frying pan until they begin to pop and smell fragrant, then transfer to a large bowl. <br><br>Add the cabbage, peppers and vinegar, and season well. <br><br>Mix thoroughly and set aside. Heat oven to low and put the bread in to warm through. <br><br>Using the pan you used to toast the seeds, fry the halloumi with the olive oil in batches for 3 mins each side until crispy and golden. <br><br>Transfer to the oven to keep warm.<br><br> Spread a layer of hummus on each flatbread and top with a handful of slaw, halloumi and rocket to serve.",
    "image": "images/sossendoktor.jpg"
  },
  
        

  {
    "name": "Tiramisu",
    "ingredients": [
      "3 eggs",
      "130g sugar",
      "1 package of ladyfingers",
      "3 cups strong coffee, lightly sweetened and cooled",
      "4 tablespoons Amaretto",
      "500g mascarpone",
      "20g cocoa powder"
    ],
    "preparation": "Start by brewing strong coffee, lightly sweetening it, and then let it cool.\nCarefully separate the eggs, placing the yolks and whites in separate bowls.\nWhisk the egg yolks until foamy, then gradually add the sugar and Amaretto. Stir the mixture well until it’s smooth.\n\nAdd the mascarpone to the yolk mixture and gently fold it in with a spoon or spatula until well combined.\nBe careful not to overmix, as this can make the cream too runny.\n\nIn a separate bowl, whip the egg whites, optionally with a pinch of salt, until stiff peaks form.\nCarefully fold the whipped egg whites into the mascarpone mixture. This creates a light and creamy tiramisu filling.\n\nDip the ladyfingers about one-third to halfway into the cold coffee, and place them on a plate with the soaked side facing down. Let them sit briefly.\nSpread a layer of the mascarpone cream in a suitable dish.\nArrange the soaked ladyfingers closely together on top of the cream layer.\nSpread another layer of mascarpone cream over the ladyfingers.\nAdd a second layer of soaked ladyfingers, then drizzle them with Amaretto.\n\nCover the tiramisu and refrigerate it overnight. This allows the flavors to develop and the tiramisu to set properly.\nJust before serving, sift cocoa powder evenly over the top of the tiramisu.\n\nTiramisu, the iconic Italian dessert, carries a rich history and an irresistible charm. Its origins lie in Northern Italy, likely in Veneto or Friuli Venezia Giulia, and its name, meaning 'pick me up,' is an invitation to indulge.\n\nThe preparation involves layers of ladyfingers soaked in strong coffee and Amaretto, combined with a velvety blend of mascarpone, sugar, and eggs. This balance of sweet, slightly bitter flavors, paired with hints of coffee and almond, creates a sensory delight.\n\nMaking tiramisu from scratch is both a culinary experience and a tribute to Italian tradition. It doesn’t require complex techniques, just quality ingredients and attention to detail. When served, the delightful aroma of coffee and mascarpone adds a touch of magic, while every bite offers a melody of flavor and texture.\n\nTreat yourself to the irresistible allure of tiramisu and savor a piece of Italy on your plate.\n\nPlease note: A portion contains around 320-350 calories, and this recipe uses raw eggs, which can carry a risk of salmonella. Consider using pasteurized eggs, especially for pregnant individuals, young children, or anyone with a weakened immune system.\n\nWe hope you enjoy every moment of this delectable dessert, crafted with love and meant to be shared. Buon appetito!",

    "image": "https://baristaroyal.de/cdn/shop/articles/15-834476.png?v=1719300440&width=1000"
  }
      ]
  }
  