{
 "Rezepte": [
  {
   "id": "53033",
   "name": "Japanese gohan rice",
   "ingredients": [
    "Sushi Rice",
    "Mirin",
    "Pickle Juice",
    "Spring Onions"
   ],
   "preparation": "STEP 1\r\nRinsing and soaking your rice is key to achieving the perfect texture. Measure the rice into a bowl, cover with cold water, then use your fingers to massage the grains of rice – the water will become cloudy. Drain and rinse again with fresh water. Repeat five more times until the water stays clear.\r\n\r\nSTEP 2\r\nTip the rinsed rice into a saucepan with 400ml water, or 200ml dashi and 200ml water, bring to the boil, then turn down the heat to a low simmer, cover with a tight-fitting lid with a steam hole and cook for 15 mins. Remove from the heat and leave to sit for another 15 mins, then stir through the mirin. Remove the lid and give it a good stir. Serve with any or all of the optional toppings.",
   "image": "https://www.themealdb.com/images/media/meals/kw92t41604181871.jpg"
  },
 
  {
   "id": "52921",
   "name": "Provençal Omelette Cake",
   "ingredients": [
    "Eggs",
    "Olive Oil",
    "Courgettes",
    "Spring Onions",
    "Red Pepper",
    "Garlic Clove",
    "Red Chilli",
    "Cream Cheese",
    "Milk",
    "Chives",
    "Basil",
    "Rocket",
    "Parmesan"
   ],
   "preparation": "Break the eggs into two bowls, five in each. Whisk lightly and season with salt and pepper. Heat the oil in a pan, add the courgettes and spring onions, then fry gently for about 10 mins until softened. Cool, then stir into one bowl of eggs with a little salt and pepper. Add the roasted peppers to the other bowl of eggs with the garlic, chilli, salt and pepper.\r\nHeat a little oil in a 20-23cm frying pan, preferably non-stick. Pour the eggs with courgette into a measuring jug, then pourabout one-third of the mixture into the pan, swirling it to cover the base of the pan. Cook until the egg is set and lightly browned underneath, then cover the pan with a plate and invert the omelette onto it. Slide it back into the pan to cook the other side. Repeat with the remaining mix to make two more omelettes, adding a little oil to the pan each time. Stack the omelettes onto a plate. Make three omelettes in the same way with the red pepper mixture, then stack them on a separate plate.\r\nNow make the filling. Beat the cheese to soften it, then beat in the milk to make a spreadable consistency. Stir in the herbs, salt and pepper. Line a deep, 20-23cm round cake tin with cling film (use a tin the same size as the frying pan). Select the best red pepper omelette and place in the tin, prettiest side down. Spread with a thin layer of cheese filling, then cover with a courgette omelette. Repeat, alternating the layers, until all the omelettes and filling are in the tin, finishing with an omelette. Flip the cling film over the omelette, then chill for up to 24 hrs.\r\nTo serve, invert the omelette cake onto a serving plate and peel off the cling film. Pile rocket on the top and scatter over the cheese, a drizzle of olive oil and a little freshly ground black pepper. Serve cut into wedges.",
   "image": "https://www.themealdb.com/images/media/meals/qwtrtp1511799242.jpg"
  },
  {
   "id": "52989",
   "name": "Christmas Pudding Trifle",
   "ingredients": [
    "Orange",
    "Demerara Sugar",
    "Grand Marnier",
    "Christmas Pudding",
    "Custard",
    "Mascarpone",
    "Double Cream",
    "Flaked Almonds",
    "Dark Chocolate"
   ],
   "preparation": "Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\r\n\r\nCrumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\r\n\r\nBeat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\r\n\r\nLightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve.",
   "image": "https://www.themealdb.com/images/media/meals/r33cud1576791081.jpg"
  },
  {
   "id": "52991",
   "name": "Mince Pies",
   "ingredients": [
    "Butter",
    "Plain Flour",
    "Caster Sugar",
    "Mincemeat",
    "Egg",
    "Icing Sugar"
   ],
   "preparation": "To make the pastry, rub 225g cold, diced butter into 350g plain flour, then mix in 100g golden caster sugar and a pinch of salt.\r\n\r\nCombine the pastry into a ball – don’t add liquid – and knead it briefly. The dough will be fairly firm, like shortbread dough. You can use the dough immediately, or chill for later.\r\n\r\nPreheat the oven to 200C/gas 6/fan 180C. Line 18 holes of two 12-hole patty tins, by pressing small walnut-sized balls of pastry into each hole.\r\n\r\nSpoon 280g mincemeat into the pies.\r\n\r\nTake slightly smaller balls of pastry than before and pat them out between your hands to make round lids, big enough to cover the pies. \r\n\r\nTop the pies with their lids, pressing the edges gently together to seal – you don’t need to seal them with milk or egg as they will stick on their own. (The pies may now be frozen for up to 1 month).\r\n\r\nBeat 1 small egg and brush the tops of the pies. Bake for 20 mins until golden. Leave to cool in the tin for 5 mins, then remove to a wire rack.\r\n\r\nTo serve, lightly dust with icing sugar.",
   "image": "https://www.themealdb.com/images/media/meals/qe8pf51576795532.jpg"
  },
  {
   "id": "53009",
   "name": "Lamb and Lemon Souvlaki",
   "ingredients": [
    "Garlic",
    "Sea Salt",
    "Olive Oil",
    "Lemon",
    "Dill",
    "Lamb Leg",
    "Pita Bread"
   ],
   "preparation": "Pound the garlic with sea salt in a pestle and mortar (or use a small food processor), until the garlic forms a paste. Whisk together the oil, lemon juice, zest, dill and garlic. Mix in the lamb and combine well. Cover and marinate for at least 2 hrs or overnight in the fridge. If you’re going to use bamboo skewers, soak them in cold water.\r\n\r\nIf you’ve prepared the lamb the previous day, take it out of the fridge 30 mins before cooking. Thread the meat onto the soaked or metal skewers. Heat the grill to high or have a hot griddle pan or barbecue ready. Cook the skewers for 2-3 mins on each side, basting with the remaining marinade. Heat the pitta or flatbreads briefly, then stuff with the souvlaki. Add Greek salad (see 'Goes well with', right) and Tzatziki (below), if you like.",
   "image": "https://www.themealdb.com/images/media/meals/rjhf741585564676.jpg"
  },
  {
   "id": "52837",
   "name": "Pilchard puttanesca",
   "ingredients": [
    "Spaghetti",
    "Olive Oil",
    "Onion",
    "Garlic",
    "Red Chilli",
    "Tomato Puree",
    "Pilchards",
    "Black Olives",
    "Parmesan"
   ],
   "preparation": "Cook the pasta following pack instructions. Heat the oil in a non-stick frying pan and cook the onion, garlic and chilli for 3-4 mins to soften. Stir in the tomato purée and cook for 1 min, then add the pilchards with their sauce. Cook, breaking up the fish with a wooden spoon, then add the olives and continue to cook for a few more mins.\r\n\r\nDrain the pasta and add to the pan with 2-3 tbsp of the cooking water. Toss everything together well, then divide between plates and serve, scattered with Parmesan.",
   "image": "https://www.themealdb.com/images/media/meals/vvtvtr1511180578.jpg"
  },
  {
   "id": "52821",
   "name": "Laksa King Prawn Noodles",
   "ingredients": [
    "Olive Oil",
    "red chili",
    "Thai red curry paste",
    "vegetable stock cube",
    "coconut milk",
    "fish sauce",
    "rice noodles",
    "lime",
    "king prawns",
    "coriander"
   ],
   "preparation": "Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir and cook for 1 min more. Dissolve the stock cube in a large jug in 700ml boiling water, then pour into the pan and stir to combine. Tip in the coconut milk and bring to the boil.\r\nAdd the fish sauce and a little seasoning. Toss in the noodles and cook for a further 3-4 mins until softening. Squeeze in the lime juice, add the prawns and cook through until warm, about 2-3 mins. Scatter over some of the coriander.\r\nServe in bowls with the remaining coriander and lime wedges on top for squeezing over.",
   "image": "https://www.themealdb.com/images/media/meals/rvypwy1503069308.jpg"
  },
  {
   "id": "52934",
   "name": "Chicken Basquaise",
   "ingredients": [
    "Chicken",
    "Butter",
    "Olive Oil",
    "Red Onions",
    "Red Pepper",
    "Chorizo",
    "Sun-Dried Tomatoes",
    "Garlic",
    "Basmati Rice",
    "Tomato Puree",
    "Paprika",
    "Bay Leaves",
    "Thyme",
    "Chicken Stock",
    "Dry White Wine",
    "Lemons",
    "Black Olives",
    "Salt",
    "Pepper"
   ],
   "preparation": "Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\n\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\n\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\n\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.",
   "image": "https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg"
  },
  {
   "id": "52939",
   "name": "Callaloo Jamaican Style",
   "ingredients": [
    "Kale",
    "Bacon",
    "Garlic",
    "Onion",
    "Paprika",
    "Thyme",
    "Tomato",
    "Red Pepper",
    "Banana",
    "Vegetable Oil"
   ],
   "preparation": "Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r\nProceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r\nRemove kale from water cut in chunks.\r\nPlace bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r\nAdd tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r\nFinally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r\nUsing a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r\nSlice the plantain into medium size lengthwise slices and set aside.\r\nCoat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r\nLet the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r\nAs the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r\nRemove and serve with kale",
   "image": "https://www.themealdb.com/images/media/meals/ussyxw1515364536.jpg"
  },
  {
   "id": "52867",
   "name": "Vegetarian Chilli",
   "ingredients": [
    "Roasted Vegetables",
    "Kidney Beans",
    "Chopped Tomatoes",
    "Mixed Grain"
   ],
   "preparation": "Heat oven to 200C/180C fan/ gas 6. Cook the vegetables in a casserole dish for 15 mins. Tip in the beans and tomatoes, season, and cook for another 10-15 mins until piping hot. Heat the pouch in the microwave on High for 1 min and serve with the chilli.",
   "image": "https://www.themealdb.com/images/media/meals/wqurxy1511453156.jpg"
  },
  {
   "id": "52857",
   "name": "Pumpkin Pie",
   "ingredients": [
    "Pumpkin",
    "Shortcrust Pastry",
    "Plain Flour",
    "Caster Sugar",
    "Salt",
    "Nutmeg",
    "Cinnamon",
    "Eggs",
    "Butter",
    "Milk",
    "Icing Sugar"
   ],
   "preparation": "Place the pumpkin in a large saucepan, cover with water and bring to the boil. Cover with a lid and simmer for 15 mins or until tender. Drain pumpkin; let cool.\r\nHeat oven to 180C/160C fan/gas 4. Roll out the pastry on a lightly floured surface and use it to line a 22cm loose-bottomed tart tin. Chill for 15 mins. Line the pastry with baking parchment and baking beans, then bake for 15 mins. Remove the beans and paper, and cook for a further 10 mins until the base is pale golden and biscuity. Remove from the oven and allow to cool slightly.\r\nIncrease oven to 220C/200C fan/gas 7. Push the cooled pumpkin through a sieve into a large bowl. In a separate bowl, combine the sugar, salt, nutmeg and half the cinnamon. Mix in the beaten eggs, melted butter and milk, then add to the pumpkin purée and stir to combine. Pour into the tart shell and cook for 10 mins, then reduce the temperature to 180C/160C fan/gas 4. Continue to bake for 35-40 mins until the filling has just set.\r\nLeave to cool, then remove the pie from the tin. Mix the remaining cinnamon with the icing sugar and dust over the pie. Serve chilled.",
   "image": "https://www.themealdb.com/images/media/meals/usuqtp1511385394.jpg"
  },
  {
   "id": "52856",
   "name": "Choc Chip Pecan Pie",
   "ingredients": [
    "Plain Flour",
    "Butter",
    "Cream Cheese",
    "Icing Sugar",
    "Butter",
    "Maple Syrup",
    "Light Brown Soft Sugar",
    "Dark Brown Soft Sugar",
    "Eggs",
    "Vanilla Extract",
    "Pecan Nuts",
    "Dark Chocolate Chips"
   ],
   "preparation": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
   "image": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg"
  },
  {
   "id": "52924",
   "name": "Nanaimo Bars",
   "ingredients": [
    "Custard",
    "Caster Sugar",
    "Cocoa",
    "Egg",
    "Digestive Biscuits",
    "Desiccated Coconut",
    "Almonds",
    "Butter",
    "Double Cream",
    "Custard Powder",
    "Icing Sugar",
    "Dark Chocolate",
    "Butter"
   ],
   "preparation": "Start by making the biscuit base. In a bowl, over a pan of simmering water, melt the butter with the sugar and cocoa powder, stirring occasionally until smooth. Whisk in the egg for 2 to 3 mins until the mixture has thickened. Remove from heat and mix in the biscuit crumbs, coconut and almonds if using, then press into the base of a lined 20cm square tin. Chill for 10 mins.\r\nFor the middle layer, make the custard icing; whisk together the butter, cream and custard powder until light and fluffy, then gradually add the icing sugar until fully incorporated. Spread over the bottom layer and chill in the fridge for at least 10 mins until the custard is no longer soft.\r\nMelt the chocolate and butter together in the microwave, then spread over the chilled bars and put back in the fridge. Leave until the chocolate has fully set (about 2 hrs). Take the mixture out of the tin and slice into squares to serve.",
   "image": "https://www.themealdb.com/images/media/meals/vwuprt1511813703.jpg"
  },
  {
   "id": "52936",
   "name": "Saltfish and Ackee",
   "ingredients": [
    "Salt Cod",
    "Ackee",
    "Onion",
    "Paprika",
    "Curry Powder",
    "Jerusalem Artichokes",
    "Hotsauce",
    "Red Pepper",
    "Yellow Pepper",
    "Tomatoes",
    "Salt",
    "Pepper",
    "Self-raising Flour",
    "Suet",
    "Salt",
    "Olive Oil"
   ],
   "preparation": "For the saltfish, soak the salt cod overnight, changing the water a couple of times.\r\nDrain, then put the cod in a large pan of fresh water and bring to the boil. Drain again, add fresh water and bring to the boil again.\r\nSimmer for about five minutes, or until cooked through, then drain and flake the fish into large pieces. Discard any skin or bones.\r\nFor the dumplings, mix the flour and suet with a pinch of salt and 250ml/9fl oz water to make a dough.\r\nWrap the mixture in clingfilm and leave in the fridge to rest.\r\nOpen the can of ackee, drain and rinse, then set aside.\r\nHeat a tablespoon of olive oil in a pan and fry the onion until softened but not brown.\r\nAdd the spices, seasoning, pepper sauce and sliced peppers and continue to fry until the peppers are tender.\r\nAdd the chopped tomatoes, then the salt cod and mix together. Lastly stir in the ackee very gently and leave to simmer until ready to serve.\r\nWhen you’re almost ready to eat, heat about 1cm/½in vegetable oil in a frying pan and heat until just smoking.\r\nShape the dumpling mix into plum-size balls and shallow-fry until golden-brown. (CAUTION: hot oil can be dangerous. Do not leave the pan unattended.)\r\nDrain the dumplings on kitchen paper and serve with the saltfish and ackee.",
   "image": "https://www.themealdb.com/images/media/meals/vytypy1511883765.jpg"
  },
  {
   "id": "53064",
   "name": "Fettuccine Alfredo",
   "ingredients": [
    "Fettuccine",
    "Heavy Cream",
    "Butter",
    "Parmesan",
    "Parsley",
    "Black Pepper"
   ],
   "preparation": "Cook pasta according to package instructions in a large pot of boiling water and salt. Add heavy cream and butter to a large skillet over medium heat until the cream bubbles and the butter melts. Whisk in parmesan and add seasoning (salt and black pepper). Let the sauce thicken slightly and then add the pasta and toss until coated in sauce. Garnish with parsley, and it's ready.",
   "image": "https://www.themealdb.com/images/media/meals/0jv5gx1661040802.jpg"
  },
  {
   "id": "53024",
   "name": "Rogaliki (Polish Croissant Cookies)",
   "ingredients": [
    "Butter",
    "Egg Yolks",
    "Cream Cheese",
    "Baking Powder",
    "Flour",
    "Jam"
   ],
   "preparation": "In a medium bowl mix egg yolks, philly cheese and baking powder using a hand held mixer. Carefully start adding the flour. When the mixture will not be mixing well, and will look like wood chips, put away the blending mixer and using your hands knead the dough.\r\nCreate a roll and cover in foil and freeze for 15 minutes. At this time preheat the oven to 375.\r\nTake the dough out and separate into two. Roll and cut out 3 inch trangles.\r\nMake as many as you can and on centre of each put a small spoon of jam. Roll them into a croissant shape.\r\nPlace the croissants onto a greased cookie sheet, and bake for 10-12 minutes or until golden.\r\nRepeat with the rest of the dough.\r\nWhen you take them out, put aside and sprinkle with powdered sugar on top.\r\nThis makes about 3 batches of 20 cookies each.\r\nTotal count about 60 cookies.",
   "image": "https://www.themealdb.com/images/media/meals/7mxnzz1593350801.jpg"
  },
  {
   "id": "52978",
   "name": "Kumpir",
   "ingredients": [
    "Potatoes",
    "Butter",
    "Cheese",
    "Onion",
    "Red Pepper",
    "Red Chilli Flakes"
   ],
   "preparation": "If you order kumpir in Turkey, the standard filling is first, lots of butter mashed into the potato, followed by cheese. There’s then a row of other toppings that you can just point at to your heart’s content – sweetcorn, olives, salami, coleslaw, Russian salad, allsorts – and you walk away with an over-stuffed potato because you got ever-excited by the choices on offer.\r\n\r\nGrate (roughly – you can use as much as you like) 150g of cheese.\r\nFinely chop one onion and one sweet red pepper.\r\nPut these ingredients into a large bowl with a good sprinkling of salt and pepper, chilli flakes (optional).",
   "image": "https://www.themealdb.com/images/media/meals/mlchx21564916997.jpg"
  },
  {
   "id": "53032",
   "name": "Tonkatsu pork",
   "ingredients": [
    "Pork Chops",
    "Flour",
    "Eggs",
    "Breadcrumbs",
    "Vegetable Oil",
    "Tomato Ketchup",
    "Worcestershire Sauce",
    "Oyster Sauce",
    "Caster Sugar"
   ],
   "preparation": "STEP 1\r\nRemove the large piece of fat on the edge of each pork loin, then bash each of the loins between two pieces of baking parchment until around 1cm in thickness – you can do this using a meat tenderiser or a rolling pin. Once bashed, use your hands to reshape the meat to its original shape and thickness – this step will ensure the meat is as succulent as possible.\r\n\r\nSTEP 2\r\nPut the flour, eggs and panko breadcrumbs into three separate wide-rimmed bowls. Season the meat, then dip first in the flour, followed by the eggs, then the breadcrumbs.\r\n\r\nSTEP 3\r\nIn a large frying or sauté pan, add enough oil to come 2cm up the side of the pan. Heat the oil to 180C – if you don’t have a thermometer, drop a bit of panko into the oil and if it sinks a little then starts to fry, the oil is ready. Add two pork chops and cook for 1 min 30 secs on each side, then remove and leave to rest on a wire rack for 5 mins. Repeat with the remaining pork chops.\r\n\r\nSTEP 4\r\nWhile the pork is resting, make the sauce by whisking the ingredients together, adding a splash of water if it’s particularly thick. Slice the tonkatsu and serve drizzled with the sauce.",
   "image": "https://www.themealdb.com/images/media/meals/lwsnkl1604181187.jpg"
  },
  {
   "id": "52795",
   "name": "Chicken Handi",
   "ingredients": [
    "Chicken",
    "Onion",
    "Tomatoes",
    "Garlic",
    "Ginger paste",
    "Vegetable oil",
    "Cumin seeds",
    "Coriander seeds",
    "Turmeric powder",
    "Chilli powder",
    "Green chilli",
    "Yogurt",
    "Cream",
    "fenugreek",
    "Garam masala",
    "Salt"
   ],
   "preparation": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
   "image": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg"
  },
  {
   "id": "53010",
   "name": "Lamb Tzatziki Burgers",
   "ingredients": [
    "Bulgur Wheat",
    "Lamb Mince",
    "Cumin",
    "Coriander",
    "Paprika",
    "Garlic",
    "Olive Oil",
    "Bun",
    "Cucumber",
    "Greek Yogurt",
    "Mint"
   ],
   "preparation": "Tip the bulghar into a pan, cover with water and boil for 10 mins. Drain really well in a sieve, pressing out any excess water.\r\n\r\nTo make the tzatziki, squeeze and discard the juice from the cucumber, then mix into the yogurt with the chopped mint and a little salt.\r\n\r\nWork the bulghar into the lamb with the spices, garlic (if using) and seasoning, then shape into 4 burgers. Brush with a little oil and fry or barbecue for about 5 mins each side until cooked all the way through. Serve in the buns (toasted if you like) with the tzatziki, tomatoes, onion and a few mint leaves.",
   "image": "https://www.themealdb.com/images/media/meals/k420tj1585565244.jpg"
  },
  {
   "id": "53062",
   "name": "Walnut Roll Gužvara",
   "ingredients": [
    "Flour",
    "Caster Sugar",
    "Yeast",
    "Salt",
    "Milk",
    "Eggs",
    "Butter",
    "Walnuts",
    "Butter",
    "Brown Sugar",
    "Cinnamon",
    "Milk",
    "Icing Sugar"
   ],
   "preparation": "Mix all the ingredients for the dough together and knead well. Cover the dough and put to rise until doubled in size which should take about 2 hours. Knock back the dough and knead lightly.\r\n\r\nDivide the dough into two equal pieces; roll each piece into an oblong about 12 inches by 8 inches. Mix the filling ingredients together and divide between the dough, spreading over each piece. Roll up the oblongs as tightly as possible to give two 12 inch sausages. Place these side by side, touching each other, on a greased baking sheet. Cover and leave to rise for about 40 minutes. Heat oven to 200ºC (425ºF). Bake for 30-35 minutes until well risen and golden brown. Bread should sound hollow when the base is tapped.\r\n\r\nRemove from oven and brush the hot bread top with milk. Sift with a generous covering of icing sugar.",
   "image": "https://www.themealdb.com/images/media/meals/u9l7k81628771647.jpg"
  },
  {
   "id": "52815",
   "name": "French Lentils With Garlic and Thyme",
   "ingredients": [
    "Olive Oil",
    "Onion",
    "Garlic",
    "Carrot",
    "French Lentils",
    "Thyme",
    "Bay Leaf",
    "Salt",
    "Celery"
   ],
   "preparation": "Place a large saucepan over medium heat and add oil. When hot, add chopped vegetables and sauté until softened, 5 to 10 minutes.\r\nAdd 6 cups water, lentils, thyme, bay leaves and salt. Bring to a boil, then reduce to a fast simmer.\r\nSimmer lentils until they are tender and have absorbed most of the water, 20 to 25 minutes. If necessary, drain any excess water after lentils have cooked. Serve immediately, or allow them to cool and reheat later.\r\nFor a fuller taste, use some chicken stock and reduce the water by the same amount.",
   "image": "https://www.themealdb.com/images/media/meals/vwwspt1487394060.jpg"
  },
  {
   "id": "52864",
   "name": "Mushroom & Chestnut Rotolo",
   "ingredients": [
    "Mushrooms",
    "Chestnuts",
    "Challots",
    "Garlic",
    "Rosemary",
    "Wild Mushrooms",
    "Soy Sauce",
    "White Wine",
    "Lasagne Sheets",
    "Breadcrumbs",
    "Sage",
    "Truffle Oil"
   ],
   "preparation": "Soak the dried mushrooms in 350ml boiling water and set aside until needed. Blitz ¾ of the chestnuts with 150ml water until creamy. Roughly chop the remaining chestnuts.\r\nHeat 2 tbsp olive oil in a large non-stick frying pan. Fry the shallots with a pinch of salt until softened, then add the garlic, chopped chestnuts and rosemary, and fry for 2 mins more. Add the wild mushrooms, 2 tbsp oil and some seasoning. Cook for 3 mins until they begin to soften. Drain and roughly chop the dried mushrooms (reserve the soaking liquid), then add those too, along with the soy sauce, and fry for 2 mins more.\r\nWhisk the wine, reserved mushroom liquid and chestnut cream together to create a sauce. Season, then add half to the mushroom mixture in the pan and cook for 1 min until the sauce becomes glossy. Remove and discard the rosemary sprigs, then set the mixture aside.\r\nHeat oven to 180C/160C fan/gas 4. Bring a large pan of salted water to the boil and get a large bowl of ice water ready. Drop the lasagne sheets into the boiling water for 2 mins or until pliable and a little cooked, then immediately plunge them into the cold water. Using your fingers, carefully separate the sheets and transfer to a clean tea towel. Spread a good spoonful of the sauce on the bottom two thirds of each sheet, then, rolling away from yourself, roll up the shorter ends. Cut each roll in half, then position the rolls of pasta cut-side up in a pie dish that you are happy to serve from at the table. If you have any mushroom sauce remaining after you’ve rolled up all the sheets, simply push it into some of the exposed rolls of pasta.\r\nPour the rest of the sauce over the top of the pasta, then bake for 10 mins or until the pasta no longer has any resistance when tested with a skewer.\r\nMeanwhile, put the breadcrumbs, the last 2 tbsp olive oil, sage leaves and some seasoning in a bowl, and toss everything together. Scatter the rotolo with the crumbs and sage, then bake for another 10 mins, until the top is golden and the sage leaves are crispy. Leave to cool for 10 mins to allow the pasta to absorb the sauce, then drizzle with a little truffle oil, if you like, before taking your dish to the table.",
   "image": "https://www.themealdb.com/images/media/meals/ssyqwr1511451678.jpg"
  },
  {
   "id": "53005",
   "name": "Strawberry Rhubarb Pie",
   "ingredients": [
    "Flour",
    "Salt",
    "Sugar",
    "Butter",
    "Water",
    "Rhubarb",
    "Strawberries",
    "Cornstarch",
    "Sugar",
    "Cinnamon",
    "Lemon Juice",
    "Unsalted Butter",
    "Milk",
    "Sugar"
   ],
   "preparation": "Pie Crust:  In a food processor, place the flour, salt, and sugar and process until combined. Add the butter and process until the mixture resembles coarse\r\n\r\nmeal (about 15 seconds). Pour 1/4 cup (60 ml) water in a slow, steady stream, through the feed tube until the dough just holds together when pinched. If necessary, add more water. Do not process more than 30 seconds.\r\nTurn the dough onto your work surface and gather into a ball. Divide the dough in half, flattening each half into a disk, cover with plastic wrap, and refrigerate for about one hour before using. This will chill the butter and relax the gluten in the flour. \r\n\r\nAfter the dough has chilled sufficiently, remove one portion of the dough from the fridge and place it on a lightly floured surface.  Roll the pastry into a 12 inch (30 cm) circle. (To prevent the pastry from sticking to the counter and to ensure uniform thickness, keep lifting up and turning the pastry a quarter turn as you roll (always roll from the center of the pastry outwards).)  Fold the dough in half and gently transfer to a 9 inch (23 cm) pie pan. Brush off any excess flour and trim any overhanging pastry to an edge of 1/2 inch (1.5 cm). Refrigerate the pastry, covered with plastic wrap, while you make the filling. \r\n\r\nRemove the second round of pastry and roll it into a 13 inch (30 cm) circle. Using a pastry wheel or pizza cutter, cut the pastry into about 3/4 inch (2 cm) strips. Place the strips of pastry on a parchment paper-lined baking sheet, cover with plastic wrap, and place in the refrigerator for about 10 minutes. \r\n\r\nMake the Strawberry Rhubarb Filling: Place the cut strawberries and rhubarb in a large bowl. In a small bowl mix together the cornstarch, sugar, and ground cinnamon. \r\n\r\nRemove the chilled pie crust from the fridge. Sprinkle about 2 tablespoons of the sugar mixture over the bottom of the pastry crust. Add the remaining sugar mixture to the strawberries and rhubarb and gently toss to combine. Pour the fruit mixture into the prepared pie shell. Sprinkle the fruit with about 1 teaspoon of lemon juice and dot with 2 tablespoons of butter.\r\n\r\nRemove the lattice pastry from the refrigerator and, starting at the center with the longest strips and working outwards, place half the strips, spacing about 1 inch (2.5 cm) apart, on top of the filling. (Use the shortest pastry strips at the outer edges.) Then, gently fold back, about halfway, every other strip of pastry. Take another strip of pastry and place it perpendicular on top of the first strips of pastry. Unfold the bottom strips of pastry and then fold back the strips that weren't folded back the first time. Lay another strip of pastry perpendicular on top of the filling and then continue with the remaining strips. Trim the edges of the pastry strips, leaving a 1 inch (2.5 cm) overhang. Seal the edges of the pastry strips by folding them under the bottom pastry crust and flute the edges of the pastry. Brush the lattice pastry with milk and sprinkle with a little sugar. Cover and place in the refrigerator while you preheat the oven to 400 degrees F (205 degrees C) and place the oven rack in the lower third of the oven. Put a baking sheet, lined with aluminum foil, on the oven rack (to catch any spills.)\r\n\r\nPlace the pie plate on the hot baking sheet and bake the pie for about 35 minutes and then, if the edges of the pie are browning too much, cover with a foil ring. Continue to bake the pie for about another 10 minutes or until the crust is a golden brown color and the fruit juices begin to bubble.\r\n\r\nRemove the pie from the oven and place on a wire rack to cool for several hours. Serve at room temperature with softly whipped cream or vanilla ice cream. Leftovers can be stored in the refrigerator for about 3 days. Reheat before serving. This pie can be frozen.\r\n\r\nMakes one 9 inch (23 cm) pie.",
   "image": "https://www.themealdb.com/images/media/meals/178z5o1585514569.jpg"
  },
  {
   "id": "52797",
   "name": "Spicy North African Potato Salad",
   "ingredients": [
    "Small Potatoes",
    "Harissa Spice",
    "olive oil",
    "Lemon",
    "Spring onions",
    "Rocket",
    "Feta",
    "Mint",
    "Pine nuts",
    "Salt",
    "Pepper"
   ],
   "preparation": "Cook potatoes - place potatoes in a pot of cold water, and bring to the boil. Boil 20 minutes, or until potatoes are tender. You know they are cooked when you can stick a knife in them and the knife goes straight through.\r\nCombine harissa spice, olive oil, salt and pepper and lemon juice in a small bowl and whisk until combined.\r\nOnce potatoes are cooked, drain water and roughly chop potatoes in half.\r\nAdd harissa mix and spring onions/green onions to potatoes and stir.\r\nIn a large salad bowl, lay out arugula/rocket.\r\nTop with potato mix and toss.\r\nAdd fetta, mint and sprinkle over pine nuts.\r\nAdjust salt and pepper to taste.",
   "image": "https://www.themealdb.com/images/media/meals/urtwux1486983078.jpg"
  },
  {
   "id": "53052",
   "name": "Roti john",
   "ingredients": [
    "Minced Beef",
    "Onion",
    "Eggs",
    "Chilli",
    "Baguette",
    "Salt",
    "Pepper",
    "Mayonnaise"
   ],
   "preparation": "Mix all the ingredients in a bowl.\r\nHeat a pan or griddle with a little vegetable oil.\r\nPour the mixture onto the pan and place a piece of open-faced baguette on top.\r\nPress on the bread with a spatula and grill for 2 minutes.\r\nTurn the bread over to make it a little crispy.\r\nRemove from pan and cut the bread into small portions.\r\nAdd mayonnaise and/or Sambal before cutting the sandwich (optional).",
   "image": "https://www.themealdb.com/images/media/meals/hx335q1619789561.jpg"
  },
  {
   "id": "52878",
   "name": "Beef and Oyster pie",
   "ingredients": [
    "Beef",
    "Olive Oil",
    "Shallots",
    "Garlic",
    "Bacon",
    "Thyme",
    "Bay Leaf",
    "Stout",
    "Beef Stock",
    "Corn Flour",
    "Oysters",
    "Plain Flour",
    "Salt",
    "Butter",
    "Eggs"
   ],
   "preparation": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.",
   "image": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg"
  },
  {
   "id": "53077",
   "name": "Cabbage Soup (Shchi)",
   "ingredients": [
    "Unsalted Butter",
    "Onion",
    "Cabbage",
    "Carrots",
    "Celery",
    "Bay Leaf",
    "Vegetable Stock",
    "Potatoes",
    "Tomatoes",
    "Sour Cream",
    "Dill"
   ],
   "preparation": "Add the butter to a large Dutch oven or other heavy-duty pot over medium heat. When the butter has melted, add the onion and sauté until translucent.\r\nAdd the cabbage, carrot, and celery. Sauté until the vegetables begin to soften, stirring frequently, about 3 minutes.\r\nAdd the bay leaf and vegetable stock and bring to a boil over high heat. Reduce the heat to low and simmer, covered, until the vegetables are crisp-tender, about 15 minutes.\r\nAdd the potatoes and bring it back to a boil over high heat. Reduce the heat to low and simmer, covered, until the potatoes are tender, about 10 minutes.\r\nAdd the tomatoes (or undrained canned tomatoes) and bring the soup back to a boil over high heat. Reduce the heat to low and simmer, uncovered, for 5 minutes. Season to taste with salt and pepper.\r\nemove and discard the bay leaf from the pot.\r\nServe topped with fresh sour cream and fresh dill.",
   "image": "https://www.themealdb.com/images/media/meals/60oc3k1699009846.jpg"
  },
  {
   "id": "53010",
   "name": "Lamb Tzatziki Burgers",
   "ingredients": [
    "Bulgur Wheat",
    "Lamb Mince",
    "Cumin",
    "Coriander",
    "Paprika",
    "Garlic",
    "Olive Oil",
    "Bun",
    "Cucumber",
    "Greek Yogurt",
    "Mint"
   ],
   "preparation": "Tip the bulghar into a pan, cover with water and boil for 10 mins. Drain really well in a sieve, pressing out any excess water.\r\n\r\nTo make the tzatziki, squeeze and discard the juice from the cucumber, then mix into the yogurt with the chopped mint and a little salt.\r\n\r\nWork the bulghar into the lamb with the spices, garlic (if using) and seasoning, then shape into 4 burgers. Brush with a little oil and fry or barbecue for about 5 mins each side until cooked all the way through. Serve in the buns (toasted if you like) with the tzatziki, tomatoes, onion and a few mint leaves.",
   "image": "https://www.themealdb.com/images/media/meals/k420tj1585565244.jpg"
  },
  {
   "id": "52972",
   "name": "Tunisian Lamb Soup",
   "ingredients": [
    "Lamb Mince",
    "Garlic",
    "Onion",
    "Spinach",
    "Tomato Puree",
    "Cumin",
    "Chicken Stock",
    "Harissa Spice",
    "Chickpeas",
    "Lemon Juice",
    "Macaroni",
    "Salt",
    "Pepper"
   ],
   "preparation": "Add the lamb to a casserole and cook over high heat. When browned, remove from the heat and set aside.\r\nKeep a tablespoon of fat in the casserole and discard the rest. Reduce to medium heat then add the garlic, onion and spinach and cook until the onion is translucent and the spinach wilted or about 5 minutes.\r\nReturn the lamb to the casserole with the onion-spinach mixture, add the tomato puree, cumin, harissa, chicken, chickpeas, lemon juice, salt and pepper in the pan. Simmer over low heat for about 20 minutes.\r\nAdd the pasta and cook for 15 minutes or until pasta is cooked.",
   "image": "https://www.themealdb.com/images/media/meals/t8mn9g1560460231.jpg"
  },
  {
   "id": "52922",
   "name": "Prawn & Fennel Bisque",
   "ingredients": [
    "Tiger Prawns",
    "Olive Oil",
    "Onion",
    "Fennel",
    "Carrots",
    "Dry White Wine",
    "Brandy",
    "Chopped Tomatoes",
    "Fish Stock",
    "Paprika",
    "Double Cream",
    "Prawns"
   ],
   "preparation": "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fennel and carrots and cook for about 10 mins until the veg start to soften. Pour in the wine and brandy, bubble hard for about 1 min to drive off the alcohol, then add the tomatoes, stock and paprika. Cover and simmer for 30 mins. Meanwhile, chop the prawns.\r\nBlitz the soup as finely as you can with a stick blender or food processor, then press through a sieve into a bowl. Spend a bit of time really working the mixture through the sieve as this will give the soup its velvety texture.\r\nTip back into a clean pan, add the prawns and cook for 10 mins, then blitz again until smooth. You can make and chill this a day ahead or freeze it for 1 month. Thaw ovenight in the fridge. To serve, gently reheat in a pan with the cream. If garnishing, cook the 8 prawns in a little butter. Spoon into small bowls and top with the prawns and snipped fennel fronds.",
   "image": "https://www.themealdb.com/images/media/meals/rtwwvv1511799504.jpg"
  },
  {
   "id": "52806",
   "name": "Tandoori chicken",
   "ingredients": [
    "lemons",
    "paprika",
    "red onions",
    "chicken thighs",
    "vegetable oil",
    "Greek yogurt",
    "ginger",
    "garlic clove",
    "garam masala",
    "ground cumin",
    "chilli powder",
    "turmeric"
   ],
   "preparation": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.",
   "image": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg"
  },
  {
   "id": "53071",
   "name": "Beef Asado",
   "ingredients": [
    "Beef",
    "Beef Stock Concentrate",
    "Tomato Puree",
    "Water",
    "Soy Sauce",
    "White Wine Vinegar",
    "Pepper",
    "Bay Leaf",
    "Lemon",
    "Tomato Sauce",
    "Butter",
    "Olive Oil",
    "Onion",
    "Garlic"
   ],
   "preparation": "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r\n1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r\n2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r\n3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r\n4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r\n5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r\n6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r\n7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half.",
   "image": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg"
  },
  {
   "id": "53018",
   "name": "Bigos (Hunters Stew)",
   "ingredients": [
    "Bacon",
    "Kielbasa",
    "Pork",
    "Flour",
    "Garlic",
    "Onion",
    "Mushrooms",
    "Cabbage",
    "Sauerkraut",
    "Red Wine",
    "Bay Leaf",
    "Basil",
    "Marjoram",
    "Paprika",
    "Caraway Seed",
    "Hotsauce",
    "Beef Stock",
    "Tomato Puree",
    "Diced Tomatoes",
    "Worcestershire Sauce"
   ],
   "preparation": "Preheat the oven to 350 degrees F (175 degrees C).\r\n\r\nHeat a large pot over medium heat. Add the bacon and kielbasa; cook and stir until the bacon has rendered its fat and sausage is lightly browned. Use a slotted spoon to remove the meat and transfer to a large casserole or Dutch oven.\r\n\r\nCoat the cubes of pork lightly with flour and fry them in the bacon drippings over medium-high heat until golden brown. Use a slotted spoon to transfer the pork to the casserole. Add the garlic, onion, carrots, fresh mushrooms, cabbage and sauerkraut. Reduce heat to medium; cook and stir until the carrots are soft, about 10 minutes. Do not let the vegetables brown.\r\n\r\nDeglaze the pan by pouring in the red wine and stirring to loosen all of the bits of food and flour that are stuck to the bottom. Season with the bay leaf, basil, marjoram, paprika, salt, pepper, caraway seeds and cayenne pepper; cook for 1 minute.\r\n\r\nMix in the dried mushrooms, hot pepper sauce, Worcestershire sauce, beef stock, tomato paste and tomatoes. Heat through just until boiling. Pour the vegetables and all of the liquid into the casserole dish with the meat. Cover with a lid.\r\n\r\nBake in the preheated oven for 2 1/2 to 3 hours, until meat is very tender.",
   "image": "https://www.themealdb.com/images/media/meals/md8w601593348504.jpg"
  },
  {
   "id": "52959",
   "name": "Baked salmon with fennel & tomatoes",
   "ingredients": [
    "Fennel",
    "Parsley",
    "Lemon",
    "Cherry Tomatoes",
    "Olive Oil",
    "Salmon",
    "Black Olives"
   ],
   "preparation": "Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.\r\n\r\nSpread the drained fennel over a shallow ovenproof dish, then add the tomatoes. Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve.",
   "image": "https://www.themealdb.com/images/media/meals/1548772327.jpg"
  },
  {
   "id": "52791",
   "name": "Eton Mess",
   "ingredients": [
    "strawberries",
    "double cream",
    "meringue nests",
    "ginger cordial",
    "Mint"
   ],
   "preparation": "Purée half the strawberries in a blender. Chop the remaining strawberries, reserving four for decoration.\r\nWhip the double cream until stiff peaks form, then fold in the strawberry purée and crushed meringue. Fold in the chopped strawberries and ginger cordial, if using.\r\nSpoon equal amounts of the mixture into four cold wine glasses. Serve garnished with the remaining strawberries and a sprig of mint.",
   "image": "https://www.themealdb.com/images/media/meals/uuxwvq1483907861.jpg"
  },
  {
   "id": "52770",
   "name": "Spaghetti Bolognese",
   "ingredients": [
    "onions",
    "olive oil",
    "garlic",
    "lean minced beef",
    "mushrooms",
    "dried oregano",
    "tomatoes",
    "hot beef stock",
    "tomato puree",
    "worcestershire sauce",
    "spaghetti",
    "parmesan"
   ],
   "preparation": "Put the onion and oil in a large pan and fry over a fairly high heat for 3-4 mins. Add the garlic and mince and fry until they both brown. Add the mushrooms and herbs, and cook for another couple of mins.\r\n\r\nStir in the tomatoes, beef stock, tomato ketchup or purée, Worcestershire sauce and seasoning. Bring to the boil, then reduce the heat, cover and simmer, stirring occasionally, for 30 mins.\r\n\r\nMeanwhile, cook the spaghetti in a large pan of boiling, salted water, according to packet instructions. Drain well, run hot water through it, put it back in the pan and add a dash of olive oil, if you like, then stir in the meat sauce. Serve in hot bowls and hand round Parmesan cheese, for sprinkling on top.",
   "image": "https://www.themealdb.com/images/media/meals/sutysw1468247559.jpg"
  },
  {
   "id": "53029",
   "name": "Mulukhiyah",
   "ingredients": [
    "Mulukhiyah",
    "Onion",
    "Beef",
    "Salt",
    "Water",
    "Garlic Clove",
    "Olive Oil"
   ],
   "preparation": "Saute the onions in the 3-4 tablespoons olive oil\r\nAdd the beef cubes or the chicken cutlets, sear for 3-4 min on each side\r\nAdd 1 liter of water or just enough to cover the meat\r\nCook over medium heat until the meat is done (I usually do this in the pressure cooker and press them for 5 min)\r\n\r\nAdd the frozen mulukhyia and stir until it thaws completely and then comes to a boil\r\n\r\nIn another pan add the 1/4 to 1/2 cup of olive oil and the cloves of garlic and cook over medium low heat until you can smell the garlic (don’t brown it, it will become bitter)\r\n\r\nAdd the oil and garlic to the mulukhyia and lower the heat and simmer for 5-10 minutes\r\nAdd salt to taste\r\n\r\nServe with a generous amount of lemon juice.\r\n\r\nYou can serve it with some short grain rice or some pita bread",
   "image": "https://www.themealdb.com/images/media/meals/x372ug1598733932.jpg"
  },
  {
   "id": "52839",
   "name": "Chilli prawn linguine",
   "ingredients": [
    "Linguine Pasta",
    "Sugar Snap Peas",
    "Olive Oil",
    "Garlic Clove",
    "Red Chilli",
    "King Prawns",
    "Cherry Tomatoes",
    "Basil Leaves",
    "Lettuce",
    "Bread",
    "Fromage Frais",
    "Lime",
    "Caster Sugar"
   ],
   "preparation": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
   "image": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg"
  },
  {
   "id": "52831",
   "name": "Chicken Karaage",
   "ingredients": [
    "Chicken thigh",
    "Ginger",
    "Garlic",
    "Soy sauce",
    "Sake",
    "Granulated sugar",
    "Potato starch",
    "Vegetable oil",
    "Lemon"
   ],
   "preparation": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges.",
   "image": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg"
  },
  {
   "id": "52856",
   "name": "Choc Chip Pecan Pie",
   "ingredients": [
    "Plain Flour",
    "Butter",
    "Cream Cheese",
    "Icing Sugar",
    "Butter",
    "Maple Syrup",
    "Light Brown Soft Sugar",
    "Dark Brown Soft Sugar",
    "Eggs",
    "Vanilla Extract",
    "Pecan Nuts",
    "Dark Chocolate Chips"
   ],
   "preparation": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
   "image": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg"
  },
  {
   "id": "53000",
   "name": "Vegetable Shepherd's Pie",
   "ingredients": [
    "Potatoes",
    "Small Potatoes",
    "Salted Butter",
    "Mushrooms",
    "Brown Lentils",
    "Garlic",
    "Kosher Salt",
    "Onion",
    "Tomato Puree",
    "Bay Leaves",
    "Olive Oil",
    "Dry White Wine",
    "Vegetable Stock",
    "Cornstarch",
    "Soy Sauce",
    "Rosemary",
    "Parsley",
    "Sage",
    "Chives"
   ],
   "preparation": "Add Ingredients:\r\n\r\n12 cups chopped mixed vegetables\r\n1   cup chopped fresh mushrooms \r\n1   cup pearl onions\r\n\r\nTOPPING:\r\n\r\nPreheat oven to 450°. Bake potatoes on a foil-lined baking sheet until tender, about 45 minutes. Let cool slightly, then peel. Press potatoes through a ricer, food mill, or colander into a large bowl. Add butter; stir until well blended. Stir in milk. Season to taste with salt.\r\n\r\nFILLING:\r\n\r\nSoak dried porcini in 3 cups hot water; set aside. Combine lentils, 1 garlic clove, 1 tsp. salt, and 4 cups water in a medium saucepan. Bring to a boil; reduce heat and simmer, stirring occasionally, until lentils are tender but not mushy, 15–20 minutes. Drain lentils and discard garlic.\r\n\r\nHeat 3 Tbsp. oil in a large heavy pot over medium heat. Add onions and cook, stirring occasionally, until soft, about 12 minutes. Add chopped garlic and cook for 1 minute. Stir in tomato paste. Cook, stirring constantly, until tomato paste is caramelized, 2–3 minutes.\r\n\r\nAdd bay leaves and wine; stir, scraping up any browned bits. Stir in porcini, slowly pouring porcini soaking liquid into pan but leaving any sediment behind. Bring to a simmer and cook until liquid is reduced by half, about 10 minutes. Stir in broth and cook, stirring occasionally, until reduced by half, about 45 minutes.\r\n\r\nStrain mixture into a large saucepan and bring to a boil; discard solids in strainer. Stir cornstarch and 2 Tbsp. water in a small bowl to dissolve. Add cornstarch mixture; simmer until thickened, about 5 minutes. Whisk in miso. Season sauce with salt and pepper. Set aside.\r\n\r\nPreheat oven to 450°. Toss vegetables and pearl onions with remaining 2 Tbsp. oil, 5 garlic cloves, and rosemary sprigs in a large bowl; season with salt and pepper. Divide between 2 rimmed baking sheets. Roast, stirring once, until tender, 20–25 minutes. Transfer garlic cloves to a small bowl; mash well with a fork and stir into sauce. Discard rosemary. DO AHEAD: Lentils, sauce, and vegetables can be made 1 day ahead. Cover separately; chill.\r\nArrange lentils in an even layer in a 3-qt. baking dish; set dish on a foil-lined rimmed baking sheet. Toss roasted vegetables with fresh mushrooms and chopped herbs; layer on top of lentils. Pour sauce over vegetables. Spoon potato mixture evenly over.\r\n\r\nBake until browned and bubbly, about 30 minutes. Let stand for 15 minutes before serving.",
   "image": "https://www.themealdb.com/images/media/meals/w8umt11583268117.jpg"
  },
  {
   "id": "52815",
   "name": "French Lentils With Garlic and Thyme",
   "ingredients": [
    "Olive Oil",
    "Onion",
    "Garlic",
    "Carrot",
    "French Lentils",
    "Thyme",
    "Bay Leaf",
    "Salt",
    "Celery"
   ],
   "preparation": "Place a large saucepan over medium heat and add oil. When hot, add chopped vegetables and sauté until softened, 5 to 10 minutes.\r\nAdd 6 cups water, lentils, thyme, bay leaves and salt. Bring to a boil, then reduce to a fast simmer.\r\nSimmer lentils until they are tender and have absorbed most of the water, 20 to 25 minutes. If necessary, drain any excess water after lentils have cooked. Serve immediately, or allow them to cool and reheat later.\r\nFor a fuller taste, use some chicken stock and reduce the water by the same amount.",
   "image": "https://www.themealdb.com/images/media/meals/vwwspt1487394060.jpg"
  },
  {
   "id": "52943",
   "name": "Oxtail with broad beans",
   "ingredients": [
    "Oxtail",
    "Onion",
    "Spring Onions",
    "Garlic",
    "Ginger",
    "Scotch Bonnet",
    "Soy Sauce",
    "Fresh Thyme",
    "Vegetable Oil",
    "Water",
    "Broad Beans",
    "Corn Flour",
    "Water"
   ],
   "preparation": "Toss the oxtail with the onion, spring onion, garlic, ginger, chilli, soy sauce, thyme, salt and pepper. Heat the vegetable oil in a large frying pan over medium-high heat. Brown the oxtail in the pan until browned all over, about 10 minutes. Place into a pressure cooker, and pour in 375ml water. Cook at pressure for 25 minutes, then remove from heat, and remove the lid according to manufacturer's directions.\r\nAdd the broad beans and pimento berries, and bring to a simmer over medium-high heat. Dissolve the cornflour in 2 tablespoons water, and stir into the simmering oxtail. Cook and stir a few minutes until the sauce has thickened, and the broad beans are tender.",
   "image": "https://www.themealdb.com/images/media/meals/1520083578.jpg"
  },
  {
   "id": "53023",
   "name": "Sledz w Oleju (Polish Herrings)",
   "ingredients": [
    "Herring",
    "Onion",
    "Olive Oil",
    "Allspice",
    "Pepper",
    "Bay Leaf"
   ],
   "preparation": "Soak herring in cold water for at least 1 hour. If very salty, repeat, changing the water each time.\r\n\r\nDrain thoroughly and slice herring into bite-size pieces.\r\n\r\nPlace in a jar large enough to accommodate the pieces and cover with oil, allspice, peppercorns, and bay leaf. Close the jar.\r\n\r\nRefrigerate for 2 to 3 days before eating. This will keep refrigerated up to 2 weeks.\r\n\r\nServe with finely chopped onion or onion slices, lemon, and parsley or dill.",
   "image": "https://www.themealdb.com/images/media/meals/7ttta31593350374.jpg"
  },
  {
   "id": "52992",
   "name": "Soy-Glazed Meatloaves with Wasabi Mashed Potatoes & Roasted Carrots",
   "ingredients": [
    "Potatoes",
    "Carrots",
    "Scallions",
    "Garlic",
    "Bread",
    "Garlic Powder",
    "Soy Sauce",
    "Ground Beef",
    "Vegetable Oil",
    "Sugar",
    "Butter"
   ],
   "preparation": "1. Preheat oven to 425 degrees. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Trim, peel, and cut carrots on a diagonal into 1/2-inch-thick pieces. Trim and thinly slice scallions, separating whites from greens; finely chop whites. Peel and finely chop garlic.\r\n\r\n2. In a medium bowl, soak bread with 2 TBSP water (4 TBSP for 4 servings); break up with your hands until pasty. Stir in beef, sriracha, scallion whites, half the garlic, salt (we used 3/4 tsp kosher salt; 11/2 tsp for 4), and pepper. Form into two 1-inch-tall loaves (four loaves for 4). Place on one side of a baking sheet. Toss carrots on empty side of same sheet with a drizzle of oil, salt, and pepper. (For 4, spread meatloaves out across whole sheet and add carrots to a second sheet.) Bake for 20 minutes (we'll glaze the meatloaves then).\r\n\r\n3. Meanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until very\r\ntender, 12-15 minutes. Reserve 1/2 cup potato cooking liquid, then drain. While potatoes cook, in a small bowl, combine soy sauce, garlic powder, 1/4 cup ketchup (1/2 cup for 4 servings), and 2 tsp sugar (4 tsp for 4).\r\n\r\n4. Once meatloaves and carrots have baked 20 minutes, remove from oven. Spoon half the ketchup glaze over meatloaves (save\r\nthe rest for serving); return to oven until carrots are browned and tender, meatloaves are cooked through, and glaze is tacky, 4-5 minutes more.\r\n\r\n5. Meanwhile, melt 2 TBSP butter (4 TBSP for 4 servings) in pot used for potatoes over medium heat. Add remaining garlic and cook\r\nuntil fragrant, 30 seconds. Add potatoes and 1/4 tsp wasabi. Mash, adding splashes of reserved potato cooking liquid as necessary until smooth. Season with salt and pepper. (If you like things spicy, stir in more wasabi!)\r\n\r\n6. Divide meatloaves, mashed potatoes, and roasted carrots between plates. Sprinkle with scallion greens and serve with remaining ketchup glaze on the side for dipping.",
   "image": "https://www.themealdb.com/images/media/meals/o2wb6p1581005243.jpg"
  },
  {
   "id": "52926",
   "name": "Tourtiere",
   "ingredients": [
    "Potatoes",
    "Sunflower Oil",
    "Minced Pork",
    "Onion",
    "Garlic Clove",
    "Cinnamon",
    "Allspice",
    "Nutmeg",
    "Vegetable Stock",
    "Shortcrust Pastry",
    "Egg"
   ],
   "preparation": "Heat oven to 200C/180C fan/gas 6. Boil the potato until tender, drain and mash, then leave to cool. Heat the oil in a non-stick pan, add the mince and onion and quickly fry until browned. Add the garlic, spices, stock, plenty of pepper and a little salt and mix well. Remove from the heat, stir into the potato and leave to cool.\r\nRoll out half the pastry and line the base of a 20-23cm pie plate or flan tin. Fill with the pork mixture and brush the edges of the pastry with water. Roll out the remaining dough and cover the pie. Press the edges of the pastry to seal, trimming off the excess. Prick the top of the pastry case to allow steam to escape and glaze the top with the beaten egg.\r\nBake for 30 mins until the pastry is crisp and golden. Serve cut into wedges with a crisp green salad. Leftovers are good cold for lunch the next day, served with a selection of pickles.",
   "image": "https://www.themealdb.com/images/media/meals/ytpstt1511814614.jpg"
  },
  {
   "id": "52998",
   "name": "Corned Beef and Cabbage",
   "ingredients": [
    "Beef Brisket",
    "Small Potatoes",
    "Carrots",
    "Cabbage"
   ],
   "preparation": "1\r\n\r\nPlace corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound or until tender.\r\n\r\n2\r\n\r\nAdd whole potatoes and peeled and cut carrots, and cook until the vegetables are almost tender. Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.\r\n\r\n3\r\n\r\nPlace vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain.",
   "image": "https://www.themealdb.com/images/media/meals/xb97a81583266727.jpg"
  },
  {
   "id": "53039",
   "name": "Piri-piri chicken and slaw",
   "ingredients": [
    "Chicken",
    "Red Chilli",
    "Garlic",
    "Ginger",
    "Dried Oregano",
    "Coriander",
    "Paprika",
    "Red Wine Vinegar",
    "Oil",
    "Red Onions",
    "Carrots",
    "Beetroot",
    "Cabbage",
    "Mayonnaise",
    "Greek Yogurt",
    "Red Wine Vinegar",
    "Cumin Seeds"
   ],
   "preparation": "STEP 1\r\n\r\nWhizz together all of the marinade ingredients in a small food processor. Rub the marinade onto the chicken and leave for 1 hour at room temperature.\r\n\r\nSTEP 2\r\n\r\nHeat the oven to 190C/fan 170C/gas 5. Put the chicken in a roasting tray and cook for 1 hour 20 minutes. Rest under loose foil for 20 minutes. While the chicken is resting, mix together the slaw ingredients and season. Serve the chicken with slaw, fries and condiments.",
   "image": "https://www.themealdb.com/images/media/meals/hglsbl1614346998.jpg"
  },
  {
   "id": "52920",
   "name": "Chicken Marengo",
   "ingredients": [
    "Olive Oil",
    "Mushrooms",
    "Chicken Legs",
    "Passata",
    "Chicken Stock Cube",
    "Black Olives",
    "Parsley"
   ],
   "preparation": "Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.\r\nPour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like.",
   "image": "https://www.themealdb.com/images/media/meals/qpxvuq1511798906.jpg"
  },
  {
   "id": "52768",
   "name": "Apple Frangipan Tart",
   "ingredients": [
    "digestive biscuits",
    "butter",
    "Bramley apples",
    "butter, softened",
    "caster sugar",
    "free-range eggs, beaten",
    "ground almonds",
    "almond extract",
    "flaked almonds"
   ],
   "preparation": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
   "image": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg"
  },
  {
   "id": "53034",
   "name": "Japanese Katsudon",
   "ingredients": [
    "Vegetable Oil",
    "Onion",
    "Pork",
    "Vegetable Stock",
    "Soy Sauce",
    "Mirin",
    "Sugar",
    "Eggs",
    "Sushi Rice",
    "Chives"
   ],
   "preparation": "STEP 1\r\nHeat the oil in a pan, fry the sliced onion until golden brown, then add the tonkatsu (see recipe here), placing it in the middle of the pan. Mix the dashi, soy, mirin and sugar together and tip three-quarters of the mixture around the tonkatsu. Sizzle for a couple of mins so the sauce thickens a little and the tonkatsu reheats.\r\n\r\nSTEP 2\r\nTip the beaten eggs around the tonkatsu and cook for 2-3 mins until the egg is cooked through but still a little runny. Divide the rice between two bowls, then top each with half the egg and tonkatsu mix, sprinkle over the chives and serve immediately, drizzling with a little more soy if you want an extra umami kick.",
   "image": "https://www.themealdb.com/images/media/meals/d8f6qx1604182128.jpg"
  },
  {
   "id": "52865",
   "name": "Matar Paneer",
   "ingredients": [
    "Sunflower Oil",
    "Paneer",
    "Ginger",
    "Cumin",
    "Turmeric",
    "Coriander",
    "Green Chilli",
    "Tomato",
    "Peas",
    "Garam Masala",
    "Coriander",
    "Naan Bread"
   ],
   "preparation": "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.\r\nPut the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice.",
   "image": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg"
  },
  {
   "id": "53023",
   "name": "Sledz w Oleju (Polish Herrings)",
   "ingredients": [
    "Herring",
    "Onion",
    "Olive Oil",
    "Allspice",
    "Pepper",
    "Bay Leaf"
   ],
   "preparation": "Soak herring in cold water for at least 1 hour. If very salty, repeat, changing the water each time.\r\n\r\nDrain thoroughly and slice herring into bite-size pieces.\r\n\r\nPlace in a jar large enough to accommodate the pieces and cover with oil, allspice, peppercorns, and bay leaf. Close the jar.\r\n\r\nRefrigerate for 2 to 3 days before eating. This will keep refrigerated up to 2 weeks.\r\n\r\nServe with finely chopped onion or onion slices, lemon, and parsley or dill.",
   "image": "https://www.themealdb.com/images/media/meals/7ttta31593350374.jpg"
  },
  {
   "id": "52792",
   "name": "Bread and Butter Pudding",
   "ingredients": [
    "butter",
    "bread",
    "sultanas",
    "cinnamon",
    "milk",
    "double cream",
    "eggs",
    "sugar",
    "nutmeg"
   ],
   "preparation": "Grease a 1 litre/2 pint pie dish with butter.\r\nCut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.\r\nArrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.\r\nGently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.\r\nCrack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.\r\nAdd the warm milk and cream mixture and stir well, then strain the custard into a bowl.\r\nPour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.\r\nPreheat the oven to 180C/355F/Gas 4.\r\nPlace the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown.",
   "image": "https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg"
  },
  {
   "id": "52979",
   "name": "Bitterballen (Dutch meatballs)",
   "ingredients": [
    "Butter",
    "Flour",
    "Beef Stock",
    "Onion",
    "Parsley",
    "Beef",
    "Salt",
    "Pepper",
    "Nutmeg",
    "Flour",
    "Eggs",
    "Breadcrumbs"
   ],
   "preparation": "Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thick paste. Slowly stir in the stock, making sure the roux absorbs the liquid. Simmer for a couple of minutes on a low heat while you stir in the onion, parsley and the shredded meat. The mixture should thicken and turn into a heavy, thick sauce.\r\n\r\nPour the mixture into a shallow container, cover and refrigerate for several hours, or until the sauce has solidified.\r\n\r\nTake a heaping tablespoon of the cold, thick sauce and quickly roll it into a small ball. Roll lightly through the flour, then the egg and finally the breadcrumbs. Make sure that the egg covers the whole surface of the bitterbal. When done, refrigerate the snacks while the oil in your fryer heats up to 190C (375F). Fry four bitterballen at a time, until golden.\r\n\r\nServe on a plate with a nice grainy or spicy mustard. \r\n",
   "image": "https://www.themealdb.com/images/media/meals/lhqev81565090111.jpg"
  },
  {
   "id": "53014",
   "name": "Pizza Express Margherita",
   "ingredients": [
    "Water",
    "Sugar",
    "Yeast",
    "Plain Flour",
    "Salt",
    "Olive Oil",
    "Passata",
    "Mozzarella",
    "Oregano",
    "Basil",
    "Black Pepper"
   ],
   "preparation": "1 Preheat the oven to 230°C.\r\n\r\n2 Add the sugar and crumble the fresh yeast into warm water.\r\n\r\n3 Allow the mixture to stand for 10 – 15 minutes in a warm place (we find a windowsill on a sunny day works best) until froth develops on the surface.\r\n\r\n4 Sift the flour and salt into a large mixing bowl, make a well in the middle and pour in the yeast mixture and olive oil.\r\n\r\n5 Lightly flour your hands, and slowly mix the ingredients together until they bind.\r\n\r\n6 Generously dust your surface with flour.\r\n\r\n7 Throw down the dough and begin kneading for 10 minutes until smooth, silky and soft.\r\n\r\n8 Place in a lightly oiled, non-stick baking tray (we use a round one, but any shape will do!)\r\n\r\n9 Spread the passata on top making sure you go to the edge.\r\n\r\n10 Evenly place the mozzarella (or other cheese) on top, season with the oregano and black pepper, then drizzle with a little olive oil.\r\n\r\n11 Cook in the oven for 10 – 12 minutes until the cheese slightly colours.\r\n\r\n12 When ready, place the basil leaf on top and tuck in!",
   "image": "https://www.themealdb.com/images/media/meals/x0lk931587671540.jpg"
  },
  {
   "id": "52962",
   "name": "Salmon Eggs Eggs Benedict",
   "ingredients": [
    "Eggs",
    "White Wine Vinegar",
    "English Muffins",
    "Butter",
    "Smoked Salmon",
    "Lemon Juice",
    "White Wine Vinegar",
    "Egg",
    "Unsalted Butter"
   ],
   "preparation": "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.\r\n\r\nTo poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.\r\n\r\nLightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives.",
   "image": "https://www.themealdb.com/images/media/meals/1550440197.jpg"
  },
  {
   "id": "52880",
   "name": "McSinghs Scotch pie",
   "ingredients": [
    "Cumin",
    "Rapeseed Oil",
    "Red Onions",
    "Garlic Clove",
    "Green Chilli",
    "Red Pepper",
    "Nutmeg",
    "Coriander",
    "Lamb Mince",
    "Pepper",
    "Coriander",
    "Plain Flour",
    "Salt",
    "Milk",
    "Lard",
    "Egg Yolks"
   ],
   "preparation": "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.\r\nIn a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.\r\nPreheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.\r\nTo make the pastry, sift the flour and salt in a large bowl and make a well in the centre.\r\nPut the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.\r\nPour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.\r\nDust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.\r\nAdd the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.\r\nBrush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.\r\nRun a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles.",
   "image": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg"
  },
  {
   "id": "53040",
   "name": "Spring onion and prawn empanadas",
   "ingredients": [
    "Spring Onions",
    "Olive Oil",
    "Red Chilli",
    "Garlic",
    "Prawns",
    "Feta",
    "Butter",
    "Plain Flour",
    "Egg",
    "White Wine Vinegar"
   ],
   "preparation": "STEP 1\r\n\r\nTo make the dough, rub the butter into the flour and then add the egg white and half the yolk (keep the rest), vinegar, a pinch of salt and enough cold water to make a soft dough. Knead on a floured surface until smooth and then wrap and rest for 30 minutes.\r\n\r\nSTEP 2\r\n\r\nHeat the oven to 180c/fan 160c/gas 4. Trim the green ends of the spring onions and then finely slice the rest. Heat a little oil in a pan and fry them gently until soft but not browned. Add the chilli and garlic, stir and then add the prawns and cook until they are opaque. Season well. Scoop out the prawns and bubble the juices until they thicken, then add back the prawns.\r\n\r\nSTEP 3\r\n\r\nDivide the empanada dough into eight balls and roll out to thin circles on a floured surface. Put some filling on one half of the dough, sprinkle the feta on top and fold the other half over. Trim the edge and then fold and crimp the dough together so the empanada is tightly sealed, put it on an oiled baking sheet either on its side or sitting on its un-crimped edge like a cornish pasty. Repeat with the remaining dough and mixture. Mix the leftover egg yolk with a splash of water and brush the top of the empanadas.\r\n\r\nSTEP 4\r\n\r\nBake for 30 minutes or until golden and slightly crisp around the edges.",
   "image": "https://www.themealdb.com/images/media/meals/1c5oso1614347493.jpg"
  },
  {
   "id": "52774",
   "name": "Pad See Ew",
   "ingredients": [
    "rice stick noodles",
    "dark soy sauce",
    "oyster sauce",
    "soy sauce",
    "white vinegar",
    "sugar",
    "water",
    "peanut oil",
    "garlic",
    "Chicken",
    "Egg",
    "Chinese broccoli"
   ],
   "preparation": "Mix Sauce in small bowl.\r\nMince garlic into wok with oil. Place over high heat, when hot, add chicken and Chinese broccoli stems, cook until chicken is light golden.\r\nPush to the side of the wok, crack egg in and scramble. Don't worry if it sticks to the bottom of the wok - it will char and which adds authentic flavour.\r\nAdd noodles, Chinese broccoli leaves and sauce. Gently mix together until the noodles are stained dark and leaves are wilted. Serve immediately!",
   "image": "https://www.themealdb.com/images/media/meals/uuuspp1468263334.jpg"
  },
  {
   "id": "52962",
   "name": "Salmon Eggs Eggs Benedict",
   "ingredients": [
    "Eggs",
    "White Wine Vinegar",
    "English Muffins",
    "Butter",
    "Smoked Salmon",
    "Lemon Juice",
    "White Wine Vinegar",
    "Egg",
    "Unsalted Butter"
   ],
   "preparation": "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.\r\n\r\nTo poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.\r\n\r\nLightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives.",
   "image": "https://www.themealdb.com/images/media/meals/1550440197.jpg"
  },
  {
   "id": "52817",
   "name": "Stovetop Eggplant With Harissa, Chickpeas, and Cumin Yogurt",
   "ingredients": [
    "Olive Oil",
    "Egg Plants",
    "Harissa",
    "Chickpeas",
    "Cherry Tomatoes",
    "Greek yogurt",
    "Ground cumin",
    "Parsley"
   ],
   "preparation": "Heat the oil in a 12-inch skillet over high heat until shimmering. Add the eggplants and lower the heat to medium. Season with salt and pepper as you rotate the eggplants, browning them on all sides. Continue to cook, turning regularly, until a fork inserted into the eggplant meets no resistance (you may have to stand them up on their fat end to finish cooking the thickest parts), about 20 minutes, lowering the heat and sprinkling water into the pan as necessary if the eggplants threaten to burn or smoke excessively.\r\n\r\n2.\r\nMix the harissa, chickpeas and tomatoes together, then add to the eggplants. Cook until the tomatoes have blistered and broken down, about 5 minutes more. Season with salt and pepper and add water as necessary to thin to a saucy consistency. Meanwhile, combine the yogurt and cumin in a serving bowl. Season with salt and pepper.\r\n\r\n3.\r\nTop the eggplant mixture with the parsley, drizzle with more extra virgin olive oil, and serve with the yogurt on the side.",
   "image": "https://www.themealdb.com/images/media/meals/yqwtvu1487426027.jpg"
  },
  {
   "id": "52954",
   "name": "Hot and Sour Soup",
   "ingredients": [
    "Mushrooms",
    "Wood Ear Mushrooms",
    "Tofu",
    "Pork",
    "Chicken Stock",
    "Salt",
    "Sugar",
    "Sesame Seed Oil",
    "Pepper",
    "Hotsauce",
    "Vinegar",
    "Soy Sauce",
    "Cornstarch",
    "Water",
    "Spring Onions"
   ],
   "preparation": "STEP 1 - MAKING THE SOUP\r\nIn a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, sesame seed oil, white pepper, hot pepper sauce, vinegar and soy sauce and stir for few seconds.\r\nAdd Tofu, mushrooms, black wood ear mushrooms to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup and stir for 8 seconds\r\nServe the soup in a bowl and add the bbq pork and sliced green onions on top.",
   "image": "https://www.themealdb.com/images/media/meals/1529445893.jpg"
  },
  {
   "id": "52786",
   "name": "Rocky Road Fudge",
   "ingredients": [
    "Miniature Marshmallows",
    "Chocolate Chips",
    "Peanut Butter",
    "Vanilla Extract",
    "Peanuts"
   ],
   "preparation": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nPour ½ cup of the miniature marshmallows into the bottom of the lined baking dish.\r\nIn a microwave-safe bowl, combine the chocolate chips and peanut butter. Microwave the chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract and stir well, until smooth.\r\nReserve 2 tablespoons of the chopped almonds or peanuts, and set aside.\r\nFold 1 ½ cups of the miniature marshmallows and the remaining chopped nuts into the chocolate mixture.\r\nTransfer the chocolate mixture into the prepared pan and spread into an even layer. Immediately top with the reserved chopped nuts and the mallow bits or additional miniature marshmallows, if using.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.",
   "image": "https://www.themealdb.com/images/media/meals/vtxyxv1483567157.jpg"
  },
  {
   "id": "52767",
   "name": "Bakewell tart",
   "ingredients": [
    "plain flour",
    "chilled butter",
    "cold water",
    "raspberry jam",
    "butter",
    "caster sugar",
    "ground almonds",
    "free-range egg, beaten",
    "almond extract",
    "flaked almonds"
   ],
   "preparation": "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r\nRoll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 (180C fan).\r\nLine the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r\nFor the filing, spread the base of the flan generously with raspberry jam.\r\nMelt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r\nBake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.",
   "image": "https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg"
  },
  {
   "id": "52901",
   "name": "Rock Cakes",
   "ingredients": [
    "Self-raising Flour",
    "Caster Sugar",
    "Baking Powder",
    "Butter",
    "Dried Fruit",
    "Eggs",
    "Milk",
    "Vanilla Extract"
   ],
   "preparation": "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.\r\nMix the flour, sugar and baking powder in a bowl and rub in the cubed butter until the mixture looks like breadcrumbs, then mix in the dried fruit.\r\nIn a clean bowl, beat the egg and milk together with the vanilla extract.\r\nAdd the egg mixture to the dry ingredients and stir with a spoon until the mixture just comes together as a thick, lumpy dough. Add a teaspoon more milk if you really need it to make the mixture stick together.\r\nPlace golfball-sized spoons of the mixture onto the prepared baking tray. Leave space between them as they will flatten and spread out to double their size during baking.\r\nBake for 15-20 minutes, until golden-brown. Remove from the oven, allow to cool for a couple of minutes then turn them out onto a wire rack to cool.",
   "image": "https://www.themealdb.com/images/media/meals/tqrrsq1511723764.jpg"
  },
  {
   "id": "52805",
   "name": "Lamb Biryani",
   "ingredients": [
    "Cashew nuts",
    "Khus khus",
    "Cumin seeds",
    "Onions",
    "Ginger garlic paste",
    "Garlic",
    "Mint",
    "Cilantro",
    "Saffron",
    "Ghee",
    "Basmati rice",
    "Full fat yogurt",
    "Cumin Seeds",
    "Bay leaf",
    "Cinnamon",
    "Cloves",
    "Cardamom",
    "Lamb",
    "Red Chilli powder",
    "Biryani masala"
   ],
   "preparation": "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. \r\n\r\nDeep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.\r\n\r\nTake another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.\r\n\r\nNow, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.\r\n\r\nCover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!\r\nNotes\r\n1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.\r\n2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)\r\n3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also.",
   "image": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg"
  },
  {
   "id": "52906",
   "name": "Flamiche",
   "ingredients": [
    "Butter",
    "Leek",
    "Salt",
    "Creme Fraiche",
    "Egg",
    "Egg Yolks",
    "Nutmeg",
    "Plain Flour",
    "Salt",
    "Butter",
    "Lard",
    "Cheddar Cheese",
    "Water"
   ],
   "preparation": "For the pastry, sift the flour and salt into the bowl of a food processor, add the butter and lard, then whizz together briefly until the mixture looks like fine breadcrumbs. Tip the mixture into a bowl, then stir in the cheese and enough of the water for the mixture to come together. Tip out onto a lightly floured surface and knead briefly until smooth. Roll out thinly and line a 23cm x 4cm loose-?bottomed fluted flan tin. Prick the base with a fork. Chill for 20 minutes.\r\n02.Melt the 75g butter in a saucepan over a low heat, then add the leeks and the salt. Cover and cook for ?10 minutes until soft. Uncover the pan, increase the heat and cook ?for 2 minutes, stirring occasionally, until the liquid has evaporated. Spoon onto a plate and leave to cool.\r\n03.Preheat the oven to 200°C/fan180°C/gas 6. Line the pastry case with baking paper and baking beans or rice and blind bake for 15-20 minutes until the edges are biscuit-coloured. Remove the paper and beans/rice and return the case to the oven for 7-10 minutes until the base is crisp and lightly golden. Remove and set aside. Reduce the oven temperature to 190°C/fan170°C/gas 5.\r\n04.Put the crème fraîche into a bowl with the whole egg, egg yolks and nutmeg. Lightly beat together, then season. Stir in the leeks. Spoon ?the mixture into the tart case and bake for 35-40 minutes until set ?and lightly golden. Remove from ?the oven and leave for 10 minutes. Take out of the tin and serve.",
   "image": "https://www.themealdb.com/images/media/meals/wssvvs1511785879.jpg"
  },
  {
   "id": "53019",
   "name": "Pierogi (Polish Dumplings)",
   "ingredients": [
    "Butter",
    "Chopped Onion",
    "Sauerkraut",
    "Butter",
    "Chopped Onion",
    "Potatoes",
    "Eggs",
    "Sour Cream",
    "Flour",
    "Salt",
    "Baking Powder"
   ],
   "preparation": "To prepare the sauerkraut filling, melt the butter in a skillet over medium heat. Stir in the onion, and cook until translucent, about 5 minutes. Add the drained sauerkraut and cook for an additional 5 minutes. Season to taste with salt and pepper, then remove to a plate to cool.\r\n\r\nFor the mashed potato filling, melt the butter in a skillet over medium heat. Stir in the onion, and cook until translucent, about 5 minutes. Stir into the mashed potatoes, and season with salt and white pepper.\r\n\r\nTo make the dough, beat together the eggs and sour cream until smooth. Sift together the flour, salt, and baking powder; stir into the sour cream mixture until dough comes together. Knead the dough on a lightly floured surface until firm and smooth. Divide the dough in half, then roll out one half to 1/8 inch thickness. Cut into 3 inch rounds using a biscuit cutter.\r\n\r\nPlace a small spoonful of the mashed potato filling into the center of each round. Moisten the edges with water, fold over, and press together with a fork to seal. Repeat procedure with the remaining dough and the sauerkraut filling.\r\n\r\nBring a large pot of lightly salted water to a boil. Add perogies and cook for 3 to 5 minutes or until pierogi float to the top. Remove with a slotted spoon.",
   "image": "https://www.themealdb.com/images/media/meals/45xxr21593348847.jpg"
  },
  {
   "id": "52923",
   "name": "Canadian Butter Tarts",
   "ingredients": [
    "Shortcrust Pastry",
    "Eggs",
    "Muscovado Sugar",
    "Raisins",
    "Vanilla Extract",
    "Butter",
    "Single Cream",
    "Walnuts"
   ],
   "preparation": "Preheat the oven to fan 170C/ conventional 190C/gas 5. Roll out the pastry on a lightly floured surface so it’s slightly thinner than straight from the pack. Then cut out 18-20 rounds with a 7.5cm fluted cutter, re-rolling the trimmings. Use the rounds to line two deep 12-hole tart tins (not muffin tins). If you only have a regular-sized, 12-hole tart tin you will be able to make a few more slightly shallower tarts.\r\nBeat the eggs in a large bowl and combine with the rest of the ingredients except the walnuts. Tip this mixture into a pan and stir continuously for 3-4 minutes until the butter melts, and the mixture bubbles and starts to thicken. It should be thick enough to coat the back of a wooden spoon. Don’t overcook, and be sure to stir all the time as the mixture can easily burn. Remove from the heat and stir in the nuts.\r\nSpoon the filling into the unbaked tart shells so it’s level with the pastry. Bake for 15-18 minutes until set and pale golden. Leave in the tin to cool for a few minutes before lifting out on to a wire rack. Serve warm or cold.",
   "image": "https://www.themealdb.com/images/media/meals/wpputp1511812960.jpg"
  },
  {
   "id": "52894",
   "name": "Battenberg Cake",
   "ingredients": [
    "Butter",
    "Caster Sugar",
    "Self-raising Flour",
    "Almonds",
    "Baking Powder",
    "Eggs",
    "Vanilla Extract",
    "Almond Extract",
    "Butter",
    "Caster Sugar",
    "Self-raising Flour",
    "Almonds",
    "Baking Powder",
    "Eggs",
    "Vanilla Extract",
    "Almond Extract",
    "Pink Food Colouring",
    "Apricot",
    "Marzipan",
    "Icing Sugar"
   ],
   "preparation": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.",
   "image": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg"
  },
  {
   "id": "52769",
   "name": "Kapsalon",
   "ingredients": [
    "Fries",
    "Doner Meat",
    "Garlic sauce",
    "Hotsauce",
    "Lettuce",
    "Tomato",
    "Cucumber",
    "Gouda cheese"
   ],
   "preparation": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
   "image": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg"
  },
  {
   "id": "53018",
   "name": "Bigos (Hunters Stew)",
   "ingredients": [
    "Bacon",
    "Kielbasa",
    "Pork",
    "Flour",
    "Garlic",
    "Onion",
    "Mushrooms",
    "Cabbage",
    "Sauerkraut",
    "Red Wine",
    "Bay Leaf",
    "Basil",
    "Marjoram",
    "Paprika",
    "Caraway Seed",
    "Hotsauce",
    "Beef Stock",
    "Tomato Puree",
    "Diced Tomatoes",
    "Worcestershire Sauce"
   ],
   "preparation": "Preheat the oven to 350 degrees F (175 degrees C).\r\n\r\nHeat a large pot over medium heat. Add the bacon and kielbasa; cook and stir until the bacon has rendered its fat and sausage is lightly browned. Use a slotted spoon to remove the meat and transfer to a large casserole or Dutch oven.\r\n\r\nCoat the cubes of pork lightly with flour and fry them in the bacon drippings over medium-high heat until golden brown. Use a slotted spoon to transfer the pork to the casserole. Add the garlic, onion, carrots, fresh mushrooms, cabbage and sauerkraut. Reduce heat to medium; cook and stir until the carrots are soft, about 10 minutes. Do not let the vegetables brown.\r\n\r\nDeglaze the pan by pouring in the red wine and stirring to loosen all of the bits of food and flour that are stuck to the bottom. Season with the bay leaf, basil, marjoram, paprika, salt, pepper, caraway seeds and cayenne pepper; cook for 1 minute.\r\n\r\nMix in the dried mushrooms, hot pepper sauce, Worcestershire sauce, beef stock, tomato paste and tomatoes. Heat through just until boiling. Pour the vegetables and all of the liquid into the casserole dish with the meat. Cover with a lid.\r\n\r\nBake in the preheated oven for 2 1/2 to 3 hours, until meat is very tender.",
   "image": "https://www.themealdb.com/images/media/meals/md8w601593348504.jpg"
  },
  {
   "id": "53008",
   "name": "Stuffed Lamb Tomatoes",
   "ingredients": [
    "Tomatoes",
    "Sugar",
    "Olive Oil",
    "Onion",
    "Garlic Clove",
    "Lamb",
    "Cinnamon",
    "Tomato Puree",
    "Rice",
    "Chicken Stock",
    "Dill",
    "Chopped Parsley",
    "Mint"
   ],
   "preparation": "Heat oven to 180C/160C fan/gas 4. Slice the tops off the tomatoes and reserve. Scoop out most of the pulp with a teaspoon, being careful not to break the skin. Finely chop the pulp, and keep any juices. Sprinkle the insides of the tomatoes with a little sugar to take away the acidity, then place them on a baking tray.\r\n\r\nHeat 2 tbsp olive oil in a large frying pan, add the onion and garlic, then gently cook for about 10 mins until soft but not coloured. Add the lamb, cinnamon and tomato purée, turn up the heat, then fry until the meat is browned. Add the tomato pulp and juice, the rice and the stock. Season generously. Bring to the boil, then simmer for 15 mins or until the rice is tender and the liquid has been absorbed. Set aside to cool a little, then stir in the herbs.\r\n\r\nStuff the tomatoes up to the brim, top tomatoes with their lids, drizzle with 2 tbsp more olive oil, sprinkle 3 tbsp water into the tray, then bake for 35 mins. Serve with salad and crusty bread, hot or cold.",
   "image": "https://www.themealdb.com/images/media/meals/u55lbp1585564013.jpg"
  },
  {
   "id": "52827",
   "name": "Massaman Beef curry",
   "ingredients": [
    "Peanuts",
    "Coconut cream",
    "Massaman curry paste",
    "Beef",
    "Potatoes",
    "Onion",
    "Lime",
    "Cinnamon stick",
    "Tamarind paste",
    "Brown sugar",
    "Fish Sauce",
    "chilli",
    "Jasmine Rice"
   ],
   "preparation": "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.\r\nHeat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.\r\nSprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice.",
   "image": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg"
  },
  {
   "id": "52916",
   "name": "Pear Tarte Tatin",
   "ingredients": [
    "Pears",
    "Caster Sugar",
    "Butter",
    "Star Anise",
    "Cardamom",
    "Cinnamon",
    "Brandy",
    "Puff Pastry"
   ],
   "preparation": "Core the pears, then peel as neatly as possible and halve. If you like, they can be prepared up to a day ahead and kept in the fridge, uncovered, so that they dry out.\r\nTip the sugar, butter, star anise, cardamom and cinnamon into an ovenproof frying pan, about 20cm wide, and place over a high heat until bubbling. Shake the pan and stir the buttery sauce until it separates and the sugar caramelises to a toffee colour.\r\nLay the pears in the pan, then cook in the sauce for 10-12 mins, tossing occasionally, until completely caramelised. Don’t worry about them burning – they won’t – but you want to caramelise them as much as possible. Splash in the brandy and let it flambé, then set the pears aside.\r\nHeat oven to 200C/fan 180C/gas 6. Roll the pastry out to the thickness of a £1 coin. Using a plate slightly larger than the top of the pan, cut out a circle, then press the edges of the circle of pastry to thin them out.\r\nWhen the pears have cooled slightly, arrange them in the pan, cut side up, in a floral shape, with the pears around the edge pointing inwards. Rest the cinnamon stick on the top in the centre, with the cardamom pods scattered around.\r\nDrape the pastry over the pears, then tuck the edges down the pan sides and under the fruit (see Gordon’s guide). Pierce the pastry a few times, then bake for 15 mins. If a lot of juice bubbles up the side of the pan, pour it off at this stage (see guide). Reduce oven to 180C/fan 160C/gas 4 and bake for 15 mins more until the pastry is golden. Leave the tart to stand for 10 mins, then invert it carefully onto a serving dish.",
   "image": "https://www.themealdb.com/images/media/meals/rxvxrr1511797671.jpg"
  },
  {
   "id": "52774",
   "name": "Pad See Ew",
   "ingredients": [
    "rice stick noodles",
    "dark soy sauce",
    "oyster sauce",
    "soy sauce",
    "white vinegar",
    "sugar",
    "water",
    "peanut oil",
    "garlic",
    "Chicken",
    "Egg",
    "Chinese broccoli"
   ],
   "preparation": "Mix Sauce in small bowl.\r\nMince garlic into wok with oil. Place over high heat, when hot, add chicken and Chinese broccoli stems, cook until chicken is light golden.\r\nPush to the side of the wok, crack egg in and scramble. Don't worry if it sticks to the bottom of the wok - it will char and which adds authentic flavour.\r\nAdd noodles, Chinese broccoli leaves and sauce. Gently mix together until the noodles are stained dark and leaves are wilted. Serve immediately!",
   "image": "https://www.themealdb.com/images/media/meals/uuuspp1468263334.jpg"
  },
  {
   "id": "52808",
   "name": "Lamb Rogan josh",
   "ingredients": [
    "Onion",
    "Sunflower Oil",
    "Garlic",
    "Ginger",
    "Madras Paste",
    "Paprika",
    "cinnamon stick",
    "Cardamom",
    "Clove",
    "Bay Leaf",
    "Tomato Purée",
    "Lamb",
    "Greek yogurt",
    "Coriander"
   ],
   "preparation": "\r\nPut the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more.\r\nTip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt.\r\nCover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice.",
   "image": "https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg"
  },
  {
   "id": "52769",
   "name": "Kapsalon",
   "ingredients": [
    "Fries",
    "Doner Meat",
    "Garlic sauce",
    "Hotsauce",
    "Lettuce",
    "Tomato",
    "Cucumber",
    "Gouda cheese"
   ],
   "preparation": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
   "image": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg"
  },
  {
   "id": "52919",
   "name": "Fennel Dauphinoise",
   "ingredients": [
    "Potatoes",
    "Fennel",
    "Garlic",
    "Milk",
    "Double Cream",
    "Butter",
    "Parmesan Cheese"
   ],
   "preparation": "Heat oven to 180C/160C fan/gas 4. Put potatoes, fennel, and garlic in a medium non-stick pan. Pour in milk and double cream, season well and simmer gently, covered, for 10 mins, stirring halfway through, until potatoes are just tender.\r\nDivide the mixture between 2 small (about 150ml) buttered ramekins and scatter with Parmesan. Bake for 40 mins until the potatoes are golden and tender when pierced with a knife. Snip the reserved fennel fronds over before serving.",
   "image": "https://www.themealdb.com/images/media/meals/ytttsv1511798734.jpg"
  },
  {
   "id": "52783",
   "name": "Rigatoni with fennel sausage sauce",
   "ingredients": [
    "olive oil",
    "Italian fennel sausages",
    "onion",
    "fennel bulb",
    "smoky paprika",
    "garlic",
    "fennel seeds",
    "red wine",
    "chopped tomatoes",
    "caster sugar",
    "pitted black olives",
    "rigatoni",
    "pecorino",
    "anchovy fillet",
    "garlic",
    "olive oil",
    "basil leaves"
   ],
   "preparation": "Heat a tablespoon of oil in a large saute pan for which you have a lid. Add the sausage pieces and fry on a medium-high heat for 10 minutes, stirring regularly, until golden-brown all over. Transfer the sausages to a plate, then add the onion and fennel to the hot pan and fry for 15 minutes, stirring once in a while, until soft and caramelised; if the pan goes a bit dry, add a teaspoon or so of extra oil. Stir in the paprika, garlic and half the fennel seeds, fry for two minutes more, then pour on the wine and boil for 30 seconds, to reduce by half. Add the tomatoes, sugar, 100ml water, the seared sausage and half a teaspoon of salt, cover and simmer for 30 minutes; remove the lid after 10 minutes, and cook until the sauce is thick and rich. Remove from the heat, stir through the olives and remaining fennel seeds and set aside until you’re ready to serve.\r\n\r\nBring a large pot of salted water to a boil, add the pasta and cook for 12-14 minutes (or according to the instructions on the packet), until al dente. Meanwhile, reheat the sauce. Drain the pasta, return it to the pot, stir in a tablespoon of oil, then divide between the bowls. \r\n\r\nPut all the pesto ingredients except the basil in the small bowl of a food processor. Add a tablespoon of water and blitz to a rough paste. Add the basil, then blitz until just combined (the pesto has a much better texture if the basil is not overblended).\r\n\r\nSpoon over the ragù and top with a spoonful of pesto. Finish with a sprinkling of chopped fennel fronds, if you have any, and serve at once.",
   "image": "https://www.themealdb.com/images/media/meals/qtqvys1468573168.jpg"
  },
  {
   "id": "52814",
   "name": "Thai Green Curry",
   "ingredients": [
    "potatoes",
    "green beans",
    "sunflower oil",
    "garlic",
    "Thai green curry paste",
    "coconut milk",
    "Thai fish sauce",
    "Sugar",
    "Chicken",
    "lime",
    "basil",
    "Rice"
   ],
   "preparation": "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a further 3 minutes, by which time both should be just tender but not too soft. Drain and put to one side.\r\nIn a wok or large frying pan, heat the oil until very hot, then drop in the garlic and cook until golden, this should take only a few seconds. Don’t let it go very dark or it will spoil the taste. Spoon in the curry paste and stir it around for a few seconds to begin to cook the spices and release all the flavours. Next, pour in the coconut milk and let it come to a bubble.\r\nStir in the fish sauce and sugar, then the pieces of chicken. Turn the heat down to a simmer and cook, covered, for about 8 minutes until the chicken is cooked.\r\nTip in the potatoes and beans and let them warm through in the hot coconut milk, then add a lovely citrussy flavour by stirring in the shredded lime leaves (or lime zest). The basil leaves go in next, but only leave them briefly on the heat or they will quickly lose their brightness. Scatter with the lime garnish and serve immediately with boiled rice.",
   "image": "https://www.themealdb.com/images/media/meals/sstssx1487349585.jpg"
  },
  {
   "id": "52874",
   "name": "Beef and Mustard Pie",
   "ingredients": [
    "Beef",
    "Plain Flour",
    "Rapeseed Oil",
    "Red Wine",
    "Beef Stock",
    "Onion",
    "Carrots",
    "Thyme",
    "Mustard",
    "Egg Yolks",
    "Puff Pastry",
    "Green Beans",
    "Butter",
    "Salt",
    "Pepper"
   ],
   "preparation": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.",
   "image": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg"
  },
  {
   "id": "52940",
   "name": "Brown Stew Chicken",
   "ingredients": [
    "Chicken",
    "Tomato",
    "Onions",
    "Garlic Clove",
    "Red Pepper",
    "Carrots",
    "Lime",
    "Thyme",
    "Allspice",
    "Soy Sauce",
    "Cornstarch",
    "Coconut Milk",
    "Vegetable Oil"
   ],
   "preparation": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
   "image": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg"
  },
  {
   "id": "52771",
   "name": "Spicy Arrabiata Penne",
   "ingredients": [
    "penne rigate",
    "olive oil",
    "garlic",
    "chopped tomatoes",
    "red chilli flakes",
    "italian seasoning",
    "basil",
    "Parmigiano-Reggiano"
   ],
   "preparation": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.\r\nIn a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.\r\nDrain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
   "image": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg"
  },
  {
   "id": "53046",
   "name": "Portuguese custard tarts",
   "ingredients": [
    "Plain Flour",
    "Icing Sugar",
    "Puff Pastry",
    "Caster Sugar",
    "Lemon Zest",
    "Cinnamon",
    "Eggs",
    "Egg Yolks",
    "Corn Flour",
    "Whole Milk",
    "Vanilla",
    "Cinnamon"
   ],
   "preparation": "STEP 1\r\nRoll the pastry\r\nMix the flour and icing sugar, and use this to dust the work surface. Roll the pastry out to make a 45 x 30cm rectangle. Roll up lengthways to create a long sausage shape.\r\n\r\nSTEP 2\r\nCutting pastry into rounds\r\nCut the pastry into 24 wheels, about 1-2cm thick.\r\n\r\nSTEP 3\r\nRoll out each pastry portion\r\nRoll each wheel lightly with the rolling pin to fit 2 x 12-hole non-stick fairy cake tins.\r\n\r\nSTEP 4\r\nPress pastry into the tin\r\nPress the pastry circles into the tins and mould into the tins to make thin cases. Chill until needed.\r\n\r\nSTEP 5\r\nMake the infused syrup\r\nHeat the oven to 220C/fan 200C/gas 7. Make a sugar syrup by bringing the sugar, 200ml water, lemon zest and cinnamon stick to the boil. Reduce until syrupy, allow to cool, then remove the cinnamon and lemon. Whisk the eggs, egg yolks and cornflour until smooth in another large pan.\r\n\r\nSTEP 6\r\nMaking custard\r\nHeat the milk and vanilla pod seeds in a separate pan until just below the boil. Gradually pour the hot milk over the eggs and cornflour, then cook on a low heat, continually whisking.\r\n\r\nSTEP 7\r\nAdd syrup to custard\r\nAdd the cooled sugar syrup to the custard and whisk until thickened slightly.\r\n\r\nSTEP 8\r\nPour custard into the tins\r\nPour the custard through a sieve. Pour into the pastry cases and bake for 15 minutes until the pastry is golden and the custard has darkened.\r\n\r\nSTEP 9\r\ncool and dust with icing sugar\r\nCool completely in the tins then sift over icing sugar and ground cinnamon to serve.\r\n\r\n\r\n\r\n ",
   "image": "https://www.themealdb.com/images/media/meals/vmz7gl1614350221.jpg"
  },
  {
   "id": "53009",
   "name": "Lamb and Lemon Souvlaki",
   "ingredients": [
    "Garlic",
    "Sea Salt",
    "Olive Oil",
    "Lemon",
    "Dill",
    "Lamb Leg",
    "Pita Bread"
   ],
   "preparation": "Pound the garlic with sea salt in a pestle and mortar (or use a small food processor), until the garlic forms a paste. Whisk together the oil, lemon juice, zest, dill and garlic. Mix in the lamb and combine well. Cover and marinate for at least 2 hrs or overnight in the fridge. If you’re going to use bamboo skewers, soak them in cold water.\r\n\r\nIf you’ve prepared the lamb the previous day, take it out of the fridge 30 mins before cooking. Thread the meat onto the soaked or metal skewers. Heat the grill to high or have a hot griddle pan or barbecue ready. Cook the skewers for 2-3 mins on each side, basting with the remaining marinade. Heat the pitta or flatbreads briefly, then stuff with the souvlaki. Add Greek salad (see 'Goes well with', right) and Tzatziki (below), if you like.",
   "image": "https://www.themealdb.com/images/media/meals/rjhf741585564676.jpg"
  },
  {
   "id": "53031",
   "name": "Egyptian Fatteh",
   "ingredients": [
    "Beef",
    "Onion",
    "Chicken Stock Cube",
    "Tomatoes",
    "Garlic Clove",
    "Tomato Puree",
    "Rice",
    "Noodles",
    "Butter",
    "Olive Oil",
    "Pita Bread",
    "Cumin",
    "White Wine Vinegar",
    "Salt",
    "Pepper"
   ],
   "preparation": "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan, add about a 1/4 stick of butter, add bread pieces and fry until golden brown and crisp. Put these pieces in a glass baking dish, preferably a square sized dish. Set aside.\r\nThen add to same pan, a little more butter, salt, approximately 2 cloves of crushed fresh garlic, and a teaspoon or so of cumin stir around a bit until you can smell aroma, then add fried bread pieces to this mixture, stir to coat bread and put back into glass baking dish. Set aside.\r\nTo prepare meat: put some butter in a pot, stir fry meat until brown, add 1 onion quartered, salt & pepper, 1 cube of chicken bouillon and water to cover meat. Bring to a boil, turn down to simmer, cover and cook until tender, approximately 2 hours. After meat has cooled, take out chunks of meat and put in a bowl, set aside. Reserve soup from the meat separately.\r\nTo prepare the rice: Put some butter into a pot, add shareya (fideo noodles) like a handful or so, keep stirring until golden brown, not too dark, but very golden. Then add two cups of rice, stir a little bit until some of the rice turns an opaque white. Add 2-1/4 cups of water and salt to taste. Bring to a boil, cover and turn down to simmer, cook until tender. Test the rice tenderness after about 35 minutes.\r\nNow take some of the soup from meat and add to the top of the bread pieces in baking dish to saturate.Add cooked rice on top of bread pieces. Slowly spoon remainder of soup onto rice, looking at glass dish sides to see level of soup, should reach just to top of rice, don’t worry, this doesn’t have to be exact. Now you’re ready to make the sauce and fry the meat to put on top.\r\nTo prepare red sauce: In a pan, add a little oil or butter, crushed tomato, a half teaspoon of tomato paste, salt & pepper, 2 cloves of fresh crushed garlic and cumin. Add also approximately 3 tablespoons of vinegar, stir this until you smell aroma and it is a bit smooth. It should be a bit thick, not watery, but if too thick you can add a bit of water. Spread with a wooden spoon atop the rice to cover.\r\nTo fry meat: In a pan add a bit of butter or oil, the meat, just a touch of tomato paste, about a tablespoon of fresh crushed garlic, salt & pepper, a teaspoon of cumin. Cook until meat is golden fried.\r\nSpoon this atop the rice and serve. Enjoy!",
   "image": "https://www.themealdb.com/images/media/meals/rlwcc51598734603.jpg"
  },
  {
   "id": "52998",
   "name": "Corned Beef and Cabbage",
   "ingredients": [
    "Beef Brisket",
    "Small Potatoes",
    "Carrots",
    "Cabbage"
   ],
   "preparation": "1\r\n\r\nPlace corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound or until tender.\r\n\r\n2\r\n\r\nAdd whole potatoes and peeled and cut carrots, and cook until the vegetables are almost tender. Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.\r\n\r\n3\r\n\r\nPlace vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain.",
   "image": "https://www.themealdb.com/images/media/meals/xb97a81583266727.jpg"
  },
  {
   "id": "52901",
   "name": "Rock Cakes",
   "ingredients": [
    "Self-raising Flour",
    "Caster Sugar",
    "Baking Powder",
    "Butter",
    "Dried Fruit",
    "Eggs",
    "Milk",
    "Vanilla Extract"
   ],
   "preparation": "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.\r\nMix the flour, sugar and baking powder in a bowl and rub in the cubed butter until the mixture looks like breadcrumbs, then mix in the dried fruit.\r\nIn a clean bowl, beat the egg and milk together with the vanilla extract.\r\nAdd the egg mixture to the dry ingredients and stir with a spoon until the mixture just comes together as a thick, lumpy dough. Add a teaspoon more milk if you really need it to make the mixture stick together.\r\nPlace golfball-sized spoons of the mixture onto the prepared baking tray. Leave space between them as they will flatten and spread out to double their size during baking.\r\nBake for 15-20 minutes, until golden-brown. Remove from the oven, allow to cool for a couple of minutes then turn them out onto a wire rack to cool.",
   "image": "https://www.themealdb.com/images/media/meals/tqrrsq1511723764.jpg"
  },
  {
   "id": "52993",
   "name": "Honey Balsamic Chicken with Crispy Broccoli & Potatoes",
   "ingredients": [
    "Potatoes",
    "Broccoli",
    "Garlic",
    "Chicken Breast",
    "Balsamic Vinegar",
    "Honey",
    "Chicken Stock",
    "Butter",
    "Vegetable Oil",
    "Olive Oil"
   ],
   "preparation": "2 Servings\r\n\r\n1. Preheat oven to 425 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Toss on one side of a baking sheet with a drizzle of oil, salt, and pepper. (For 4 servings, spread potatoes out across entire sheet.) Roast on top rack for 5 minutes (we'll add the broccoli then). \r\n\r\n2. Meanwhile, cut broccoli florets into bite-size pieces, if necessary. Peel and finely chop garlic. In a small microwave-safe bowl, combine 1 TBSP olive oil (2 TBSP for 4 servings) and half the garlic. Microwave until garlic sizzles, 30 seconds. \r\n\r\n3. Once potatoes have roasted 5 minutes, remove sheet from oven and add broccoli to empty side; carefully toss with garlic oil, salt, and pepper. (For 4 servings, add broccoli to a second sheet.) Continue roasting until potatoes and broccoli are browned and crispy, 15-20 minutes more. \r\n\r\n4. While veggies roast, pat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. (If chicken browns too quickly, reduce heat to medium.) Turn off heat; set chicken aside to rest. Wash out pan. \r\n\r\n5. Heat pan used for chicken over medium-high heat. Add a drizzle of oil and remaining garlic; cook until fragrant, 30 seconds. Stir in vinegar, honey, stock concentrate, and 1/4 cup water (1/3 cup for 4 servings). Simmer until thick and glossy, 2-3 minutes. Remove from heat and stir in 1 TBSP butter (2 TBSP for 4). Season with salt and pepper. \r\n\r\n6. Return chicken to pan and turn to coat in glaze. Divide chicken, broccoli, and potatoes between plates. Spoon any remaining glaze over chicken and serve. ",
   "image": "https://www.themealdb.com/images/media/meals/kvbotn1581012881.jpg"
  },
  {
   "id": "52957",
   "name": "Fruit and Cream Cheese Breakfast Pastries",
   "ingredients": [
    "Cream Cheese",
    "Sugar",
    "Vanilla Extract",
    "Flour",
    "Puff Pastry",
    "Strawberries",
    "Raspberries",
    "Blackberries"
   ],
   "preparation": "Preheat oven to 400ºF (200ºC), and prepare two cookie sheets with parchment paper. In a bowl, mix cream cheese, sugar, and vanilla until fully combined. Lightly flour the surface and roll out puff pastry on top to flatten. Cut each sheet of puff pastry into 9 equal squares. On the top right and bottom left of the pastry, cut an L shape approximately ½ inch (1 cm) from the edge.\r\nNOTE: This L shape should reach all the way down and across the square, however both L shapes should not meet at the ends. Your pastry should look like a picture frame with two corners still intact.\r\nTake the upper right corner and fold down towards the inner bottom corner. You will now have a diamond shape.\r\nPlace 1 to 2 teaspoons of the cream cheese filling in the middle, then place berries on top.\r\nRepeat with the remaining pastry squares and place them onto the parchment covered baking sheet.\r\nBake for 15-20 minutes or until pastry is golden brown and puffed.\r\nEnjoy!\r\n",
   "image": "https://www.themealdb.com/images/media/meals/1543774956.jpg"
  },
  {
   "id": "53076",
   "name": "Bread omelette",
   "ingredients": [
    "Bread",
    "Egg",
    "Salt"
   ],
   "preparation": "Make and enjoy",
   "image": "https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg"
  },
  {
   "id": "52882",
   "name": "Three Fish Pie",
   "ingredients": [
    "Potatoes",
    "Butter",
    "Milk",
    "Gruyère",
    "Butter",
    "Leek",
    "Plain Flour",
    "White Wine",
    "Milk",
    "Parsley",
    "Salmon",
    "Haddock",
    "Smoked Haddock",
    "Eggs"
   ],
   "preparation": "Preheat the oven to 200C/400F/Gas 6 (180C fan).\r\nPut the potatoes into a saucepan of cold salted water. Bring up to the boil and simmer until completely tender. Drain well and then mash with the butter and milk. Add pepper and taste to check the seasoning. Add salt and more pepper if necessary.\r\nFor the fish filling, melt the butter in a saucepan, add the leeks and stir over the heat. Cover with a lid and simmer gently for 10 minutes, or until soft. Measure the flour into a small bowl. Add the wine and whisk together until smooth.\r\nAdd the milk to the leeks, bring to the boil and then add the wine mixture. Stir briskly until thickened. Season and add the parsley and fish. Stir over the heat for two minutes, then spoon into an ovenproof casserole. Scatter over the eggs. Allow to cool until firm.\r\nSpoon the mashed potatoes over the fish mixture and mark with a fork. Sprinkle with cheese.\r\nBake for 30-40 minutes, or until lightly golden-brown on top and bubbling around the edges.",
   "image": "https://www.themealdb.com/images/media/meals/spswqs1511558697.jpg"
  },
  {
   "id": "52902",
   "name": "Parkin Cake",
   "ingredients": [
    "Butter",
    "Egg",
    "Milk",
    "Golden Syrup",
    "Black Treacle",
    "Brown Sugar",
    "Oatmeal",
    "Self-raising Flour",
    "Ground Ginger"
   ],
   "preparation": "Heat oven to 160C/140C fan/gas 3. Grease a deep 22cm/9in square cake tin and line with baking parchment. Beat the egg and milk together with a fork.\r\n\r\nGently melt the syrup, treacle, sugar and butter together in a large pan until the sugar has dissolved. Remove from the heat. Mix together the oatmeal, flour and ginger and stir into the syrup mixture, followed by the egg and milk.\r\n\r\nPour the mixture into the tin and bake for 50 mins - 1 hr until the cake feels firm and a little crusty on top. Cool in the tin then wrap in more parchment and foil and keep for 3-5 days before eating if you can – it’ll become softer and stickier the longer you leave it, up to 2 weeks.\r\n",
   "image": "https://www.themealdb.com/images/media/meals/qxuqtt1511724269.jpg"
  },
  {
   "id": "52950",
   "name": "Szechuan Beef",
   "ingredients": [
    "Beef",
    "Salt",
    "Sesame Seed Oil",
    "Pepper",
    "Egg White",
    "Starch",
    "Oil",
    "Ginger",
    "Garlic",
    "Onion",
    "Carrots",
    "Green Pepper",
    "Celery",
    "Mushrooms",
    "Cooking wine",
    "Water",
    "Oyster Sauce",
    "Hotsauce",
    "Sugar",
    "Soy Sauce"
   ],
   "preparation": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.\r\nSTEP 2 - STIR FRY\r\nFirst Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.\r\nSet the beef aside\r\nIn a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.\r\nNext add all of the vegetables and then add sherry cooking wine and 1 cup of water.\r\nTo make the sauce add oyster sauce, hot pepper sauce, and sugar.\r\nadd the cooked beef and 1 spoon of soy sauce\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
   "image": "https://www.themealdb.com/images/media/meals/1529443236.jpg"
  },
  {
   "id": "52836",
   "name": "Seafood fideuà",
   "ingredients": [
    "Mussels",
    "Prawns",
    "Saffron",
    "Vermicelli",
    "Olive Oil",
    "Onions",
    "Garlic",
    "Paprika",
    "Monkfish",
    "Baby Squid",
    "Fish Stock",
    "Tomatoes",
    "Lemon",
    "Parsley"
   ],
   "preparation": "Boil the kettle. Empty the mussels into a colander and run under cold water. Throw away any with broken shells. Pick through the shells, tapping each one on the side of the sink – they should be closed or should slowly close when tapped – if they stay open, throw them away. If any of the shells still have barnacles or stringy beards attached, pull them off with a cutlery knife and rinse the shells well. Keep in the colander, covered with a cold, damp cloth, until you’re ready to cook. Peel the prawn shells on the body section only – leave the heads and tails intact. Score down the backs and pull out any gritty entrails. Chill until you’re ready to cook.\r\nPut the saffron in a small cup, cover with 50ml kettle-hot water and set aside for 10 mins. If using vermicelli, put in a bowl and crush to little pieces (about 1cm long) with your hands.\r\nHeat the oil in a large frying pan with at least a 3cm lip, or a 40cm paella pan. Add the onion and stir around the pan for 5 mins until soft. Add the garlic and cook for 1 min more, then tip in the vermicelli and cook for 5 mins, stirring from time to time, until the vermicelli is toasted brown. Stir in the paprika.\r\nKeeping the heat moderate, stir through the monkfish, squid and saffron with its water, seasoning well. Spread the ingredients out in an even layer, then pour over the hot stock and scatter the tomatoes on top. Bring to a simmer, then cover the whole dish with a tight-fitting lid (or foil). Turn the heat to medium and cook for 6 mins.\r\nUncover and stir to incorporate the dry top layer of pasta. Push the mussels into the pasta so the hinges are buried in the bottom of the dish, and they stand straight up. Arrange the prawns on top, cover tightly and cook for another 6 mins or until the mussels are open, the prawns are pink and the pasta is cooked through. Leave to simmer for another 2-3 mins to cook off most of the remaining liquid (leave a little in the pan to prevent the pasta from sticking together). Allow to sit for 2-3 mins, then squeeze over the lemon juice and arrange the wedges on top. Scatter with parsley before serving.",
   "image": "https://www.themealdb.com/images/media/meals/wqqvyq1511179730.jpg"
  },
  {
   "id": "52866",
   "name": "Squash linguine",
   "ingredients": [
    "Butternut Squash",
    "Garlic",
    "Olive Oil",
    "Linguine Pasta",
    "Sage"
   ],
   "preparation": "Heat oven to 200C/180C fan/gas 6. Put the squash and garlic on a baking tray and drizzle with the olive oil. Roast for 35-40 mins until soft. Season.\r\nCook the pasta according to pack instructions. Drain, reserving the water. Use a stick blender to whizz the squash with 400ml cooking water. Heat some oil in a frying pan, fry the sage until crisp, then drain on kitchen paper. Tip the pasta and sauce into the pan and warm through. Scatter with sage.",
   "image": "https://www.themealdb.com/images/media/meals/wxswxy1511452625.jpg"
  },
  {
   "id": "52883",
   "name": "Sticky Toffee Pudding",
   "ingredients": [
    "Butter",
    "Muscovado Sugar",
    "Eggs",
    "Self-raising Flour",
    "Baking Powder",
    "Bicarbonate Of Soda",
    "Black Treacle",
    "Milk",
    "Double Cream",
    "Butter",
    "Muscovado Sugar",
    "Black Treacle",
    "Double Cream",
    "Vanilla Extract"
   ],
   "preparation": "Preheat the oven to 180C/160C Fan/Gas 4. Butter a wide shallow 1.7-litre/3-pint ovenproof dish.\r\nPut the butter, sugar, eggs, flour, baking powder, bicarbonate of soda and treacle into a mixing bowl. Beat using an electric handheld whisk for about 30 seconds or until combined. Pour in the milk gradually and whisk again until smooth. Pour into the prepared dish. Bake for 35–40 minutes or until well risen and springy in the centre.\r\nTo make the sauce, put all the ingredients into a saucepan and stir over a low heat until the sugar has dissolved and the butter has melted. Bring to the boil, stirring for a minute.\r\nTo serve, pour half the sauce over the pudding in the baking dish. Serve with the cream or ice cream.",
   "image": "https://www.themealdb.com/images/media/meals/xqqqtu1511637379.jpg"
  },
  {
   "id": "53028",
   "name": "Shawarma",
   "ingredients": [
    "Chicken Thighs",
    "Coriander",
    "Cumin",
    "Cardamom",
    "Cayenne Pepper",
    "Paprika",
    "Lemon Juice",
    "Olive Oil",
    "Greek Yogurt",
    "Garlic Clove",
    "Cumin",
    "Lemon Juice",
    "Lettuce",
    "Tomato",
    "Pita Bread"
   ],
   "preparation": "Combine the marinade ingredients in a large ziplock bag (or bowl).\r\nAdd the chicken and use your hands to make sure each piece is coated. If using a ziplock bag, I find it convenient to close the bag then massage the bag to disperse the rub all over each chicken piece.\r\nMarinate overnight or up to 24 hours.\r\nCombine the Yoghurt Sauce ingredients in a bowl and mix. Cover and put in the fridge until required (it will last for 3 days in the fridge).\r\nHeat grill/BBQ (or large heavy based pan on stove) on medium high. You should not need to oil it because the marinade has oil in it and also thigh fillets have fat. But if you are worried then oil your hotplate/grill. (See notes for baking)\r\nPlace chicken on the grill and cook the first side for 4 to 5 minutes until nicely charred, then turn and cook the other side for 3 to 4 minutes (the 2nd side takes less time).\r\nRemove chicken from the grill and cover loosely with foil. Set aside to rest for 5 minutes.\r\nTO SERVE\r\nSlice chicken and pile onto platter alongside flatbreads, Salad and the Yoghurt Sauce.\r\nTo make a wrap, get a piece of flatbread and smear with Yoghurt Sauce. Top with a bit of lettuce and tomato and Chicken Shawarma. Roll up and enjoy!",
   "image": "https://www.themealdb.com/images/media/meals/kcv6hj1598733479.jpg"
  },
  {
   "id": "52997",
   "name": "Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber",
   "ingredients": [
    "Rice",
    "Onion",
    "Lime",
    "Garlic Clove",
    "Cucumber",
    "Carrots",
    "Ground Beef",
    "Soy Sauce"
   ],
   "preparation": "Add'l ingredients: mayonnaise, siracha\r\n\r\n1\r\n\r\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r\n\r\n2\r\n\r\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r\n\r\n3\r\n\r\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r\n\r\n5\r\n\r\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.",
   "image": "https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg"
  },
  {
   "id": "52875",
   "name": "Chicken Ham and Leek Pie",
   "ingredients": [
    "Chicken Stock",
    "Chicken Breast",
    "Butter",
    "Leek",
    "Garlic",
    "Plain Flour",
    "Milk",
    "White Wine",
    "Double Cream",
    "Ham",
    "Sea Salt",
    "Pepper",
    "Plain Flour",
    "Butter",
    "Free-range Egg, Beaten",
    "Cold Water",
    "Free-range Egg, Beaten"
   ],
   "preparation": "Heat the chicken stock in a lidded saucepan. Add the chicken breast and bring to a low simmer. Cover with a lid and cook for 10 minutes. Remove the chicken breasts from the water with tongs and place on a plate. Pour the cooking liquor into a large jug.\r\nMelt 25g/1oz of the butter in a large heavy-based saucepan over a low heat. Stir in the leeks and fry gently for two minutes, stirring occasionally until just softened. Add the garlic and cook for a further minute. Add the remaining butter and stir in the flour as soon as the butter has melted. Cook for 30 seconds, stirring constantly.\r\nSlowly pour the milk into the pan, just a little at a time, stirring well between each adding. Gradually add 250ml/10fl oz of the reserved stock and the wine, if using, stirring until the sauce is smooth and thickened slightly. Bring to a gentle simmer and cook for 3 minutes.\r\nSeason the mixture, to taste, with salt and freshly ground black pepper. Remove from the heat and stir in the cream. Pour into a large bowl and cover the surface of the sauce with cling ilm to prevent a skin forming. Set aside to cool.\r\nPreheat the oven to 200C/400F/Gas 6. Put a baking tray in the oven to heat.\r\nFor the pastry, put the flour and butter in a food processor and blend on the pulse setting until the mixture resembles fine breadcrumbs. With the motor running, add the beaten egg and water and blend until the mixture forms a ball. Portion off 250g/10oz of pastry for the lid.\r\nRoll the remaining pastry out on a lightly floured surface, turning the pastry frequently until around 5mm/¼in thick and 4cm/1½in larger than the pie dish. Lift the pastry over the rolling pin and place it gently into the pie dish. Press the pastry firmly up the sides, making sure there are no air bubbles. Leave the excess pastry overhanging the sides.\r\nCut the chicken breasts into 3cm/1¼in pieces. Stir the chicken, ham and leeks into the cooled sauce. Pour the chicken filling into the pie dish. Brush the rim of the dish with beaten egg. Roll out the reserved pastry for the lid.\r\nCover the pie with the pastry lid and press the edges together firmly to seal. Trim any excess pastry.\r\nMake a small hole in the centre of the pie with the tip of a knife. Glaze the top of the pie with beaten egg. Bake on the preheated tray in the centre of the oven for 35-40 minutes or until the pie is golden-brown all over and the filling is piping hot.",
   "image": "https://www.themealdb.com/images/media/meals/xrrtss1511555269.jpg"
  },
  {
   "id": "52809",
   "name": "Recheado Masala Fish",
   "ingredients": [
    "Mackerel",
    "Red Chili",
    "Ginger",
    "Garlic",
    "Pepper",
    "Cumin",
    "Turmeric",
    "Cinnamon stick",
    "Clove",
    "Cardamom",
    "Sugar",
    "Tamarind ball",
    "Vinegar",
    "Oil"
   ],
   "preparation": "Soak all the spices, ginger, garlic, tamarind pulp and kashmiri chilies except oil in vinegar.\r\nAdd sugar and salt.\r\nAlso add turmeric powder.\r\nCombine all nicely and marinate for 35-40 mins.\r\nGrind the mixture until soft and smooth. Add more vinegar if required but ensure the paste has to be thick so add vinegar accordingly. If the masala paste is thin then it would not stick to the fish.\r\nRinse the fish slit from the center and give some incision from the top. You could see the fish below for clarity.\r\nNow stuff the paste into the center and into the incision. Coat the entire fish with this paste. Marinate the fish for 30 mins.\r\nPlace oil in a shallow pan, once oil is quite hot shallow fry the stuffed mackerels.\r\nFry until golden brown from both sides\r\nServe the recheado mackerels hot with salad, lime wedges, rice and curry.\r\nNotes\r\n1. Ensure the masala paste is thick else the result won't be good.\r\n2. If you aren't able to find kashmiri chilies then use bedgi chilies or kashmiri red chili powder.\r\n3. You could use white vinegar or coconut vinegar.\r\n4. Any left over paste could be stored in the fridge for future use.\r\n5. Cinnamon could be avoided as it's a strong spice used generally for meat or chicken.",
   "image": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg"
  },
  {
   "id": "52822",
   "name": "Toad In The Hole",
   "ingredients": [
    "sausages",
    "vegetable oil",
    "plain flour",
    "eggs",
    "horseradish",
    "milk",
    "cherry tomatoes"
   ],
   "preparation": "Preheat the oven to 200°C/fan180°C/gas 6. fry sausages in a non-stick pan until browned.\r\nDrizzle vegetable oil in a 30cm x 25cm x 6cm deep roasting tray and heat in the oven for 5 minutes.\r\nPut the plain flour in a bowl, crack in the medium free-range eggs, then stir in the grated horseradish. Gradually beat in the semi-skimmed milk. Season.\r\nPut the sausages into the hot roasting tray and pour over the batter. Top with cherry tomatoes on the vine and cook for 30 minutes until puffed and golden.",
   "image": "https://www.themealdb.com/images/media/meals/ytuvwr1503070420.jpg"
  },
  {
   "id": "52832",
   "name": "Coq au vin",
   "ingredients": [
    "Olive Oil",
    "Bacon",
    "Shallots",
    "Chicken Legs",
    "Chicken Thighs",
    "Chicken Breasts",
    "Garlic",
    "Brandy",
    "Red Wine",
    "Chicken Stock",
    "tomato puree",
    "thyme",
    "Rosemary",
    "bay leaves",
    "parsley",
    "chestnut mushroom",
    "plain flour",
    "butter"
   ],
   "preparation": "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.\r\nPat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.\r\nScatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.\r\nReturn the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.\r\nJust before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.\r\nLift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley.",
   "image": "https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg"
  },
  {
   "id": "52771",
   "name": "Spicy Arrabiata Penne",
   "ingredients": [
    "penne rigate",
    "olive oil",
    "garlic",
    "chopped tomatoes",
    "red chilli flakes",
    "italian seasoning",
    "basil",
    "Parmigiano-Reggiano"
   ],
   "preparation": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.\r\nIn a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.\r\nDrain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
   "image": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg"
  },
  {
   "id": "52885",
   "name": " Bubble & Squeak",
   "ingredients": [
    "Butter",
    "Bacon",
    "Onion",
    "Garlic Clove",
    "Brussels Sprouts",
    "Potatoes"
   ],
   "preparation": "Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins.\r\nNext, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve.",
   "image": "https://www.themealdb.com/images/media/meals/xusqvw1511638311.jpg"
  },
  {
   "id": "52850",
   "name": "Chicken Couscous",
   "ingredients": [
    "Olive Oil",
    "Onion",
    "Chicken Breast",
    "Ginger",
    "Harissa Spice",
    "Dried Apricots",
    "Chickpeas",
    "Couscous",
    "Chicken Stock",
    "Coriander"
   ],
   "preparation": "Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r\n\r\nTip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like.",
   "image": "https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg"
  },
  {
   "id": "52905",
   "name": "Chocolate Souffle",
   "ingredients": [
    "Single Cream",
    "Caster Sugar",
    "Dark Chocolate",
    "Butter",
    "Butter",
    "Caster Sugar",
    "Dark Chocolate",
    "Double Cream",
    "Egg Yolks",
    "Egg White",
    "Double Cream",
    "Icing Sugar"
   ],
   "preparation": "Heat oven to 220C/fan 200C/gas 7 and place a baking tray on the top shelf. For the sauce, heat the cream and sugar until boiling. Remove from the heat, stir in the chocolate and butter until melted, then keep warm.\r\nBrush 6 x 150ml ramekins with melted butter, sprinkle with the 2 tbsp caster sugar, then tip out any excess. Melt the chocolate and cream in a bowl over a pan of simmering water, cool, then mix in the egg yolks. Whisk the egg whites until they hold their shape, then add the sugar, 1 tbsp at a time, whisking back to the same consistency. Mix a spoonful into the chocolate, then gently fold in the rest.\r\nWorking quickly, fill the ramekins, wipe the rims clean and run your thumb around the edges. Turn oven down to 200C/fan 180C/gas 6, place the ramekins onto the baking tray, then bake for 8-10 mins until risen with a slight wobble. Don’t open the oven door too early as this may make them collapse.\r\nOnce the soufflés are ready, dust with icing sugar, scoop a small hole from their tops, then pour in some of the hot chocolate sauce. Replace the lids and serve straight away.",
   "image": "https://www.themealdb.com/images/media/meals/twspvx1511784937.jpg"
  },
  {
   "id": "52868",
   "name": "Kidney Bean Curry",
   "ingredients": [
    "Vegetable Oil",
    "Onion",
    "Garlic",
    "Ginger",
    "Coriander",
    "Cumin",
    "Paprika",
    "Garam Masala",
    "Chopped Tomatoes",
    "Kidney Beans",
    "Basmati Rice"
   ],
   "preparation": "Heat the oil in a large frying pan over a low-medium heat. Add the onion and a pinch of salt and cook slowly, stirring occasionally, until softened and just starting to colour. Add the garlic, ginger and coriander stalks and cook for a further 2 mins, until fragrant.\r\n\r\nAdd the spices to the pan and cook for another 1 min, by which point everything should smell aromatic. Tip in the chopped tomatoes and kidney beans in their water, then bring to the boil.\r\n\r\nTurn down the heat and simmer for 15 mins until the curry is nice and thick. Season to taste, then serve with the basmati rice and the coriander leaves.",
   "image": "https://www.themealdb.com/images/media/meals/sywrsu1511463066.jpg"
  },
  {
   "id": "52932",
   "name": "Pouding chomeur",
   "ingredients": [
    "Butter",
    "Sugar",
    "Eggs",
    "Vanilla Extract",
    "Flour",
    "Baking Powder",
    "Milk",
    "Maple Syrup",
    "Brown Sugar",
    "Single Cream",
    "Butter"
   ],
   "preparation": "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light.\r\nAdd eggs and vanilla and mix.\r\nIn another bowl, mix flour and baking powder.\r\nAlternate flour mix and milk to the butter mix.\r\nPour into a 13 inch by 9 inch greased pan.\r\nMAPLE SAUCE.\r\nIn a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir.\r\nReduce heat and and gently cook 2 minutes or till sauce has reduced a little bit.\r\nPour sauce gently over cake.\r\nBake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean.",
   "image": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg"
  },
  {
   "id": "52827",
   "name": "Massaman Beef curry",
   "ingredients": [
    "Peanuts",
    "Coconut cream",
    "Massaman curry paste",
    "Beef",
    "Potatoes",
    "Onion",
    "Lime",
    "Cinnamon stick",
    "Tamarind paste",
    "Brown sugar",
    "Fish Sauce",
    "chilli",
    "Jasmine Rice"
   ],
   "preparation": "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.\r\nHeat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.\r\nSprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice.",
   "image": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg"
  },
  {
   "id": "52794",
   "name": "Vegan Chocolate Cake",
   "ingredients": [
    "self raising flour",
    "coco sugar",
    "cacao",
    "baking powder",
    "flax eggs",
    "almond milk",
    "vanilla",
    "water"
   ],
   "preparation": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
   "image": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg"
  },
  {
   "id": "53027",
   "name": "Koshari",
   "ingredients": [
    "Brown Lentils",
    "Rice",
    "Coriander",
    "Macaroni",
    "Chickpeas",
    "Onion",
    "Salt",
    "Vegetable Oil"
   ],
   "preparation": "Cook the lentils. Bring lentils and 4 cups of water to a boil in a medium pot or saucepan over high heat. Reduce the heat to low and cook until lentils are just tender (15-17 minutes). Drain from water and season with a little salt. (Note: when the lentils are ready, they should not be fully cooked. They should be only par-cooked and still have a bite to them as they need to finish cooking with the rice).\r\nNow, for the rice. Drain the rice from its soaking water. Combine the par-cooked lentils and the rice in the saucepan over medium-high heat with 1 tbsp cooking oil, salt, pepper, and coriander. Cook for 3 minutes, stirring regularly. Add warm water to cover the rice and lentil mixture by about 1 1/2 inches (you’ll probably use about 3 cups of water here). Bring to a boil; the water should reduce a bit. Now cover and cook until all the liquid has been absorbed and both the rice and lentils are well cooked through (about 20 minutes).  Keep covered and undisturbed for 5 minutes or so.\r\nNow make the pasta. While the rice and lentils are cooking, make the pasta according to package instructions by adding the elbow pasta to boiling water with a dash of salt and a little oil. Cook until the pasta is al dente. Drain.\r\nCover the chickpeas and warm in the microwave briefly before serving.\r\n\r\nMake the crispy onion topping. \r\n\r\nSprinkle the onion rings with salt, then toss them in the flour to coat. Shake off excess flour.\r\nIn a large skillet, heat the cooking oil over medium-high heat, cook the onion rings, stirring often, until they turn a nice caramelized brown. Onions must be crispy, but not burned (15-20 minutes).",
   "image": "https://www.themealdb.com/images/media/meals/4er7mj1598733193.jpg"
  },
  {
   "id": "52959",
   "name": "Baked salmon with fennel & tomatoes",
   "ingredients": [
    "Fennel",
    "Parsley",
    "Lemon",
    "Cherry Tomatoes",
    "Olive Oil",
    "Salmon",
    "Black Olives"
   ],
   "preparation": "Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.\r\n\r\nSpread the drained fennel over a shallow ovenproof dish, then add the tomatoes. Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve.",
   "image": "https://www.themealdb.com/images/media/meals/1548772327.jpg"
  },
  {
   "id": "52847",
   "name": "Pork Cassoulet",
   "ingredients": [
    "Goose Fat",
    "Pork",
    "Onion",
    "Garlic",
    "Carrots",
    "Fennel Seeds",
    "Red Wine Vinegar",
    "Vegetable Stock",
    "Tomato Puree",
    "Rosemary",
    "Parsley",
    "Haricot Beans",
    "Breadcrumbs",
    "Oil",
    "Bread",
    "Broccoli"
   ],
   "preparation": "Heat oven to 140C/120C fan/gas 1. Put a large ovenproof pan (with a tight-fitting lid) on a high heat. Add your fat and diced meat, cook for a few mins to seal the edges, giving it a quick stir to cook evenly. Reduce the heat to low, add the sliced onion, whole garlic cloves, carrot and fennel seeds, and cook gently to soften the veg for a few mins.\r\nPour over the red wine vinegar, scraping any meaty bits off the bottom of the pan. Add the stock, tomato purée, and half the rosemary and parsley. Bring to the boil and simmer for 10 mins, then season, cover with a lid and put into the oven for 2 hrs, removing the lid for the final hour of cooking. Stir occasionally and add the beans with 30 mins to go.\r\nRemove the pan from the oven and heat the grill. Scatter the top with the remaining herbs and breadcrumbs, drizzle a little oil over the top, and return to the oven for 5-10 mins, until the breadcrumbs are golden. Serve with crusty bread and green veg.",
   "image": "https://www.themealdb.com/images/media/meals/wxuvuv1511299147.jpg"
  },
  {
   "id": "52915",
   "name": "French Omelette",
   "ingredients": [
    "Eggs",
    "Butter",
    "Parmesan",
    "Tarragon",
    "Parsley",
    "Chives",
    "Gruyère"
   ],
   "preparation": "Get everything ready. Warm a 20cm (measured across the top) non-stick frying pan on a medium heat. Crack the eggs into a bowl and beat them with a fork so they break up and mix, but not as completely as you would for scrambled egg. With the heat on medium-hot, drop one knob of butter into the pan. It should bubble and sizzle, but not brown. Season the eggs with the Parmesan and a little salt and pepper, and pour into the pan.\r\nLet the eggs bubble slightly for a couple of seconds, then take a wooden fork or spatula and gently draw the mixture in from the sides of the pan a few times, so it gathers in folds in the centre. Leave for a few seconds, then stir again to lightly combine uncooked egg with cooked. Leave briefly again, and when partly cooked, stir a bit faster, stopping while there’s some barely cooked egg left. With the pan flat on the heat, shake it back and forth a few times to settle the mixture. It should slide easily in the pan and look soft and moist on top. A quick burst of heat will brown the underside.\r\nGrip the handle underneath. Tilt the pan down away from you and let the omelette fall to the edge. Fold the side nearest to you over by a third with your fork, and keep it rolling over, so the omelette tips onto a plate – or fold it in half, if that’s easier. For a neat finish, cover the omelette with a piece of kitchen paper and plump it up a bit with your fingers. Rub the other knob of butter over to glaze. Serve immediately.",
   "image": "https://www.themealdb.com/images/media/meals/yvpuuy1511797244.jpg"
  },
  {
   "id": "53082",
   "name": "Strawberries Romanoff",
   "ingredients": [
    "Strawberries",
    "Sugar",
    "Grand Marnier",
    "Cream",
    "Sour Cream"
   ],
   "preparation": "In a medium bowl, combine hulled and quartered strawberries, 4 Tbsp sugar and 4 Tbsp liqueur, stir to combine then cover and refrigerate at least 1 hour and up to 2 hours, stirring once or twice.\r\n\r\nTwo photos of cut strawberries in a bowl with one having sugar being added to the bowl Two photos of cut up strawberries for Strawberry Romanoff \r\n\r\nJust before serving, in a large mixing bowl, combine 1 cup cold heavy cream and 1/4 cup powdered sugar, and beat with an electric mixer until stiff peaks form. Using a spatula, fold in 1/4 cup sour cream just until well blended.\r\n\r\nTo serve, stir strawberries then divide between 6 serving glasses or bowls. You can spoon a little syrup over the berries if you like. You can also use this syrup to soak a cake. Spoon cream over strawberries, dividing evenly. You can also use an ice cream scoop with trigger release for a nice rounded puff of cream. Serve right away or chill and enjoy within 2 hours of assembly.\r\n\r\n",
   "image": "https://www.themealdb.com/images/media/meals/oe8rg51699014028.jpg"
  },
  {
   "id": "53052",
   "name": "Roti john",
   "ingredients": [
    "Minced Beef",
    "Onion",
    "Eggs",
    "Chilli",
    "Baguette",
    "Salt",
    "Pepper",
    "Mayonnaise"
   ],
   "preparation": "Mix all the ingredients in a bowl.\r\nHeat a pan or griddle with a little vegetable oil.\r\nPour the mixture onto the pan and place a piece of open-faced baguette on top.\r\nPress on the bread with a spatula and grill for 2 minutes.\r\nTurn the bread over to make it a little crispy.\r\nRemove from pan and cut the bread into small portions.\r\nAdd mayonnaise and/or Sambal before cutting the sandwich (optional).",
   "image": "https://www.themealdb.com/images/media/meals/hx335q1619789561.jpg"
  },
  {
   "id": "52926",
   "name": "Tourtiere",
   "ingredients": [
    "Potatoes",
    "Sunflower Oil",
    "Minced Pork",
    "Onion",
    "Garlic Clove",
    "Cinnamon",
    "Allspice",
    "Nutmeg",
    "Vegetable Stock",
    "Shortcrust Pastry",
    "Egg"
   ],
   "preparation": "Heat oven to 200C/180C fan/gas 6. Boil the potato until tender, drain and mash, then leave to cool. Heat the oil in a non-stick pan, add the mince and onion and quickly fry until browned. Add the garlic, spices, stock, plenty of pepper and a little salt and mix well. Remove from the heat, stir into the potato and leave to cool.\r\nRoll out half the pastry and line the base of a 20-23cm pie plate or flan tin. Fill with the pork mixture and brush the edges of the pastry with water. Roll out the remaining dough and cover the pie. Press the edges of the pastry to seal, trimming off the excess. Prick the top of the pastry case to allow steam to escape and glaze the top with the beaten egg.\r\nBake for 30 mins until the pastry is crisp and golden. Serve cut into wedges with a crisp green salad. Leftovers are good cold for lunch the next day, served with a selection of pickles.",
   "image": "https://www.themealdb.com/images/media/meals/ytpstt1511814614.jpg"
  },
  {
   "id": "53031",
   "name": "Egyptian Fatteh",
   "ingredients": [
    "Beef",
    "Onion",
    "Chicken Stock Cube",
    "Tomatoes",
    "Garlic Clove",
    "Tomato Puree",
    "Rice",
    "Noodles",
    "Butter",
    "Olive Oil",
    "Pita Bread",
    "Cumin",
    "White Wine Vinegar",
    "Salt",
    "Pepper"
   ],
   "preparation": "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan, add about a 1/4 stick of butter, add bread pieces and fry until golden brown and crisp. Put these pieces in a glass baking dish, preferably a square sized dish. Set aside.\r\nThen add to same pan, a little more butter, salt, approximately 2 cloves of crushed fresh garlic, and a teaspoon or so of cumin stir around a bit until you can smell aroma, then add fried bread pieces to this mixture, stir to coat bread and put back into glass baking dish. Set aside.\r\nTo prepare meat: put some butter in a pot, stir fry meat until brown, add 1 onion quartered, salt & pepper, 1 cube of chicken bouillon and water to cover meat. Bring to a boil, turn down to simmer, cover and cook until tender, approximately 2 hours. After meat has cooled, take out chunks of meat and put in a bowl, set aside. Reserve soup from the meat separately.\r\nTo prepare the rice: Put some butter into a pot, add shareya (fideo noodles) like a handful or so, keep stirring until golden brown, not too dark, but very golden. Then add two cups of rice, stir a little bit until some of the rice turns an opaque white. Add 2-1/4 cups of water and salt to taste. Bring to a boil, cover and turn down to simmer, cook until tender. Test the rice tenderness after about 35 minutes.\r\nNow take some of the soup from meat and add to the top of the bread pieces in baking dish to saturate.Add cooked rice on top of bread pieces. Slowly spoon remainder of soup onto rice, looking at glass dish sides to see level of soup, should reach just to top of rice, don’t worry, this doesn’t have to be exact. Now you’re ready to make the sauce and fry the meat to put on top.\r\nTo prepare red sauce: In a pan, add a little oil or butter, crushed tomato, a half teaspoon of tomato paste, salt & pepper, 2 cloves of fresh crushed garlic and cumin. Add also approximately 3 tablespoons of vinegar, stir this until you smell aroma and it is a bit smooth. It should be a bit thick, not watery, but if too thick you can add a bit of water. Spread with a wooden spoon atop the rice to cover.\r\nTo fry meat: In a pan add a bit of butter or oil, the meat, just a touch of tomato paste, about a tablespoon of fresh crushed garlic, salt & pepper, a teaspoon of cumin. Cook until meat is golden fried.\r\nSpoon this atop the rice and serve. Enjoy!",
   "image": "https://www.themealdb.com/images/media/meals/rlwcc51598734603.jpg"
  },
  {
   "id": "53027",
   "name": "Koshari",
   "ingredients": [
    "Brown Lentils",
    "Rice",
    "Coriander",
    "Macaroni",
    "Chickpeas",
    "Onion",
    "Salt",
    "Vegetable Oil"
   ],
   "preparation": "Cook the lentils. Bring lentils and 4 cups of water to a boil in a medium pot or saucepan over high heat. Reduce the heat to low and cook until lentils are just tender (15-17 minutes). Drain from water and season with a little salt. (Note: when the lentils are ready, they should not be fully cooked. They should be only par-cooked and still have a bite to them as they need to finish cooking with the rice).\r\nNow, for the rice. Drain the rice from its soaking water. Combine the par-cooked lentils and the rice in the saucepan over medium-high heat with 1 tbsp cooking oil, salt, pepper, and coriander. Cook for 3 minutes, stirring regularly. Add warm water to cover the rice and lentil mixture by about 1 1/2 inches (you’ll probably use about 3 cups of water here). Bring to a boil; the water should reduce a bit. Now cover and cook until all the liquid has been absorbed and both the rice and lentils are well cooked through (about 20 minutes).  Keep covered and undisturbed for 5 minutes or so.\r\nNow make the pasta. While the rice and lentils are cooking, make the pasta according to package instructions by adding the elbow pasta to boiling water with a dash of salt and a little oil. Cook until the pasta is al dente. Drain.\r\nCover the chickpeas and warm in the microwave briefly before serving.\r\n\r\nMake the crispy onion topping. \r\n\r\nSprinkle the onion rings with salt, then toss them in the flour to coat. Shake off excess flour.\r\nIn a large skillet, heat the cooking oil over medium-high heat, cook the onion rings, stirring often, until they turn a nice caramelized brown. Onions must be crispy, but not burned (15-20 minutes).",
   "image": "https://www.themealdb.com/images/media/meals/4er7mj1598733193.jpg"
  },
  {
   "id": "52780",
   "name": "Potato Gratin with Chicken",
   "ingredients": [
    "Potatoes",
    "Onions",
    "Olive Oil",
    "Chicken Stock",
    "Creme Fraiche",
    "Parmesan",
    "Chicken Breasts",
    "Bacon",
    "Spinach",
    "Peas"
   ],
   "preparation": "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach.",
   "image": "https://www.themealdb.com/images/media/meals/qwrtut1468418027.jpg"
  },
  {
   "id": "52943",
   "name": "Oxtail with broad beans",
   "ingredients": [
    "Oxtail",
    "Onion",
    "Spring Onions",
    "Garlic",
    "Ginger",
    "Scotch Bonnet",
    "Soy Sauce",
    "Fresh Thyme",
    "Vegetable Oil",
    "Water",
    "Broad Beans",
    "Corn Flour",
    "Water"
   ],
   "preparation": "Toss the oxtail with the onion, spring onion, garlic, ginger, chilli, soy sauce, thyme, salt and pepper. Heat the vegetable oil in a large frying pan over medium-high heat. Brown the oxtail in the pan until browned all over, about 10 minutes. Place into a pressure cooker, and pour in 375ml water. Cook at pressure for 25 minutes, then remove from heat, and remove the lid according to manufacturer's directions.\r\nAdd the broad beans and pimento berries, and bring to a simmer over medium-high heat. Dissolve the cornflour in 2 tablespoons water, and stir into the simmering oxtail. Cook and stir a few minutes until the sauce has thickened, and the broad beans are tender.",
   "image": "https://www.themealdb.com/images/media/meals/1520083578.jpg"
  },
  {
   "id": "52911",
   "name": "Summer Pistou",
   "ingredients": [
    "Rapeseed Oil",
    "Leek",
    "Courgettes",
    "Vegetable Stock",
    "Cannellini Beans",
    "Green Beans",
    "Tomatoes",
    "Garlic Clove",
    "Basil",
    "Parmesan"
   ],
   "preparation": "Heat the oil in a large pan and fry the leeks and courgette for 5 mins to soften. Pour in the stock, add three-quarters of the haricot beans with the green beans, half the tomatoes, and simmer for 5-8 mins until the vegetables are tender.\r\nMeanwhile, blitz the remaining beans and tomatoes, the garlic and basil in a food processor (or in a bowl with a stick blender) until smooth, then stir in the Parmesan. Stir the sauce into the soup, cook for 1 min, then ladle half into bowls or pour into a flask for a packed lunch. Chill the remainder. Will keep for a couple of days.",
   "image": "https://www.themealdb.com/images/media/meals/rqtxvr1511792990.jpg"
  },
  {
   "id": "53072",
   "name": "Crispy Eggplant",
   "ingredients": [
    "Egg Plants",
    "Breadcrumbs",
    "Sesame Seed",
    "Eggs",
    "Salt",
    "Pepper",
    "Vegetable Oil"
   ],
   "preparation": "Slice eggplant into 1 cm (0.4-inch) slices. Place them in a bowl and sprinkle them with salt. allow them to sit for 30 minutes to render some of their liquid and bitterness.\r\n2. After 30 minutes wash eggplant slices from salt and pat dry with a kitchen towel.\r\n3. In a large bowl/plate place breadcrumbs and sesame seeds. In another bowl beat 2 eggs with pinch salt and pepper.\r\n4. Heal oil in a large skillet over high heat.\r\n5. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on a paper towel. \r\n",
   "image": "https://www.themealdb.com/images/media/meals/c7lzrl1683208757.jpg"
  },
  {
   "id": "52941",
   "name": "Red Peas Soup",
   "ingredients": [
    "Kidney Beans",
    "Carrots",
    "Spring Onions",
    "Thyme",
    "Onion",
    "Black Pepper",
    "Red Pepper",
    "Garlic Clove",
    "Allspice",
    "Beef",
    "Water",
    "Potatoes",
    "Plain Flour",
    "Water",
    "Coconut Milk"
   ],
   "preparation": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.",
   "image": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg"
  },
  {
   "id": "53026",
   "name": "Tamiya",
   "ingredients": [
    "Broad Beans",
    "Spring Onions",
    "Garlic Clove",
    "Parsley",
    "Cumin",
    "Baking Powder",
    "Cayenne Pepper",
    "Flour",
    "Vegetable Oil"
   ],
   "preparation": "oak the beans in water to cover overnight.Drain. If skinless beans are unavailable, rub to loosen the skins, then discard the skins. Pat the beans dry with a towel.\r\nGrind the beans in a food mill or meat grinder.If neither appliance is available, process them in a food processor but only until the beans form a paste. (If blended too smoothly, the batter tends to fall apart during cooking.) Add the scallions, garlic, cilantro, cumin, baking powder, cayenne, salt, pepper, and coriander, if using.  Refrigerate for at least 30 minutes.\r\nShape the bean mixture into 1-inch balls.Flatten slightly and coat with flour.\r\nHeat at least 1½-inches of oil over medium heat to 365 degrees.\r\nFry the patties in batches, turning once, until golden brown on all sides, about 5 minutes.Remove with a wire mesh skimmer or slotted spoon. Serve as part of a meze or in pita bread with tomato-cucumber salad and tahina sauce.",
   "image": "https://www.themealdb.com/images/media/meals/n3xxd91598732796.jpg"
  },
  {
   "id": "52863",
   "name": "Vegetarian Casserole",
   "ingredients": [
    "Rapeseed Oil",
    "Onion",
    "Garlic",
    "Paprika",
    "Cumin",
    "Thyme",
    "Carrots",
    "Celery",
    "Red Pepper",
    "Yellow Pepper",
    "Tomato",
    "Vegetable Stock Cube",
    "Courgettes",
    "Thyme",
    "Lentils"
   ],
   "preparation": "Heat the oil in a large, heavy-based pan. Add the onions and cook gently for 5 – 10 mins until softened.\r\nAdd the garlic, spices, dried thyme, carrots, celery and peppers and cook for 5 minutes.\r\nAdd the tomatoes, stock, courgettes and fresh thyme and cook for 20 - 25 minutes.\r\nTake out the thyme sprigs. Stir in the lentils and bring back to a simmer. Serve with wild and white basmati rice, mash or quinoa.",
   "image": "https://www.themealdb.com/images/media/meals/vptwyt1511450962.jpg"
  },
  {
   "id": "52968",
   "name": "Mbuzi Choma (Roasted Goat)",
   "ingredients": [
    "Goat Meat",
    "Corn Flour",
    "Tomatoes",
    "Salt",
    "Onion",
    "Green Chilli",
    "Coriander Leaves"
   ],
   "preparation": "1. Steps for the Meat: \r\n Roast meat over medium heat for 50 minutes and salt it as you turn it.\r\n\r\n2. Steps for Ugali:\r\nBring the water and salt to a boil in a heavy-bottomed saucepan. Stir in the cornmeal slowly, letting it fall through the fingers of your hand.\r\n\r\n3. Reduce heat to medium-low and continue stirring regularly, smashing any lumps with a spoon, until the mush pulls away from the sides of the pot and becomes very thick, about 10 minutes.\r\n\r\n4.Remove from heat and allow to cool.\r\n\r\n5. Place the ugali into a large serving bowl. Wet your hands with water, form a ball and serve.\r\n\r\n6. Steps for Kachumbari: Mix the tomatoes, onions, chili and coriander leaves in a bowl.\r\n\r\n7. Serve and enjoy!\r\n\r\n",
   "image": "https://www.themealdb.com/images/media/meals/cuio7s1555492979.jpg"
  },
  {
   "id": "52848",
   "name": "Bean & Sausage Hotpot",
   "ingredients": [
    "Sausages",
    "Tomato Sauce",
    "Butter Beans",
    "Black Treacle",
    "English Mustard"
   ],
   "preparation": "In a large casserole, fry the sausages until brown all over – about 10 mins.\r\n\r\nAdd the tomato sauce, stirring well, then stir in the beans, treacle or sugar and mustard. Bring to the simmer, cover and cook for 30 mins. Great served with crusty bread or rice.",
   "image": "https://www.themealdb.com/images/media/meals/vxuyrx1511302687.jpg"
  },
  {
   "id": "52890",
   "name": "Jam Roly-Poly",
   "ingredients": [
    "Butter",
    "Self-raising Flour",
    "Vanilla",
    "Suet",
    "Milk",
    "Raspberry Jam",
    "Custard"
   ],
   "preparation": "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.\r\nTip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.\r\nTip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.\r\nLet the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve.",
   "image": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg"
  },
  {
   "id": "52932",
   "name": "Pouding chomeur",
   "ingredients": [
    "Butter",
    "Sugar",
    "Eggs",
    "Vanilla Extract",
    "Flour",
    "Baking Powder",
    "Milk",
    "Maple Syrup",
    "Brown Sugar",
    "Single Cream",
    "Butter"
   ],
   "preparation": "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light.\r\nAdd eggs and vanilla and mix.\r\nIn another bowl, mix flour and baking powder.\r\nAlternate flour mix and milk to the butter mix.\r\nPour into a 13 inch by 9 inch greased pan.\r\nMAPLE SAUCE.\r\nIn a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir.\r\nReduce heat and and gently cook 2 minutes or till sauce has reduced a little bit.\r\nPour sauce gently over cake.\r\nBake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean.",
   "image": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg"
  },
  {
   "id": "52944",
   "name": "Escovitch Fish",
   "ingredients": [
    "Red Snapper",
    "Vegetable Oil",
    "Garlic",
    "Ginger",
    "Thyme",
    "Bay Leaf",
    "Red Pepper",
    "Yellow Pepper",
    "Onion",
    "Carrots",
    "Sugar",
    "Allspice",
    "Worcestershire Sauce",
    "Scotch Bonnet",
    "Lime",
    "Malt Vinegar",
    "Pepper"
   ],
   "preparation": "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.\r\n\r\nIn large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil\r\nAdd, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn\r\nThen add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. \r\n\r\nDiscard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance.",
   "image": "https://www.themealdb.com/images/media/meals/1520084413.jpg"
  },
  {
   "id": "53034",
   "name": "Japanese Katsudon",
   "ingredients": [
    "Vegetable Oil",
    "Onion",
    "Pork",
    "Vegetable Stock",
    "Soy Sauce",
    "Mirin",
    "Sugar",
    "Eggs",
    "Sushi Rice",
    "Chives"
   ],
   "preparation": "STEP 1\r\nHeat the oil in a pan, fry the sliced onion until golden brown, then add the tonkatsu (see recipe here), placing it in the middle of the pan. Mix the dashi, soy, mirin and sugar together and tip three-quarters of the mixture around the tonkatsu. Sizzle for a couple of mins so the sauce thickens a little and the tonkatsu reheats.\r\n\r\nSTEP 2\r\nTip the beaten eggs around the tonkatsu and cook for 2-3 mins until the egg is cooked through but still a little runny. Divide the rice between two bowls, then top each with half the egg and tonkatsu mix, sprinkle over the chives and serve immediately, drizzling with a little more soy if you want an extra umami kick.",
   "image": "https://www.themealdb.com/images/media/meals/d8f6qx1604182128.jpg"
  },
  {
   "id": "53037",
   "name": "Coddled pork with cider",
   "ingredients": [
    "Butter",
    "Pork Chops",
    "Bacon",
    "Potatoes",
    "Carrots",
    "Swede",
    "Cabbage",
    "Bay Leaf",
    "Cider",
    "Chicken Stock"
   ],
   "preparation": "STEP 1\r\nHeat the butter in a casserole dish until sizzling, then fry the pork for 2-3 mins on each side until browned. Remove from the pan.\r\n\r\nSTEP 2\r\nTip the bacon, carrot, potatoes and swede into the pan, then gently fry until slightly coloured. Stir in the cabbage, sit the chops back on top, add the bay leaf, then pour over the cider and stock. Cover the pan, then leave everything to gently simmer for 20 mins until the pork is cooked through and the vegetables are tender.\r\n\r\nSTEP 3\r\nServe at the table spooned straight from the dish.",
   "image": "https://www.themealdb.com/images/media/meals/7vpsfp1608588991.jpg"
  },
  {
   "id": "52915",
   "name": "French Omelette",
   "ingredients": [
    "Eggs",
    "Butter",
    "Parmesan",
    "Tarragon",
    "Parsley",
    "Chives",
    "Gruyère"
   ],
   "preparation": "Get everything ready. Warm a 20cm (measured across the top) non-stick frying pan on a medium heat. Crack the eggs into a bowl and beat them with a fork so they break up and mix, but not as completely as you would for scrambled egg. With the heat on medium-hot, drop one knob of butter into the pan. It should bubble and sizzle, but not brown. Season the eggs with the Parmesan and a little salt and pepper, and pour into the pan.\r\nLet the eggs bubble slightly for a couple of seconds, then take a wooden fork or spatula and gently draw the mixture in from the sides of the pan a few times, so it gathers in folds in the centre. Leave for a few seconds, then stir again to lightly combine uncooked egg with cooked. Leave briefly again, and when partly cooked, stir a bit faster, stopping while there’s some barely cooked egg left. With the pan flat on the heat, shake it back and forth a few times to settle the mixture. It should slide easily in the pan and look soft and moist on top. A quick burst of heat will brown the underside.\r\nGrip the handle underneath. Tilt the pan down away from you and let the omelette fall to the edge. Fold the side nearest to you over by a third with your fork, and keep it rolling over, so the omelette tips onto a plate – or fold it in half, if that’s easier. For a neat finish, cover the omelette with a piece of kitchen paper and plump it up a bit with your fingers. Rub the other knob of butter over to glaze. Serve immediately.",
   "image": "https://www.themealdb.com/images/media/meals/yvpuuy1511797244.jpg"
  },
  {
   "id": "52918",
   "name": "Fish Stew with Rouille",
   "ingredients": [
    "Prawns",
    "Olive Oil",
    "Dry White Wine",
    "Fish Stock",
    "Fennel",
    "Onion",
    "Garlic",
    "Potatoes",
    "Orange",
    "Star Anise",
    "Bay Leaf",
    "Harissa Spice",
    "Tomato Puree",
    "Chopped Tomatoes",
    "Mussels",
    "White Fish",
    "Thyme",
    "Bread"
   ],
   "preparation": "Twist the heads from the prawns, then peel away the legs and shells, but leave the tails intact. Devein each prawn. Fry the shells in 1 tbsp oil for 5 mins, until dark pink and golden in patches. Add the wine, boil down by two thirds, then pour in the stock. Strain into a jug, discarding the shells.\r\nHeat the rest of the oil in a deep frying pan or casserole. Add the fennel, onion and garlic, season, then cover and gently cook for 10 mins until softened. Meanwhile, peel the potato and cut into 2cm-ish chunks. Put into a pan of cold water, bring to the boil and cook for 5 mins until almost tender. Drain in a colander.\r\nPeel a strip of zest from the orange. Put the zest, star anise, bay and ½ tsp harissa into the pan. Fry gently, uncovered, for 5-10 mins, until the vegetables are soft, sweet and golden.\r\nStir in the tomato purée, cook for 2 mins, then add the tomatoes and stock. Simmer for 10 mins until the sauce thickens slightly. Season to taste. The sauce can be made ahead, then reheated later in the day. Meantime, scrub the mussels or clams and pull away any stringy beards. Any that are open should be tapped sharply on the worktop – if they don’t close after a few seconds, discard them.\r\nReheat the sauce if necessary, then stir the potato, chunks of fish and prawns very gently into the stew. Bring back to the boil, then cover and gently simmer for 3 mins. Scatter the mussels or clams over the stew, then cover and cook for 2 mins more or until the shells have opened wide. Discard any that remain closed. The chunks of fish should flake easily and the prawns should be pink through. Scatter with the thyme leaves.\r\nTo make the quick rouille, stir the rest of the harissa through the mayonnaise. Serve the stew in bowls, topped with spoonfuls of rouille, which will melt into the sauce and enrich it. Have some good bread ready, as you’ll definitely want to mop up the juices.",
   "image": "https://www.themealdb.com/images/media/meals/vptqpw1511798500.jpg"
  },
  {
   "id": "52954",
   "name": "Hot and Sour Soup",
   "ingredients": [
    "Mushrooms",
    "Wood Ear Mushrooms",
    "Tofu",
    "Pork",
    "Chicken Stock",
    "Salt",
    "Sugar",
    "Sesame Seed Oil",
    "Pepper",
    "Hotsauce",
    "Vinegar",
    "Soy Sauce",
    "Cornstarch",
    "Water",
    "Spring Onions"
   ],
   "preparation": "STEP 1 - MAKING THE SOUP\r\nIn a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, sesame seed oil, white pepper, hot pepper sauce, vinegar and soy sauce and stir for few seconds.\r\nAdd Tofu, mushrooms, black wood ear mushrooms to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup and stir for 8 seconds\r\nServe the soup in a bowl and add the bbq pork and sliced green onions on top.",
   "image": "https://www.themealdb.com/images/media/meals/1529445893.jpg"
  },
  {
   "id": "52941",
   "name": "Red Peas Soup",
   "ingredients": [
    "Kidney Beans",
    "Carrots",
    "Spring Onions",
    "Thyme",
    "Onion",
    "Black Pepper",
    "Red Pepper",
    "Garlic Clove",
    "Allspice",
    "Beef",
    "Water",
    "Potatoes",
    "Plain Flour",
    "Water",
    "Coconut Milk"
   ],
   "preparation": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.",
   "image": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg"
  },
  {
   "id": "52835",
   "name": "Fettucine alfredo",
   "ingredients": [
    "Clotted Cream",
    "Butter",
    "Corn Flour",
    "Parmesan Cheese",
    "Nutmeg",
    "Fettuccine",
    "Parsley"
   ],
   "preparation": "In a medium saucepan, stir the clotted cream, butter and cornflour over a low-ish heat and bring to a low simmer. Turn off the heat and keep warm.\r\nMeanwhile, put the cheese and nutmeg in a small bowl and add a good grinding of black pepper, then stir everything together (don’t add any salt at this stage).\r\nPut the pasta in another pan with 2 tsp salt, pour over some boiling water and cook following pack instructions (usually 3-4 mins). When cooked, scoop some of the cooking water into a heatproof jug or mug and drain the pasta, but not too thoroughly.\r\nAdd the pasta to the pan with the clotted cream mixture, then sprinkle over the cheese and gently fold everything together over a low heat using a rubber spatula. When combined, splash in 3 tbsp of the cooking water. At first, the pasta will look wet and sloppy: keep stirring until the water is absorbed and the sauce is glossy. Check the seasoning before transferring to heated bowls. Sprinkle over some chives or parsley, then serve immediately.",
   "image": "https://www.themealdb.com/images/media/meals/uquqtu1511178042.jpg"
  },
  {
   "id": "52855",
   "name": "Banana Pancakes",
   "ingredients": [
    "Banana",
    "Eggs",
    "Baking Powder",
    "Vanilla Extract",
    "Oil",
    "Pecan Nuts",
    "Raspberries"
   ],
   "preparation": "In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r\nHeat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries.",
   "image": "https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg"
  },
  {
   "id": "52941",
   "name": "Red Peas Soup",
   "ingredients": [
    "Kidney Beans",
    "Carrots",
    "Spring Onions",
    "Thyme",
    "Onion",
    "Black Pepper",
    "Red Pepper",
    "Garlic Clove",
    "Allspice",
    "Beef",
    "Water",
    "Potatoes",
    "Plain Flour",
    "Water",
    "Coconut Milk"
   ],
   "preparation": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.",
   "image": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg"
  },
  {
   "id": "52921",
   "name": "Provençal Omelette Cake",
   "ingredients": [
    "Eggs",
    "Olive Oil",
    "Courgettes",
    "Spring Onions",
    "Red Pepper",
    "Garlic Clove",
    "Red Chilli",
    "Cream Cheese",
    "Milk",
    "Chives",
    "Basil",
    "Rocket",
    "Parmesan"
   ],
   "preparation": "Break the eggs into two bowls, five in each. Whisk lightly and season with salt and pepper. Heat the oil in a pan, add the courgettes and spring onions, then fry gently for about 10 mins until softened. Cool, then stir into one bowl of eggs with a little salt and pepper. Add the roasted peppers to the other bowl of eggs with the garlic, chilli, salt and pepper.\r\nHeat a little oil in a 20-23cm frying pan, preferably non-stick. Pour the eggs with courgette into a measuring jug, then pourabout one-third of the mixture into the pan, swirling it to cover the base of the pan. Cook until the egg is set and lightly browned underneath, then cover the pan with a plate and invert the omelette onto it. Slide it back into the pan to cook the other side. Repeat with the remaining mix to make two more omelettes, adding a little oil to the pan each time. Stack the omelettes onto a plate. Make three omelettes in the same way with the red pepper mixture, then stack them on a separate plate.\r\nNow make the filling. Beat the cheese to soften it, then beat in the milk to make a spreadable consistency. Stir in the herbs, salt and pepper. Line a deep, 20-23cm round cake tin with cling film (use a tin the same size as the frying pan). Select the best red pepper omelette and place in the tin, prettiest side down. Spread with a thin layer of cheese filling, then cover with a courgette omelette. Repeat, alternating the layers, until all the omelettes and filling are in the tin, finishing with an omelette. Flip the cling film over the omelette, then chill for up to 24 hrs.\r\nTo serve, invert the omelette cake onto a serving plate and peel off the cling film. Pile rocket on the top and scatter over the cheese, a drizzle of olive oil and a little freshly ground black pepper. Serve cut into wedges.",
   "image": "https://www.themealdb.com/images/media/meals/qwtrtp1511799242.jpg"
  },
  {
   "id": "52858",
   "name": "New York cheesecake",
   "ingredients": [
    "Butter",
    "Sour Cream",
    "Sugar",
    "Cream Cheese",
    "Caster Sugar",
    "Plain Flour",
    "Lemon Juice",
    "Eggs",
    "Sour Cream",
    "Sour Cream",
    "Caster Sugar",
    "Lemon Juice"
   ],
   "preparation": "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.\r\nFor the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.\r\nSwap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.\r\nBrush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.\r\nCombine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.\r\nRun a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.",
   "image": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg"
  },
  {
   "id": "52841",
   "name": "Creamy Tomato Soup",
   "ingredients": [
    "Olive Oil",
    "Onions",
    "Celery",
    "Carrots",
    "Potatoes",
    "Bay Leaf",
    "Tomato Puree",
    "Sugar",
    "White Vinegar",
    "Chopped Tomatoes",
    "Passata",
    "Vegetable Stock Cube",
    "Whole Milk"
   ],
   "preparation": "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.\r\nStir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r\nTo serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls.",
   "image": "https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg"
  },
  {
   "id": "53068",
   "name": "Beef Mechado",
   "ingredients": [
    "Garlic",
    "Onion",
    "Beef",
    "Tomato Puree",
    "Water",
    "Olive Oil",
    "Lemon",
    "Potatoes",
    "Soy Sauce",
    "Black Pepper",
    "Bay Leaves",
    "Salt"
   ],
   "preparation": "0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.\r\n1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.\r\n2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.\r\n3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.\r\n4.\tTransfer to a serving plate. Serve with Saffron rice.\r\n5.\tShare and enjoy!\r\n",
   "image": "https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg"
  },
  {
   "id": "52827",
   "name": "Massaman Beef curry",
   "ingredients": [
    "Peanuts",
    "Coconut cream",
    "Massaman curry paste",
    "Beef",
    "Potatoes",
    "Onion",
    "Lime",
    "Cinnamon stick",
    "Tamarind paste",
    "Brown sugar",
    "Fish Sauce",
    "chilli",
    "Jasmine Rice"
   ],
   "preparation": "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.\r\nHeat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.\r\nSprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice.",
   "image": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg"
  },
  {
   "id": "52899",
   "name": "Dundee cake",
   "ingredients": [
    "Almonds",
    "Butter",
    "Muscovado Sugar",
    "Orange",
    "Apricot Jam",
    "Plain Flour",
    "Baking Powder",
    "Eggs",
    "Ground Almonds",
    "Milk",
    "Dried Fruit",
    "Glace Cherry",
    "Milk",
    "Caster Sugar"
   ],
   "preparation": "Put the almonds into a small bowl and pour over boiling water to just cover. Leave for 5 mins then drain in a sieve and leave to dry.\r\nPreheat the oven to 180C/160 C fan/Gas Mark 4. Line a deep loose-based 20cm cake tin with baking parchment.\r\nPut the butter in a large bowl and beat well until soft. Add the sugar and beat until light and fluffy. Stir in the orange zest and apricot jam.\r\nSieve together the flour and baking powder. Add the eggs to the creamed butter and sugar, a little at a time, beating well between each addition. If the mixture starts to curdle, stir in a little flour.\r\nAdd the remaining flour and ground almonds and mix well. Mix in the milk and then add the dried fruit and cherries and mix gently together.\r\nSpoon the mixture into the prepared tin and spread level using the back of a spoon. Arrange the whole almonds close together in neat circles on the top of the cake. Bake in the oven for 45 mins.\r\nLower the oven temperature to 160C/140 C fan/Gas Mark 3 and cook for a further 60–80 minutes. Check the cake after 50 minutes by inserting a wooden or metal skewer into the cake. When it’s done it should have just a few crumbs attached. Check every 10 minutes - it’s important not to overcook this cake so the centre will be a little soft.\r\nWhen cooked, remove the cake briefly from the oven, put the milk and sugar into a small pan and heat gently until the sugar has dissolved. Brush over the top of the cake and return the cake to the oven for 2-3 mins. Remove and allow the cake to cool in the tin. When quite cold remove from the tin and wrap in foil and keep for at least 2 days before cutting.",
   "image": "https://www.themealdb.com/images/media/meals/wxyvqq1511723401.jpg"
  },
  {
   "id": "53077",
   "name": "Cabbage Soup (Shchi)",
   "ingredients": [
    "Unsalted Butter",
    "Onion",
    "Cabbage",
    "Carrots",
    "Celery",
    "Bay Leaf",
    "Vegetable Stock",
    "Potatoes",
    "Tomatoes",
    "Sour Cream",
    "Dill"
   ],
   "preparation": "Add the butter to a large Dutch oven or other heavy-duty pot over medium heat. When the butter has melted, add the onion and sauté until translucent.\r\nAdd the cabbage, carrot, and celery. Sauté until the vegetables begin to soften, stirring frequently, about 3 minutes.\r\nAdd the bay leaf and vegetable stock and bring to a boil over high heat. Reduce the heat to low and simmer, covered, until the vegetables are crisp-tender, about 15 minutes.\r\nAdd the potatoes and bring it back to a boil over high heat. Reduce the heat to low and simmer, covered, until the potatoes are tender, about 10 minutes.\r\nAdd the tomatoes (or undrained canned tomatoes) and bring the soup back to a boil over high heat. Reduce the heat to low and simmer, uncovered, for 5 minutes. Season to taste with salt and pepper.\r\nemove and discard the bay leaf from the pot.\r\nServe topped with fresh sour cream and fresh dill.",
   "image": "https://www.themealdb.com/images/media/meals/60oc3k1699009846.jpg"
  },
  {
   "id": "53022",
   "name": "Polskie Naleśniki (Polish Pancakes)",
   "ingredients": [
    "Flour",
    "Eggs",
    "Milk",
    "Water",
    "Salt",
    "Sugar",
    "Butter"
   ],
   "preparation": "Add flour, eggs, milk, water, and salt in a large bowl then mix with a hand mixer until you have a smooth, lump-free batter.\r\nAt this point, mix in the butter or the vegetable oil. Alternatively, you can use them to grease the pan before frying each pancake.\r\nHeat a non-stick pan over medium heat, then pour in the batter, swirling the pan to help it spread.\r\nWhen the pancake starts pulling away a bit from the sides, and the top is no longer wet, flip it and cook shortly on the other side as well.\r\nTransfer to a plate. Cook the remaining batter until all used up.\r\nServe warm, with the filling of your choice.",
   "image": "https://www.themealdb.com/images/media/meals/58bkyo1593350017.jpg"
  },
  {
   "id": "52771",
   "name": "Spicy Arrabiata Penne",
   "ingredients": [
    "penne rigate",
    "olive oil",
    "garlic",
    "chopped tomatoes",
    "red chilli flakes",
    "italian seasoning",
    "basil",
    "Parmigiano-Reggiano"
   ],
   "preparation": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.\r\nIn a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.\r\nDrain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
   "image": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg"
  },
  {
   "id": "53071",
   "name": "Beef Asado",
   "ingredients": [
    "Beef",
    "Beef Stock Concentrate",
    "Tomato Puree",
    "Water",
    "Soy Sauce",
    "White Wine Vinegar",
    "Pepper",
    "Bay Leaf",
    "Lemon",
    "Tomato Sauce",
    "Butter",
    "Olive Oil",
    "Onion",
    "Garlic"
   ],
   "preparation": "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r\n1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r\n2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r\n3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r\n4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r\n5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r\n6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r\n7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half.",
   "image": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg"
  },
  {
   "id": "52850",
   "name": "Chicken Couscous",
   "ingredients": [
    "Olive Oil",
    "Onion",
    "Chicken Breast",
    "Ginger",
    "Harissa Spice",
    "Dried Apricots",
    "Chickpeas",
    "Couscous",
    "Chicken Stock",
    "Coriander"
   ],
   "preparation": "Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r\n\r\nTip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like.",
   "image": "https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg"
  },
  {
   "id": "52910",
   "name": "Chinon Apple Tarts",
   "ingredients": [
    "Puff Pastry",
    "Dark Brown Soft Sugar",
    "Braeburn Apples",
    "Red Wine Jelly",
    "Creme Fraiche",
    "Icing Sugar",
    "Cardamom"
   ],
   "preparation": "To make the red wine jelly, put the red wine, jam sugar, star anise, clove, cinnamon stick, allspice, split vanilla pod and seeds in a medium saucepan. Stir together, then heat gently to dissolve the sugar. Turn up the heat and boil for 20 mins until reduced and syrupy. Strain into a small, sterilised jam jar and leave to cool completely. Will keep in the fridge for up to 1 month.\r\n\r\nTake the pastry out of the fridge and leave at room temperature for 10 mins, then unroll. Heat the grill to high and heat the oven to 180C/160C fan/gas 4. Cut out 2 x 13cm circles of pastry, using a plate as a guide, and place on a non-stick baking sheet. Sprinkle each circle with 1 tbsp sugar and grill for 5 mins to caramelise, watching carefully so that the sugar doesn’t burn. Remove from the grill. Can be done a few hours ahead, and left, covered, out of the fridge.\r\n\r\nPeel, quarter and core the apples, cut into 2mm-thin slices and arrange on top of the pastry. Sprinkle over the remaining sugar and pop in the oven for 20-25 mins until the pastry is cooked through and golden, and the apples are softened. Remove and allow to cool slightly. Warm 3 tbsp of the red wine jelly in a small pan over a low heat with 1 tsp water to make it a little more runny, then brush over the top of the tarts.\r\n\r\nTip the crème fraîche into a bowl, sift over the icing sugar and cardamom, and mix together. Carefully lift the warm tarts onto serving plates and serve with the cardamom crème fraîche.",
   "image": "https://www.themealdb.com/images/media/meals/qtqwwu1511792650.jpg"
  },
  {
   "id": "52980",
   "name": "Stamppot",
   "ingredients": [
    "Potatoes",
    "Bay Leaf",
    "Shallots",
    "Butter",
    "Kale",
    "Sausages",
    "Milk",
    "Nutmeg",
    "Salt",
    "Pepper"
   ],
   "preparation": "\r\nWash and peel the potatoes and cut into similarly sized pieces for even cooking.\r\n\r\nIn a large soup pot, boil the potatoes and the bay leaves in salted water for 20 minutes. Discard the bay leaves.\r\n\r\nIf you're not using a bag of ready-cut curly kale, wash the bunches thoroughly under cool running water to get rid of all soil—you wouldn't want that gritty texture in your finished dish. Trim any coarse stems and discard any brown leaves. With a sharp knife, cut the curly kale into thin strips.\r\n\r\nPeel and chop the shallots.\r\n\r\nIn a frying pan or skillet, melt 1 tbsp. of butter and saute the shallots for a few minutes before adding the curly kale and 2 tbsp. of water. Season and cook for about 10 minutes, or until tender.\r\n\r\nWarm the milk on the stove or in the microwave.\r\n\r\nDrain, shake and dry the potatoes with kitchen towels before mashing with a potato masher or ricer. Working quickly, add the warm milk and the remaining butter. Season to taste with nutmeg, salt, and pepper. \r\n\r\nMix the cooked curly kale through the cooked mashed potato mixture.\r\n\r\nTop with slices of the smoked sausage and serve hot with your favorite mustard or gravy.\r\n\r\nServe and enjoy!",
   "image": "https://www.themealdb.com/images/media/meals/hyarod1565090529.jpg"
  },
  {
   "id": "52780",
   "name": "Potato Gratin with Chicken",
   "ingredients": [
    "Potatoes",
    "Onions",
    "Olive Oil",
    "Chicken Stock",
    "Creme Fraiche",
    "Parmesan",
    "Chicken Breasts",
    "Bacon",
    "Spinach",
    "Peas"
   ],
   "preparation": "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach.",
   "image": "https://www.themealdb.com/images/media/meals/qwrtut1468418027.jpg"
  },
  {
   "id": "52972",
   "name": "Tunisian Lamb Soup",
   "ingredients": [
    "Lamb Mince",
    "Garlic",
    "Onion",
    "Spinach",
    "Tomato Puree",
    "Cumin",
    "Chicken Stock",
    "Harissa Spice",
    "Chickpeas",
    "Lemon Juice",
    "Macaroni",
    "Salt",
    "Pepper"
   ],
   "preparation": "Add the lamb to a casserole and cook over high heat. When browned, remove from the heat and set aside.\r\nKeep a tablespoon of fat in the casserole and discard the rest. Reduce to medium heat then add the garlic, onion and spinach and cook until the onion is translucent and the spinach wilted or about 5 minutes.\r\nReturn the lamb to the casserole with the onion-spinach mixture, add the tomato puree, cumin, harissa, chicken, chickpeas, lemon juice, salt and pepper in the pan. Simmer over low heat for about 20 minutes.\r\nAdd the pasta and cook for 15 minutes or until pasta is cooked.",
   "image": "https://www.themealdb.com/images/media/meals/t8mn9g1560460231.jpg"
  },
  {
   "id": "52929",
   "name": "Timbits",
   "ingredients": [
    "Flour",
    "Sugar",
    "Baking Powder",
    "Salt",
    "Egg",
    "Milk",
    "Oil",
    "Oil",
    "Icing Sugar"
   ],
   "preparation": "Sift together dry ingredients.\r\nMix together wet ingredients and incorporate into dry. Stir until smooth.\r\nDrop by teaspoonfuls(no bigger) into hot oil (365 degrees, no hotter), turning after a few moments until golden brown on all sides.\r\nRemove and drain.\r\nRoll in cinnamon sugar while still warm and serve.",
   "image": "https://www.themealdb.com/images/media/meals/txsupu1511815755.jpg"
  },
  {
   "id": "52832",
   "name": "Coq au vin",
   "ingredients": [
    "Olive Oil",
    "Bacon",
    "Shallots",
    "Chicken Legs",
    "Chicken Thighs",
    "Chicken Breasts",
    "Garlic",
    "Brandy",
    "Red Wine",
    "Chicken Stock",
    "tomato puree",
    "thyme",
    "Rosemary",
    "bay leaves",
    "parsley",
    "chestnut mushroom",
    "plain flour",
    "butter"
   ],
   "preparation": "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.\r\nPat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.\r\nScatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.\r\nReturn the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.\r\nJust before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.\r\nLift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley.",
   "image": "https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg"
  },
  {
   "id": "52794",
   "name": "Vegan Chocolate Cake",
   "ingredients": [
    "self raising flour",
    "coco sugar",
    "cacao",
    "baking powder",
    "flax eggs",
    "almond milk",
    "vanilla",
    "water"
   ],
   "preparation": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
   "image": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg"
  },
  {
   "id": "52934",
   "name": "Chicken Basquaise",
   "ingredients": [
    "Chicken",
    "Butter",
    "Olive Oil",
    "Red Onions",
    "Red Pepper",
    "Chorizo",
    "Sun-Dried Tomatoes",
    "Garlic",
    "Basmati Rice",
    "Tomato Puree",
    "Paprika",
    "Bay Leaves",
    "Thyme",
    "Chicken Stock",
    "Dry White Wine",
    "Lemons",
    "Black Olives",
    "Salt",
    "Pepper"
   ],
   "preparation": "Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\n\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\n\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\n\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.",
   "image": "https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg"
  },
  {
   "id": "53063",
   "name": "Chivito uruguayo",
   "ingredients": [
    "Beef Brisket",
    "Bread",
    "Lettuce",
    "Tomato",
    "Ham",
    "Mozzarella",
    "Bacon",
    "Egg",
    "Onion",
    "Pepper"
   ],
   "preparation": "Crush the meat so that it is finite and we put it on a griddle to brown. Put the eggs, bacon and ham to fry.\r\nCut the bread in half, put the beef brisket, the fried eggs, the bacon, the ham, the mozzarella, the tomato and the lettuce. Cover with the other half of the bread and serve.",
   "image": "https://www.themealdb.com/images/media/meals/n7qnkb1630444129.jpg"
  },
  {
   "id": "52930",
   "name": "Pate Chinois",
   "ingredients": [
    "Potatoes",
    "Butter",
    "Milk",
    "Minced Beef",
    "Onion",
    "Creamed Corn",
    "Paprika",
    "Parsley",
    "Salt",
    "Pepper"
   ],
   "preparation": "In a large pot of salted water, cook the potatoes until they are very tender. Drain.\r\nWith a masher, coarsely crush the potatoes with at least 30 ml (2 tablespoons) of butter. With an electric mixer, purée with the milk. Season with salt and pepper. Set aside.\r\nWith the rack in the middle position, preheat the oven to 190 °C (375 °F).\r\nIn a large skillet, brown the onion in the remaining butter. Add the meat and cook until golden brown. Season with salt and pepper. Remove from the heat.\r\nLightly press the meat at the bottom of a 20-cm (8-inch) square baking dish. Cover with the corn and the mashed potatoes. Sprinkle with paprika and parsley.\r\nBake for about 30 minutes. Finish cooking under the broiler. Let cool for 10 minutes.",
   "image": "https://www.themealdb.com/images/media/meals/yyrrxr1511816289.jpg"
  },
  {
   "id": "52903",
   "name": "French Onion Soup",
   "ingredients": [
    "Butter",
    "Olive Oil",
    "Onion",
    "Sugar",
    "Garlic Clove",
    "Plain Flour",
    "Dry White Wine",
    "Beef Stock",
    "Bread",
    "Gruyère"
   ],
   "preparation": "Melt the butter with the oil in a large heavy-based pan. Add the onions and fry with the lid on for 10 mins until soft. Sprinkle in the sugar and cook for 20 mins more, stirring frequently, until caramelised. The onions should be really golden, full of flavour and soft when pinched between your fingers. Take care towards the end to ensure that they don’t burn.\r\nAdd the garlic for the final few mins of the onions’ cooking time, then sprinkle in the flour and stir well. Increase the heat and keep stirring as you gradually add the wine, followed by the hot stock. Cover and simmer for 15-20 mins.\r\nTo serve, turn on the grill, and toast the bread. Ladle the soup into heatproof bowls. Put a slice or two of toast on top of the bowls of soup, and pile on the cheese. Grill until melted. Alternatively, you can complete the toasts under the grill, then serve them on top.",
   "image": "https://www.themealdb.com/images/media/meals/xvrrux1511783685.jpg"
  },
  {
   "id": "53044",
   "name": "Portuguese barbecued pork (Febras assadas)",
   "ingredients": [
    "Pork",
    "White Wine",
    "Paprika",
    "Lemon",
    "Lemon Juice",
    "Olive Oil",
    "Mayonnaise",
    "Potatoes",
    "Vegetable Oil"
   ],
   "preparation": "STEP 1\r\n\r\nCut the tenderloins into 5 equal-size pieces leaving the tail ends a little longer. Take a clear plastic bag and slip one of the pieces in. Bash it into an escalope the size of a side-plate with a rolling pin and repeat with the remaining pieces.\r\n\r\nSTEP 2\r\n\r\nPut the wine, paprika, some salt and pepper and the juice of ½ a lemon in a bowl and add the pork. Leave to marinate for 20-30 minutes, while you get your barbecue to the stage where the coals are glowing but there are no flames.\r\n\r\nSTEP 3\r\n\r\nTo make the chips, fill a basin with cool water and cut the potatoes into 3cm-thick chips. Soak them in the water for 5 minutes and then change the water. Leave for 5 more minutes. Drain and then pat dry on a towel or with kitchen paper.\r\n\r\nSTEP 4\r\n\r\nHeat the oil in a deep fryer or a deep heavy-based pan with a lid to 130C and lower the chips into the oil (in batches). Blanch for 8-10 minutes. Remove from the oil and drain well. Place on a tray to cool. Reheat the oil to 180C (make sure it’s hot or your chips will be soggy) and lower the basket of chips into the oil (again, do this in batches). Leave to cook for 2 minutes and then give them a little shake. Cook for another minute or so until they are well coloured and crisp to the touch. Drain well for a few minutes, tip into a bowl and sprinkle with sea salt.\r\n\r\nSTEP 5\r\n\r\nThe pork will cook quickly so do it in 2 batches. Take the pieces out of the marinade, rub them with oil, and drop them onto the barbecue (you could also use a chargrill). Cook for 1 minute on each side – they may flare up as you do so. This should really be enough time as they will keep on cooking. Take them off the barbecue and pile onto a plate. Repeat with the remaining batch.\r\n\r\nSTEP 6\r\n\r\nServe by piling a plate with chips, drop the pork on top of each pile and pouring the juices from the plate over so the chips take up the flavours. Top with a spoon of mayonnaise and a wedge of lemon.",
   "image": "https://www.themealdb.com/images/media/meals/cybyue1614349443.jpg"
  },
  {
   "id": "52967",
   "name": "Home-made Mandazi",
   "ingredients": [
    "Self-raising Flour",
    "Sugar",
    "Eggs",
    "Milk"
   ],
   "preparation": "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them.\r\nYou can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon.\r\nFor “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.\r\n\r\n1. Mix the flour,cinnamon and sugar in a suitable bowl.\r\n2. In a separate bowl whisk the egg into the milk\r\n3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough.\r\n4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface.\r\n5. Cover the dough with a damp cloth  and allow to rest for 15 minutes.\r\n6. Roll the dough on a lightly floured surface into a 1cm thick piece.\r\n7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying.\r\n8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side.\r\n9. Serve them warm or cold",
   "image": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg"
  },
  {
   "id": "53062",
   "name": "Walnut Roll Gužvara",
   "ingredients": [
    "Flour",
    "Caster Sugar",
    "Yeast",
    "Salt",
    "Milk",
    "Eggs",
    "Butter",
    "Walnuts",
    "Butter",
    "Brown Sugar",
    "Cinnamon",
    "Milk",
    "Icing Sugar"
   ],
   "preparation": "Mix all the ingredients for the dough together and knead well. Cover the dough and put to rise until doubled in size which should take about 2 hours. Knock back the dough and knead lightly.\r\n\r\nDivide the dough into two equal pieces; roll each piece into an oblong about 12 inches by 8 inches. Mix the filling ingredients together and divide between the dough, spreading over each piece. Roll up the oblongs as tightly as possible to give two 12 inch sausages. Place these side by side, touching each other, on a greased baking sheet. Cover and leave to rise for about 40 minutes. Heat oven to 200ºC (425ºF). Bake for 30-35 minutes until well risen and golden brown. Bread should sound hollow when the base is tapped.\r\n\r\nRemove from oven and brush the hot bread top with milk. Sift with a generous covering of icing sugar.",
   "image": "https://www.themealdb.com/images/media/meals/u9l7k81628771647.jpg"
  },
  {
   "id": "52781",
   "name": "Irish stew",
   "ingredients": [
    "whole wheat",
    "lamb loin chops",
    "olive oil",
    "shallots",
    "carrots",
    "turnips",
    "celeriac",
    "charlotte potatoes",
    "white wine",
    "caster sugar",
    "fresh thyme",
    "oregano",
    "chicken stock"
   ],
   "preparation": "Heat the oven to 180C/350F/gas mark 4. Drain and rinse the soaked wheat, put it in a medium pan with lots of water, bring to a boil and simmer for an hour, until cooked. Drain and set aside.\r\n\r\nSeason the lamb with a teaspoon of salt and some black pepper. Put one tablespoon of oil in a large, deep sauté pan for which you have a lid; place on a medium-high heat. Add some of the lamb – don't overcrowd the pan – and sear for four minutes on all sides. Transfer to a bowl, and repeat with the remaining lamb, adding oil as needed.\r\n\r\nLower the heat to medium and add a tablespoon of oil to the pan. Add the shallots and fry for four minutes, until caramelised. Tip these into the lamb bowl, and repeat with the remaining vegetables until they are all nice and brown, adding more oil as you need it.\r\n\r\nOnce all the vegetables are seared and removed from the pan, add the wine along with the sugar, herbs, a teaspoon of salt and a good grind of black pepper. Boil on a high heat for about three minutes.\r\n\r\nTip the lamb, vegetables and whole wheat back into the pot, and add the stock. Cover and boil for five minutes, then transfer to the oven for an hour and a half.\r\n\r\nRemove the stew from the oven and check the liquid; if there is a lot, remove the lid and boil for a few minutes.",
   "image": "https://www.themealdb.com/images/media/meals/sxxpst1468569714.jpg"
  },
  {
   "id": "53035",
   "name": "Ham hock colcannon",
   "ingredients": [
    "Floury Potatoes",
    "Butter",
    "Garlic Clove",
    "Cabbage",
    "Spring Onions",
    "Double Cream",
    "Mustard",
    "Ham",
    "Eggs"
   ],
   "preparation": "STEP 1\r\nPeel and cut the potatoes into even, medium-sized chunks. Put in a large pan filled with cold salted water, bring to the boil and cook for 10-15 mins until a knife can be inserted into the potatoes easily.\r\n\r\nSTEP 2\r\nMeanwhile, melt the butter in a large sauté pan over a medium heat. Add the garlic, cabbage, spring onions and some seasoning. Stir occasionally until the cabbage is wilted but still retains a little bite, then set aside.\r\n\r\nSTEP 3\r\nDrain the potatoes, leave to steam-dry for a couple of mins, then mash with the cream, mustard and seasoning in the same saucepan. Stir in the cabbage and ham hock. Keep warm over a low heat.\r\n\r\nSTEP 4\r\nReheat the pan you used to cook the cabbage (no need to wash first), add a splash of oil, crack in the eggs and fry to your liking. To serve, divide the colcannon between bowls and top each with a fried egg.",
   "image": "https://www.themealdb.com/images/media/meals/n41ny81608588066.jpg"
  },
  {
   "id": "52874",
   "name": "Beef and Mustard Pie",
   "ingredients": [
    "Beef",
    "Plain Flour",
    "Rapeseed Oil",
    "Red Wine",
    "Beef Stock",
    "Onion",
    "Carrots",
    "Thyme",
    "Mustard",
    "Egg Yolks",
    "Puff Pastry",
    "Green Beans",
    "Butter",
    "Salt",
    "Pepper"
   ],
   "preparation": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.",
   "image": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg"
  },
  {
   "id": "52997",
   "name": "Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber",
   "ingredients": [
    "Rice",
    "Onion",
    "Lime",
    "Garlic Clove",
    "Cucumber",
    "Carrots",
    "Ground Beef",
    "Soy Sauce"
   ],
   "preparation": "Add'l ingredients: mayonnaise, siracha\r\n\r\n1\r\n\r\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r\n\r\n2\r\n\r\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r\n\r\n3\r\n\r\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r\n\r\n5\r\n\r\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.",
   "image": "https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg"
  },
  {
   "id": "52908",
   "name": "Ratatouille",
   "ingredients": [
    "Aubergine",
    "Courgettes",
    "Yellow Pepper",
    "Tomato",
    "Olive Oil",
    "Basil",
    "Onion",
    "Garlic Clove",
    "Red Wine Vinegar",
    "Sugar"
   ],
   "preparation": "Cut the aubergines in half lengthways. Place them on the board, cut side down, slice in half lengthways again and then across into 1.5cm chunks. Cut off the courgettes ends, then across into 1.5cm slices. Peel the peppers from stalk to bottom. Hold upright, cut around the stalk, then cut into 3 pieces. Cut away any membrane, then chop into bite-size chunks.\r\nScore a small cross on the base of each tomato, then put them into a heatproof bowl. Pour boiling water over the tomatoes, leave for 20 secs, then remove. Pour the water away, replace the tomatoes and cover with cold water. Leave to cool, then peel the skin away. Quarter the tomatoes, scrape away the seeds with a spoon, then roughly chop the flesh.\r\nSet a sauté pan over medium heat and when hot, pour in 2 tbsp olive oil. Brown the aubergines for 5 mins on each side until the pieces are soft. Set them aside and fry the courgettes in another tbsp oil for 5 mins, until golden on both sides. Repeat with the peppers. Don’t overcook the vegetables at this stage, as they have some more cooking left in the next step.\r\nTear up the basil leaves and set aside. Cook the onion in the pan for 5 mins. Add the garlic and fry for a further min. Stir in the vinegar and sugar, then tip in the tomatoes and half the basil. Return the vegetables to the pan with some salt and pepper and cook for 5 mins. Serve with basil.",
   "image": "https://www.themealdb.com/images/media/meals/wrpwuu1511786491.jpg"
  },
  {
   "id": "52889",
   "name": "Summer Pudding",
   "ingredients": [
    "Strawberries",
    "Blackberries",
    "Redcurrants",
    "Raspberries",
    "Caster Sugar",
    "Bread"
   ],
   "preparation": "Bring out the juices: Wash fruit and gently dry on kitchen paper – keep strawberries separate. Put sugar and 3 tbsp water into a large pan. Gently heat until sugar dissolves – stir a few times. Bring to a boil for 1 min, then tip in the fruit (not strawberries). Cook for 3 mins over a low heat, stirring 2-3 times. The fruit will be softened, mostly intact and surrounded by dark red juice. Put a sieve over a bowl and tip in the fruit and juice.\r\nLine the bowl with cling film and prepare the bread: Line the 1.25-litre basin with cling film as this will help you to turn out the pudding. Overlap two pieces of cling film in the middle of the bowl as it’s easier than trying to get one sheet to stick to all of the curves. Let the edges overhang by about 15cm. Cut the crusts off the bread. Cut 4 pieces of bread in half, a little on an angle, to give 2 lopsided rectangles per piece. Cut 2 slices into 4 triangles each and leave the final piece whole.\r\nBuild the pud: Dip the whole piece of bread into the juice for a few secs just to coat. Push this into the bottom of the basin. Now dip the wonky rectangular pieces one at a time and press around the basin’s sides so that they fit together neatly, alternately placing wide and narrow ends up. If you can’t quite fit the last piece of bread in it doesn’t matter, just trim into a triangle, dip in juice and slot in. Now spoon in the softened fruit, adding the strawberries here and there as you go.\r\nLet flavours mingle then serve: Dip the bread triangles in juice and place on top – trim off overhang with scissors. Keep leftover juice for later. Bring cling film up and loosely seal. Put a side plate on top and weight down with cans. Chill for 6 hrs or overnight. To serve, open out cling film then put a serving plate upside-down on top and flip over. serve with leftover juice, any extra berries and cream.",
   "image": "https://www.themealdb.com/images/media/meals/rsqwus1511640214.jpg"
  },
  {
   "id": "52894",
   "name": "Battenberg Cake",
   "ingredients": [
    "Butter",
    "Caster Sugar",
    "Self-raising Flour",
    "Almonds",
    "Baking Powder",
    "Eggs",
    "Vanilla Extract",
    "Almond Extract",
    "Butter",
    "Caster Sugar",
    "Self-raising Flour",
    "Almonds",
    "Baking Powder",
    "Eggs",
    "Vanilla Extract",
    "Almond Extract",
    "Pink Food Colouring",
    "Apricot",
    "Marzipan",
    "Icing Sugar"
   ],
   "preparation": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.",
   "image": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg"
  },
  {
   "id": "52879",
   "name": "Chicken Parmentier",
   "ingredients": [
    "Potatoes",
    "Butter",
    "Double Cream",
    "Egg Yolks",
    "Butter",
    "Shallots",
    "Carrots",
    "Celery",
    "Garlic Clove",
    "White Wine",
    "Tomato Puree",
    "Tinned Tomatos",
    "Chicken Stock",
    "Chicken",
    "Black Olives",
    "Parsley",
    "Gruyere cheese"
   ],
   "preparation": "For the topping, boil the potatoes in salted water until tender. Drain and push through a potato ricer, or mash thoroughly. Stir in the butter, cream and egg yolks. Season and set aside.\r\nFor the filling, melt the butter in a large pan. Add the shallots, carrots and celery and gently fry until soft, then add the garlic. Pour in the wine and cook for 1 minute. Stir in the tomato purée, chopped tomatoes and stock and cook for 10–15 minutes, until thickened. Add the shredded chicken, olives and parsley. Season to taste with salt and pepper.\r\nPreheat the oven to 180C/160C Fan/Gas 4.\r\nPut the filling in a 20x30cm/8x12in ovenproof dish and top with the mashed potato. Grate over the Gruyère. Bake for 30–35 minutes, until piping hot and the potato is golden-brown.",
   "image": "https://www.themealdb.com/images/media/meals/uwvxpv1511557015.jpg"
  },
  {
   "id": "52764",
   "name": "Garides Saganaki",
   "ingredients": [
    "Raw king prawns",
    "Olive oil",
    "Chopped onion",
    "Freshly chopped parsley",
    "White wine",
    "Chopped tomatoes",
    "Minced garlic",
    "Cubed Feta cheese"
   ],
   "preparation": "Place the prawns in a pot and add enough water to cover. Boil for 5 minutes. Drain, reserving the liquid, and set aside.\r\nHeat 2 tablespoons of oil in a saucepan. Add the onion; cook and stir until soft. Mix in the parsley, wine, tomatoes, garlic and remaining olive oil. Simmer, stirring occasionally, for about 30 minutes, or until the sauce is thickened.\r\nWhile the sauce is simmering, the prawns should become cool enough to handle. First remove the legs by pinching them, and then pull off the shells, leaving the head and tail on.\r\nWhen the sauce has thickened, stir in the prawns. Bring to a simmer again if the sauce has cooled with the prawns, and cook for about 5 minutes. Add the feta and remove from the heat. Let stand until the cheese starts to melt. Serve warm with slices of crusty bread.\r\nThough completely untraditional, you can add a few tablespoons of stock or passata to this recipe to make a delicious pasta sauce. Toss with pasta after adding the feta, and serve.",
   "image": "https://www.themealdb.com/images/media/meals/wuvryu1468232995.jpg"
  },
  {
   "id": "52969",
   "name": "Chakchouka ",
   "ingredients": [
    "Tomatoes",
    "Olive Oil",
    "Onion",
    "Red Pepper",
    "Green Pepper",
    "Garlic",
    "Cumin",
    "Paprika",
    "Salt",
    "Chili Powder",
    "Eggs"
   ],
   "preparation": "In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion and sauté for 2-3 minutes, until softened. Add the peppers and garlic, and sauté for an additional 3-5 minutes. Add the tomatoes, cumin, paprika, salt, and chili powder. Mix well and bring the mixture to a simmer. Reduce the heat to medium low and continue to simmer, uncovered, 10-15 minutes until the mixture has thickened to your desired consistency. (Taste the sauce at this point and adjust for salt and spice, as desired.) Using the back of a spoon, make four craters in the mixture, large enough to hold an egg. Crack one egg into each of the craters. Cover the skillet and simmer for 5-7 minutes, until the eggs have set. Serve immediately with crusty bread or pita.",
   "image": "https://www.themealdb.com/images/media/meals/gpz67p1560458984.jpg"
  },
  {
   "id": "53025",
   "name": "Ful Medames",
   "ingredients": [
    "Broad Beans",
    "Parsley",
    "Olive Oil",
    "Lemons",
    "Garlic Clove",
    "Cumin"
   ],
   "preparation": "As the cooking time varies depending on the quality and age of the beans, it is good to cook them in advance and to reheat them when you are ready to serve. Cook the drained beans in a fresh portion of unsalted water in a large saucepan with the lid on until tender, adding water to keep them covered, and salt when the beans have softened. They take 2–2 1/2 hours of gentle simmering. When the beans are soft, let the liquid reduce. It is usual to take out a ladle or two of the beans and to mash them with some of the cooking liquid, then stir this back into the beans. This is to thicken the sauce.\r\nServe the beans in soup bowls sprinkled with chopped parsley and accompanied by Arab bread.\r\nPass round the dressing ingredients for everyone to help themselves: a bottle of extra-virgin olive oil, the quartered lemons, salt and pepper, a little saucer with the crushed garlic, one with chili-pepper flakes, and one with ground cumin.\r\nThe beans are eaten gently crushed with the fork, so that they absorb the dressing.\r\nOptional Garnishes\r\nPeel hard-boiled eggs—1 per person—to cut up in the bowl with the beans.\r\nTop the beans with a chopped cucumber-and-tomato salad and thinly sliced mild onions or scallions. Otherwise, pass round a good bunch of scallions and quartered tomatoes and cucumbers cut into sticks.\r\nServe with tahina cream sauce (page 65) or salad (page 67), with pickles and sliced onions soaked in vinegar for 30 minutes.\r\nAnother way of serving ful medames is smothered in a garlicky tomato sauce (see page 464).\r\nIn Syria and Lebanon, they eat ful medames with yogurt or feta cheese, olives, and small cucumbers.\r\nVariations\r\nA traditional way of thickening the sauce is to throw a handful of red lentils (1/4 cup) into the water at the start of the cooking.\r\nIn Iraq, large brown beans are used instead of the small Egyptian ones, in a dish called badkila, which is also sold for breakfast in the street.",
   "image": "https://www.themealdb.com/images/media/meals/lvn2d51598732465.jpg"
  },
  {
   "id": "53050",
   "name": "Ayam Percik",
   "ingredients": [
    "Chicken Thighs",
    "Challots",
    "Ginger",
    "Garlic Clove",
    "Cayenne Pepper",
    "Turmeric",
    "Cumin",
    "Coriander",
    "Fennel",
    "Tamarind Paste",
    "Coconut Milk",
    "Sugar",
    "Water"
   ],
   "preparation": "In a blender, add the ingredients for the spice paste and blend until smooth.\r\nOver medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.\r\nAdd the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.\r\nWhen the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.\r\nPreheat the oven to 425 F.\r\nRemove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.\r\nLet chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice).",
   "image": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg"
  },
  {
   "id": "52968",
   "name": "Mbuzi Choma (Roasted Goat)",
   "ingredients": [
    "Goat Meat",
    "Corn Flour",
    "Tomatoes",
    "Salt",
    "Onion",
    "Green Chilli",
    "Coriander Leaves"
   ],
   "preparation": "1. Steps for the Meat: \r\n Roast meat over medium heat for 50 minutes and salt it as you turn it.\r\n\r\n2. Steps for Ugali:\r\nBring the water and salt to a boil in a heavy-bottomed saucepan. Stir in the cornmeal slowly, letting it fall through the fingers of your hand.\r\n\r\n3. Reduce heat to medium-low and continue stirring regularly, smashing any lumps with a spoon, until the mush pulls away from the sides of the pot and becomes very thick, about 10 minutes.\r\n\r\n4.Remove from heat and allow to cool.\r\n\r\n5. Place the ugali into a large serving bowl. Wet your hands with water, form a ball and serve.\r\n\r\n6. Steps for Kachumbari: Mix the tomatoes, onions, chili and coriander leaves in a bowl.\r\n\r\n7. Serve and enjoy!\r\n\r\n",
   "image": "https://www.themealdb.com/images/media/meals/cuio7s1555492979.jpg"
  },
  {
   "id": "52996",
   "name": "French Onion Chicken with Roasted Carrots & Mashed Potatoes",
   "ingredients": [
    "Chicken Breasts",
    "Carrots",
    "Small Potatoes",
    "Onion",
    "Beef Stock",
    "Mozzarella",
    "Sour Cream",
    "Butter",
    "Sugar",
    "Vegetable Oil",
    "Salt",
    "Pepper"
   ],
   "preparation": "1\r\n\r\nPreheat oven to 425 degrees. Wash and dry all produce. Trim, peel, and cut carrots on a diagonal into ¼-inch-thick pieces. Dice potatoes into ½-inch pieces. Halve, peel, and thinly slice onion.\r\n\r\n2\r\n\r\nToss carrots on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 15-20 minutes.\r\n\r\n3\r\n\r\nMeanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 12-15 minutes. Drain and return potatoes to pot; cover to keep warm.\r\n\r\n4\r\n\r\nWhile potatoes cook, heat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring occasionally, until lightly browned and softened, 8-10 minutes. Sprinkle with 1 tsp sugar (2 tsp for 4 servings). Stir in stock concentrate and 2 TBSP water (¼ cup for 4); season with salt and pepper. Cook until jammy, 2-3 minutes more. Turn off heat; transfer to a small bowl. Wash out pan.\r\n\r\n5\r\n\r\nPat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in pan used for onion over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. In the last 1-2 minutes of cooking, top with caramelized onion and cheese. Cover pan until cheese melts. (If your pan doesn’t have a lid, cover with a baking sheet!)\r\n\r\n6\r\n\r\nHeat pot with drained potatoes over low heat; mash with sour cream, 2 TBSP butter (4 TBSP for 4 servings), salt, pepper, and a splash of water (or milk, for extra richness) until smooth. Divide chicken, roasted carrots, and mashed potatoes between plates.",
   "image": "https://www.themealdb.com/images/media/meals/b5ft861583188991.jpg"
  },
  {
   "id": "52977",
   "name": "Corba",
   "ingredients": [
    "Lentils",
    "Onion",
    "Carrots",
    "Tomato Puree",
    "Cumin",
    "Paprika",
    "Mint",
    "Thyme",
    "Black Pepper",
    "Red Pepper Flakes",
    "Vegetable Stock",
    "Water",
    "Sea Salt"
   ],
   "preparation": "Pick through your lentils for any foreign debris, rinse them 2 or 3 times, drain, and set aside.  Fair warning, this will probably turn your lentils into a solid block that you’ll have to break up later\r\nIn a large pot over medium-high heat, sauté the olive oil and the onion with a pinch of salt for about 3 minutes, then add the carrots and cook for another 3 minutes.\r\nAdd the tomato paste and stir it around for around 1 minute. Now add the cumin, paprika, mint, thyme, black pepper, and red pepper as quickly as you can and stir for 10 seconds to bloom the spices. Congratulate yourself on how amazing your house now smells.\r\nImmediately add the lentils, water, broth, and salt. Bring the soup to a (gentle) boil.\r\nAfter it has come to a boil, reduce heat to medium-low, cover the pot halfway, and cook for 15-20 minutes or until the lentils have fallen apart and the carrots are completely cooked.\r\nAfter the soup has cooked and the lentils are tender, blend the soup either in a blender or simply use a hand blender to reach the consistency you desire. Taste for seasoning and add more salt if necessary.\r\nServe with crushed-up crackers, torn up bread, or something else to add some extra thickness.  You could also use a traditional thickener (like cornstarch or flour), but I prefer to add crackers for some texture and saltiness.  Makes great leftovers, stays good in the fridge for about a week.",
   "image": "https://www.themealdb.com/images/media/meals/58oia61564916529.jpg"
  },
  {
   "id": "52998",
   "name": "Corned Beef and Cabbage",
   "ingredients": [
    "Beef Brisket",
    "Small Potatoes",
    "Carrots",
    "Cabbage"
   ],
   "preparation": "1\r\n\r\nPlace corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound or until tender.\r\n\r\n2\r\n\r\nAdd whole potatoes and peeled and cut carrots, and cook until the vegetables are almost tender. Add cabbage and cook for 15 more minutes. Remove meat and let rest 15 minutes.\r\n\r\n3\r\n\r\nPlace vegetables in a bowl and cover. Add as much broth (cooking liquid reserved in the Dutch oven or large pot) as you want. Slice meat across the grain.",
   "image": "https://www.themealdb.com/images/media/meals/xb97a81583266727.jpg"
  },
  {
   "id": "52941",
   "name": "Red Peas Soup",
   "ingredients": [
    "Kidney Beans",
    "Carrots",
    "Spring Onions",
    "Thyme",
    "Onion",
    "Black Pepper",
    "Red Pepper",
    "Garlic Clove",
    "Allspice",
    "Beef",
    "Water",
    "Potatoes",
    "Plain Flour",
    "Water",
    "Coconut Milk"
   ],
   "preparation": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.",
   "image": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg"
  },
  {
   "id": "52907",
   "name": "Duck Confit",
   "ingredients": [
    "Sea Salt",
    "Bay Leaf",
    "Garlic",
    "Thyme",
    "Duck Legs",
    "White Wine"
   ],
   "preparation": "The day before you want to make the dish, scatter half the salt, half the garlic and half of the herbs over the base of a small shallow dish. Lay the duck legs, skin-side up, on top, then scatter over the remaining salt, garlic and herbs. Cover the duck and refrigerate overnight. This can be done up to 2 days ahead.\r\nPour the wine into a saucepan that will snugly fit the duck legs in a single layer. Brush the salt off the duck legs and place them, skin-side down, in the wine. Cover the pan with a lid and place over a medium heat. As soon as the wine starts to bubble, turn the heat down to the lowest setting and cook for 2 hours, checking occasionally that the liquid is just barely simmering. (If you own a heat diffuser, it would be good to use it here.) After 2 hours, the duck legs should be submerged in their own fat and the meat should feel incredibly tender when prodded. Leave to cool.\r\nThe duck legs are now cooked and can be eaten immediately – or you can follow the next step if you like them crisp. If you are preparing ahead, pack the duck legs tightly into a plastic container or jar and pour over the fat, but not the liquid at the bottom of the pan. Cover and leave in the fridge for up to a month, or freeze for up to 3 months. The liquid you are left with makes a tasty gravy, which can be chilled or frozen until needed.\r\nTo reheat and crisp up the duck legs, heat oven to 220C/fan 200C/gas 7. Remove the legs from the fat and place them, skin-side down, in an ovenproof frying pan. Roast for 30-40 mins, turning halfway through, until brown and crisp. Serve with the reheated gravy, a crisp salad and some crisp golden ptoatoes.",
   "image": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg"
  },
  {
   "id": "52965",
   "name": "Breakfast Potatoes",
   "ingredients": [
    "Potatoes",
    "Olive Oil",
    "Bacon",
    "Garlic Clove",
    "Maple Syrup",
    "Parsley",
    "Salt",
    "Pepper",
    "Allspice"
   ],
   "preparation": "Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!\r\nWash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.\r\nIn the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.\r\nOnce the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.\r\nCook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.\r\nChop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.\r\nOnce the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.\r\nLet the garlic cook until fragrant, about one minute.\r\nJust before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.\r\nServe in a warm bowl with a sunny side up egg!",
   "image": "https://www.themealdb.com/images/media/meals/1550441882.jpg"
  }
 ]
}